Repository: wescamp/Era_of_Magic-1.10
Catalog: po/*.po
Languages: de, hu, it, ja, pl

source: As a member of the homunculus light brigade, they are most widely used as its military arm. Faced with the choice of sacrificing speed for strength, experienced pilots have on board an additional machine gun, yet another piece of futuristic gadgetry used to strike down their foes from afar. Although inaccurate, the machine gun is possessed with a seemingly unnatural speed, reaping death among the enemy ranks. As it draws closer, and the advantage of long range fire is neutralized, a gunman will switch to a more contemporary form of offense, sowing seeds of destruction with explosives that are unleashed to devastating effect.
de: Wenn sie Schlagkraft der Schnellligkeit vorziehen, rüsten sich erfahrene Piloten mit einem »Maschinengewehr« aus, einem weiteren futuristischen Gerät, um ihre Feinde aus der Ferne auszuschalten. Ist es doch ungenau, so ist es durch seine unheimliche Feuerrate sehr wohl in der Lage, Tod auf die Reihen der Gegner regnen zu lassen. Wenn der Ballon so nah herangekommen ist, dass die hohe Reichweite keinen Vorteil mehr bringt, wechselt der Schütze zu der konventionelleren Angriffsform, die Saat der Zerstörung in Form vernichtender Bomben zu streuen,über
hu: Mint a légierők tagjait, gyakran vetik be őket a különböző hadjáratokban. A tapasztalt pilóták szembesülve azzal, hogy a sebesség érdekében a páncélzatot csökkentették, egy gépfegyvert vettek magukhoz, egy újabb furfangos eszközt, amivel a magasból lecsaphatnak ellenségeikre. Habár nem kigazán pontosak ezek a fegyverek, hihetetlenül gyorsak, s nagy pusztítást végeznek az ellenséges tömegekben. A messziről leadott lövések okozta előny közelről nem érvényesül, itt inkább a kosárból kidobott robbanó gránátok veszik át a hóhérmunkát.
it: I membri della brigata leggera degli omuncoli, sono spesso usati come esercito militare. Sacrificando la velocità per la potenza, gli esperti piloti hanno a bordo un utile pezzo di ingegneria futuristica: la mitragliatrice, che viene usata per colpire i nemici a distanza. Sebbene imprecisa, la mitragliatrice spara ad una velocità apparentemente anormale causando morte tra i ranghi nemici. È stata concepita per sparare a breve distanza, perciò è svantaggiata negli attacchi a lungo raggio, ma pronto a far fronte a questo difetto ci sarà sempre un nano armato, che seminerà morte e distruzione tra le fila nemiche con potenti esplosivi.

source: Mechanic
de: Mechaniker
hu: Mechanikus
it: Meccanico
ja: 整備士
pl: Mechanik

source: These dwarves are recruited for their uncanny knack for engineering. If their robotic creations are at the head of an offense, then the mechanics form the backbone, repairing oil leaks, replacing broken fuel tanks, and keeping the front line running in clockwork fashion. Even if beset by opposition they hold their own, employing their vast arsenal of tools to hold enemies at bay until their better armored brethren come to their rescue.
de: Diese Zwerge werden wegen ihrer unheimlichen Fähigkeiten im Ingenneurswesen angeheuert. Kämpfen ihrer robotischen Geschöpfe an vorderster Front, so sind die Mechaniker die Stütze, indem sie Öllecks reparieren, zerstörte Tanks austauschen und die Frontlinie wieder aufziehen. selbst wenn sie selbst in einen Kampf geraten, können sie sich verteidgen, indem sie mit ihrem gewaltigen Arsenal an Werkzeugen einsetzen, um ihre Feinde abzuhalten, bis ihre besser gerüsteten Brüder zu Hilfe kommen.
hu: Ezeket a törpöket a kiváló technikai érzékük miatt toborozták. Ha az általuk alkotott masinák állnak a támadások élén, a mechanikusok ott állnak mellettük, s megjavítják a szivárgó, megrongálódott üzemanyagtartályokat, s biztosítják, hogy e masinák óraműszerűen végezzék feladataikat. Ha az ellenség bekeríti őket, eszközeik garmadáját használják fel, hogy feltartsák a támadókat, míg jobban felfegyverzett társaik a segítségükre sietnek.
it: Questi nani sono assunti per la loro abilità ingegneristica fuori dal comune. Se le loro creazioni robotiche rappresentano il cuore dell’esercito, i meccanici costituiscono la spina dorsale, riparando perdite di olio, sostituendo serbatoi rotti ecc. In guerra mantengono sempre la loro posizione in tuta da lavoro anche se assaliti, impiegando il loro vasto arsenale di strumenti per tenere a bada i nemici fino a quando i loro fratelli “corazzati” verranno in loro soccorso.

source: saw
de: Säge
hu: fűrész
it: sega
ja: ノコギリ
pl: piła

source: key
de: Schraubenschlüssel
hu: kulcs
it: chiave
ja: スパナ
pl: klucz

source: screwdriver
de: Schraubenzieher
hu: csavarhúzó
it: cacciavite
ja: ねじ回し
pl: śrubokręt

source: grenade
de: Granate
hu: gránát
it: granata
ja: グレネード
pl: granat

source: Mechanical Dragon
de: Mechanischer Drache
hu: Mechanikus sárkány
it: Drago meccanico
ja: 機械竜
pl: Mechaniczny Smok

source: flame
de: Flammenwerfer
hu: láng
it: fiamma
ja: 火炎
pl: płomień

source: Pacificator
de: Befrieder
hu: Békéltető
it: Pacificatore
pl: Pacyfikator

source: Parachutist
de: Fallschirmspringer
hu: Ejtőernyős
it: Paracadutista
ja: 落下傘兵
pl: Spadochroniarz

source: Red Ulfserker
de: Roter Ulfserker
hu: Vörös dühöngő
it: Ulfserker rosso
ja: 赤い蒸気式狼戦士
pl: Czerwony Ulfserker

source: These beings are born from a ancient tradition, when dwarves become attached to their creations, and instead of reducing robotic corpses to scrap, they are often rebuilt as stronger, faster and sturdier fighters. The rust that forms their coat of paint is misleading, for they outstrip their younger cousins in every aspect. The additional heavy armor plating that is affixed upon them serves as a shield of sorts, and such is their inward vigour and strength, that they can turn back damage accrued through the tides of time through careful conservation of energy.
de: Hängen Zwerge an einer Erfindung, reparieren sie vernichtete Roboter als stärkere, schnellere, stabilere, bessere Version, statt die Trümmer zu verschrotten. Diese Tradition ist der Ursprung der Roten Ulfserker. Das rostige Äußere täuscht, denn sie übertreffen die neueren Modelle auf jede Weise. Zusätzliche schwere Panzerungen wurden eingebaut, und in ihrem Inneren ist so viel Stärke und Kraft, dass si durch sorgfältige Energieerhaltung im Laufe der Zeit anfallene Schäden ausbessern.
hu: Ezek a szerkezetek egy régi hagyomány alapján születtek. A törpök annyira kötődtek szerkentyűikhez, hogy a tönkrement robottesteket nem dobták a szemétdombra, hanem még erősebb, még gyorsabb, még keményebb fromában újjáépítették. A felületüket borító festés összetéveszthetetlen, s a korábbi változatokat minden szempontból felülmúlják. Egy újabb páncélréteggel felvértezett belső szerkezetük roppant ellenálló, s nagy erőt képes kifejteni, s képesek ellenállni az idők során egyre sokasodó rongálásoknak is.
it: Questi esseri fanno parte di una tradizione antica, e i nani si sono affezionati così tanto alle loro creazioni da non rottamarle, bensì di ricostruire dei combattenti ancora più forti, veloci e più resistenti. La ruggine che si forma attorno alla vernice è ingannevole, poiché superano in ogni aspetto i loro giovani cugini. L’aggiuntiva placca di ferro rivestita nella loro corazza funge da scudo, e grazie al loro vigore e alla loro forza interiore possono accumulare energia conservata nel corso della battaglia per contrattaccare i loro nemici.

source: Runemaster
de: Runologe
hu: Rúnamester
it: Maestro di rune
ja: ルーンマスター
pl: Mistrz Run

source: Rune Artist
de: Runenkundler
hu: Rúnaművész
it: Artista di rune
ja: ルーンアーティスト
pl: Artysta Runiczny

source: runic hammer
de: Verzauberter Hammer
it: martello runico

source: runes
de: Runenfluch
hu: rúnák
it: rune
ja: ルーン
pl: runy

source: lightning bolt
de: Blitz
hu: villámló bot
it: scarica elettrica
ja: 雷撃
pl: piorun

source: Runeadept
de: Runenschnitzer
hu: Rúnagyakornok
it: Adepto di rune
ja: ルーン使い
pl: Adept Run

source: These short but stout dwarfsmen are known as Runeadepts, forgers of fire in ancient tongue. When grouped in numbers, they are a fearsome sight to behold, and are armed with huge hammers that shatter through the enemy front lines. Though the very sight of them is intimidating enough, it is even more fearsome for the dwarven foe to see the unrelenting accuracy of their attacks, for these items of weaponary are imbued with potent forces of magic that rip through any trick aimed at hazing assault.
de: Diese kleinen, aber stämmigen Zwerge sind als Runenschnitzer bekannt, Schmiede des Feuers in Alten Zungen. Wenn sie in Gruppen agieren, sind sie ein furchteinflößender Anblick, zudem tragen sie riesige Hammer, die die Frontlinien der Feinde zerschmettern. Und obschon bereits ihr bloßer Anblick furchterregend genug ist, verängstigt die unnachgiebige Genauigkeit ihrer Angriffe die Gegner des Kleinen Volkes noch mehr, denn diese Objekte sind mit mächtiger Magie verzaubert, die alle Versuche, den Angriffen zu entgehen, zum Scheitern verurteilt.
hu: Ezek az alacsony, zömök törpök, mint rúnagyakornokok ismertek, ősi nyelven a tűz csiholói. Ha nagyobb számban jelennek meg, félelmetes erőt képviselnek, hatalmas pörölyeikkel áttörnek bármilyen ellenséges vonalon. Pusztán a látványuk is elegendő ahooz, hogy a törpök ellenségeinek inába szálljon a bátorsága, s ez csak fokozódik a támadások pontossága láttán, mivel a fegyvereiket átjáró mágia hatástalanítja az ellenséges védekező trükköket.
it: Questi piccoli ma robusti nani sono conosciuti come adepti di rune, fabbri di fuoco in lingua antica. In gruppi, rappresentano un avversario temibile, e sono armati di martelli enormi che frantumano le linee nemiche con precisione inesorabile. Molte delle loro armi sono imbevute di potenti magie in grado di bloccare ogni tipo di assalto.

source: Runesmith
de: Runenschmied
hu: Rúnakovács
it: Fabbro di rune
ja: ルーンスミス
pl: Kowal Run

source: Steam Berserker
de: Dampfberserker
hu: Gőzös dühöngő
it: Furioso a vapore
ja: 蒸気式狂戦士
pl: Parowy Berserker

source: Steam Ulfserker
de: Dampfulfserker
hu: Dühöngő gőzös
it: Ulfserker a vapore
ja: 蒸気式狼戦士
pl: Parowy Ulfserker

source: Steam Ulfserkers are the face of any serious offensive movement. Armoured and armed with steel, they cut through opposition lines with ease, for these mechanical beings hold nothing back in a assault. It results in locking the opponent in close combat, attacking in a furious frenzy that only ends when either one is dead.
de: Die Dampfulfserker sind das Gesicht jenes ernstzunehmenden Angriffsmaneuver. Gerüstet durch Stahl brechen sie mit leichtigkeit durch die feindlichen Reihen, da diese mechanischen Wesen nichts zurückhalten. Und so finden sich Feinde wieder in einem Kampf um Leben und Tod, bei dem ihm ein zornesrasender Roboter gegenübersteht.
hu: A gőzös dühöngők minden komoly támadó hadmozdulat aktív részesei. Acélfegyvereikkel és vértjeikkel könnyedén törnek át az ellenség vonalain, mivel ezeket a szerkezeteket semmi sem tartja vissza a rohamtól. Emiatt közelharcban ádáz dühvel vetik magukat a küzdelembe, s csak
it: Gli ulfserker a vapore sono la figura più importante dell’offensiva. Armati e rivestiti d’acciaio, rompono facilmente le linee nemiche ed, essendo delle creature meccaniche, non sentono il bisogno di razziare i luoghi assaltati. Sono esperti nei combattimenti corpo a corpo, attaccando il nemico con una furia così cieca che termina solo quando uno dei due muore.

source: Steamcopter
de: Gyrokopter
hu: Gőzkopter
it: Girocottero a vapore
ja: 蒸気式ヘリコプター
pl: Parokopter

source: With the aid of steam genies, Steamcopters are able to move faster and carry more bombs than Gyrocopters.
de: Diese geheimnisvollen Geräte sind noch schneller als die Ballone.
hu: A gőzdzsinnek segítségével a gőzkopterek gyorsabb mozgásra képesek, és több bombát is képesek magukkal vinni, mint a helikopterek.
it: Creati da dei veri geni in materia, i girocotteri a vapore sono in grado di muoversi più velocemente e portare più bombe con sé rispetto ai normali girocotteri.

source: Striding Machine
de: Kriegsmaschine
hu: Lépegető
it: Nanopode
ja: 歩行器
pl: Machina Krocząca

source: Technician
de: Techniker
hu: Technikus
it: Tecnico
ja: 技術士
pl: Technik

source: Blessed with remarkable deftness with their fingers, these Technicians refute all that demean their race as heavy handed, drunkards, and if any liquor is to found on them, then it is only within the strong spirits which they employ in continuous campaign against rust. Despite their scarcity, they serve as important a role as the standardized teams of Mechanics, and are capable of repairing all but the most severe damage upon any mechanical unit. More importantly, such is their proficiency in their line of work that they have been able to spare time to dedicate on converting those tools that they work with into deadly weapons that are more than a match for any who attempt to harry them.
de: Mit ihrem bemerkenswerten Geschick strafen sie alle Vorurteile lügen, die Zwerge als grobe Säufer darstellen, und wenn überhaupt, so kann man bei ihnen an Hochprozentigen nur finden, was sie in ihrem ewigen Kampf mit dem Rost einsetzen. Obwohl sie rar sind, ist ihre Rolle so wichtig wie die standartisierten Teams von Mechanikern, und können nur die allerschwersten Schäden an jedem mechanischen Gerät nicht beheben. Und, noch wichtiger, sie erfüllen so gut ihr Pensum, dass sie die Muße haben, ihre Werkzeuge zu tödlichen Waffen zu modifizieren, die sie jedem ebenbürtig sind, der sie von ihrer Berufung abzuhalten versucht.
hu: Ezek a figyelemre méltó kézügyességgel megáldott technikusok alaposan rácáfolnak a fajukról alkotott előítéletekre, miszerint durvakezű, iszákos népség lennének. S ha néha érződik körülöttük egy kis alkoholszag, az azokból az erős folyadékokból ered, amit a rozsdásodás megakadályozására használnak gépeikben. Habár kevesen vannak, állandó helyük van a mechanikusok táborában, mivel bármilyen eszköz bármilyen sérülését képesek megjavítani. Ami még ennél is fontosabb, bármikor készen állnak a kezük ügyébe eső eszközeikből halálos fegyvereket barkácsolni, ami több, mint életveszélyes arra, aki háborgatni meri őket.
it: Abili nei lavori manuali, i tecnici dimostrano tutto ciò che svilisce la loro razza come goffi, ubriaconi e con la mano pesante; solo bere liquore li fa lavorare nella continua lotta contro la ruggine. Nonostante la loro scarsità, giocano un importante ruolo nelle squadre dei meccanici, riparando tutto, anche i danni più gravi su qualsiasi unità meccanica. Ancora più importante è la loro abilità nel risparmiare tempo da dedicare nella creazione di armi micidiali che rappresentano una sfida per chiunque che tenti di abbatterle.

source: burner
de: Lötlampe
hu: lángszóró
it: inceneritore
ja: バーナー
pl: palnik

source: Battlemage
de: Kampfmagier
hu: Harcimágus
it: Mago della battaglia
ja: 戦いの魔術師
pl: Mag Bitewny

source: Battle Magi use their magic powers in battle, preforming devastating ranged attacks. They are, however, equiped only with daggers, and aren’t potent melee fighters.
de: Kampfmagier nutzen ihre Magie, um die Feinde des Reichs aus der Ferne zu bombadieren. Doch sind sie nur mit einem Dolch bewaffnet und keine guten Nahkämpfer.
hu: A csatamágusok mágikus erejüket a csaták alatt mutatják meg igazán, pusztító távolsági támadásokkal operálnak. Közelharcban viszont gyengék, mivel csak tőrrel vannak felfegyverkezve.
it: I maghi della battaglia usano i loro poteri magici per eseguire potenti attacchi a distanza. Comunque, sono equipaggiati con soli coltelli, e non sono molto forti nei combattimenti ravvicinati.

source: missile
de: Geschoss
hu: lövedék
it: proiettile
ja: 誘導弾
pl: pocisk

source: Black Mage
de: Schwarzer Magier
hu: Fekete mágus
it: Mago nero
ja: 黒の魔術師
pl: Czarny Mag

source: Black Magi know the art of black magic well, and use it as effectively as Dark Wizards.
de: Schwarze Magier kennen sich in den Dunklen Künsten gut aus.
hu: A fekete mágusok igen jól ismerik a feketemágiát, s legalább olyan hatékonyan használják is azt, mint a sötét varázslók.
it: I maghi neri conoscono molto bene l’arte della magia nera, e la praticano efficacemente come gli stregoni oscuri.

source: Deadly Eye
de: Auge des Todes
hu: Sólyomszem
it: Occhio mortale
ja: 致死の目
pl: Śmiercionośne Oko

source: Deadly Eyes are Magical Eyes that have somehow evolved. They can now solidify their auras, and use them like a fan of knives.
de: Augen des Todes sind eine fortgeschrittene Form der Magischen Augen. Sie können nun ihre Aura, einem Klingenfächer gleich, manifestieren.
hu: A sólyomszemek továbbfejlesztett mágikus szemek. Az aurájukat megkeményítették, s egyfajta késes propellerként használják.
it: Gli occhi mortali sono l’evoluzione degli occhi magici: ora possono rafforzare le loro aure, e usarle come se fossero dei coltelli.

source: blades
de: Klingen
hu: penge
it: lame
ja: 刃
pl: ostrza

source: Elementalist
de: Elementarier
hu: Elemvarázsló
it: Elementalista
ja: 精霊使い
pl: Elementalista

source: Elementalists aren’t as good in battle like other Enlightened Ones, but are relatively fast and become quite powerful quickly, choosing one of the Elemental Paths.
de: Elementarier sind schlechtere Kämpfer als die anderen Erleuchteten, doch sind sie recht schnell und können in kurzer Zeit sehr mächtig werden, wenn sie einen der Elementarpfade wählen.
hu: Az elemvarázslók nem olyan jók a harcban, mint más Megvilágosodottak, de viszonylag gyorsak és gyorsan fejlődnek, miután kiválasztották a számukra megfelelő Elemi Utat.
it: Gli elementalisti non sono molto bravi in battaglia come gli illuminati, ma dopo aver scelto una delle strade elementali, diventano molto veloci e forti in breve tempo.

source: Golden Mage
de: Goldener Magier
hu: Arany mágus
it: Mago dorato
ja: 金の魔術師
pl: Złoty Mag

source: Golden Magi are equally skilled with swords and magic. They wear beautiful golden armor, after which they’re named, and use greatswords. They are known to emerge victorious from the harshest conflicts.
de: Goldene Magier sind Krieger der Magie wie des Schwertes. Benannt sind sie nach ihrer herrlichen Goldrüstung, und sie kämpfen mit Langschwertern. Ihre Siege über widrigste Umstände sind legendär.
hu: Az aranymágusok egyaránt képzettek harcban és kardvívásban. Gyönyörű arany vértjük van, amiről a nevüket is kapták, s pallossal harcolnak. Köztudott róluk, hogy a legkeményebb ütközetekből is győztesen kerülnek ki.
it: La spada dei maghi dorati uguaglia la loro stessa magia. Dopo essere stati nominati come maghi, cominciano a indossare delle bellissime armature dorate e ad usare lo spadone come arma. Sono noti per uscire vittoriosi dai conflitti più difficili.

source: Golems are spirits from the Abyss, bound in corporal bodies made of stone by Enlightened Magi. Their favored method of war is to charge, ramming their enemies with their stout bodies.
de: Golems sind Geister aus dem Abgrund, die von den Erleuchteten Magiern in steinerne Körper gebunden wurden. Ihre bevorzugte Strategie ist es, ihre Gegner mit ihren massigen Leibern zu rammen.
hu: A gólemek a Mélység szellemei, akiket a Megvilágosodott mágusok egy kőtesthez kapcsoltak. Előszeretettel rohamozzák meg ellenségeiket, hogy testük súlyával zúzzák őket össze.
it: I golem sono spiriti dell’Abisso legati a un corpo concreto fatto di pietra dai maghi illuminati. Il loro metodo di guerra preferito è caricare il nemico e perquoterlo con i loro corpi robusti.

source: Golem Boss
de: Verbesserter Golem
hu: Gólem főnök
it: Capo dei golem
ja: ゴーレム ボス
pl: Golemowy Boss

source: After some time, the spirit inside of the Golem starts to change its visage, growing eyes of sort from which it can shoot missiles of cold.
de: Nach einiger Zeit beginnt der Geist im Golem, diesen zu verändern. Es wachsen ihm eine Art Augen, aus denen er frostige Geschosse aussenden kann.
hu: Kis idő elteltével a gólem kőtestbe zárt szelleme elkezdte átalakítani a testet, egyfajta szemet növesztett, amiből hideg nyilakat lövellhet az ellenségeire.
it: Dopo qualche tempo, lo spirito dentro al golem inizia a migliorare il potere della propria vista, avendo così la possibilità di sparare una specie di missili gelidi dai suoi occhi.

source: When Mastermagi learn all of the world’s secrets, they become gurus. Gurus, due to their amazing knowledge of the world’s occult secerts, are fearsome warriors, crushing their enemies beneath great chunks of rock they conjure out of nothing, and protecting themselves in inpenetrable ice stases.
de: Erlernen Hermetiker alle Geheimnisse der Welt, werden sie zu Gurus. Mit ihrem unfassbaren Wissen über die verborgenen Geheimnisse der Welt sind Gurus furchteinflößende Kämpfer, die ihre Feinde unter gewaltigen Felsbrocken, beschworen aus dem Nichts, begraben, und sich mit undurchdringlichen Kraftfeldern schützen.
hu: Ha a mestermágusok megismerik a világ minden titkát, guruvá válnak. A guruk, lévén birtokukban van a világ összes rejtett titka is, félelmetes harcosok, a semmiből elővarázsolt sziklákkal morzsolják szét ellenségeiket, s áthatolhatatlan jégburok övezi testüket.
it: Dopo aver imparato tutti i segreti del mondo, i maestri dei maghi diventano dei guru. I guru, grazie alla loro straordinaria conoscenza sui segreti occulti del mondo, sono dei guerrieri terribili e possono evocare dal nulla dei grossi pezzi di roccia per schiacciare i loro nemici, senza contare che possono inoltre proteggere sé stessi con impenetrabili stasi di ghiaccio.

source: touch of magic
de: Magische Berührung
hu: mágikus érintés
it: tocco magico
ja: 魔力の接触
pl: dotyk magii

source: landmass
de: Lawine
hu: göröngy
it: masso
ja: 陸塊
pl: fragment ziemi

source: Hidden Face
de: Maskenträger
hu: Álarcos
it: Identità misteriosa
ja: 覆面
pl: Zamaskowany

source: Hidden faces are warriors who specialize in close combat, fast strikes, and dodging.
de: Maskenträger sind Nahkämpfer, die sich darauf spezialisieren, schnell zuzuschlagen und auszuweichen.
hu: Az álarcosok a közelharcra specializálódtak, cselekkel, gyors ütésekkel operálnak.
it: Le identità misteriose sono guerrieri specializzati in combattimenti ravvicinati, in attacchi rapidi e nello schivare i colpi dei nemici.
ja: 覆面は、近接戦闘や速攻、回避能力を得意とする戦士です。

source: Mage of Air
de: Magier der Lüfte
hu: Szélmágus
it: Mago dell’aria

source: Air Magi are quite fast and rather dangerous, being able to shoot lightning at their enemies, but are rather frail due to their lack of armor. Arrows are the exception to that rule, as the Magi create winds around them which batter those out of their paths.
de: Magier der Lüfte sind sehr schnell und ziemlich gefährlich, da sie Blitze nach ihren Gegnern schleudern können, aber aufgrund fehlender Rüstung ziemlich verletzlich. Pfeile bilden eine Ausnahme, da die Magier um sich herum Winde erzeugen, die diese von ihrem Pfad abtreiben.
hu: A szélmágusok igen gyorsak és veszélyesek, villámokat lövellnek az ellenségeikre, de fegyverzetük nem lévén könnyen sebezhetőek is. Kivételt képeznek a nyilak, mivel a mágusok által felkavart szelek eltérítik a rájuk kilőtt nyilakat.
it: Anche se non sono molto resistenti per il fatto che non indossano armatura, i maghi dell’aria sono abbastanza veloci e molto pericolosi, e sono capaci di scagliare fulmini contro i loro nemici. I maghi creano trombe d’aria attorno ai nemici che possono tranquillamente sconfiggerli in tutti i fronti.

source: short-circuit
de: Kurzschluss
hu: rövidzár
it: corto-circuito
ja: 短絡
pl: krótkie spięcie

source: sparks
de: Funken
hu: szikrák
it: scintille
ja: 火花
pl: iskry

source: small lightning
de: Blitz
hu: kis villám
it: piccolo fulmine
ja: 小さな稲妻
pl: mały piorun

source: Mage of Fire
de: Magier der Flammen
hu: Tűzmágus
it: Mago del fuoco
