Repository: wescamp/Era_of_Magic-1.10
Catalog: po/*.po
Languages: de, hu, it, ja, pl

source: Elementalists who choose the path of Fire become quite powerful, and quickly, but are rather slow, for their Art takes a toll on their bodies.
de: Elementarier, die den Pfad des Feuers wählen, erlangen schnell große Macht, doch schlägt sich ihre Kunst in ihrem Körper nieder, sodass sie nicht sehr schnell sind.
hu: Az elemvarázslók, akik a tűz útját választják, igen gyorsan hatalmassá válnak, de lelassulnak, mivel művészetük felemészti testi erejüket.
it: Gli elementalisti che hanno scelto la via del fuoco diventano molto potenti e veloci, e possono addirittura rallentare i loro nemici grazie all’arte di controllare i loro corpi.

source: fire blast
de: Feuerstoß
hu: tűzcsapás
it: fiammata
ja: 炎の爆発
pl: podmuch ognia

source: flames
de: Flammen
hu: lángnyelvek
it: fiamme
ja: 火炎
pl: płomienie

source: Mage of Water
de: Magier des Wassers
hu: Vízmágus
it: Mago dell’acqua

source: Water Magi use their power to heal, not to destroy. In battle, they use their control of the water inside their enemies’ bodies to slow them, and conjure shards of ice with deadly accuracy.
de: Magier des Wassers benutzen ihre Kräfte nicht zur Zerstörung, sondern zum Heilen. Aber in der Schlacht können sie mit ihrer Kontrolle über das Wasser im Körper ihrer Gegner diese schwächen und sie mit tödlicher Genauigkeit Eiszapfen beschwören.
hu: A vízmágusok gyógyításra használják erejüket, nem pusztításra. Csatában a víz feletti uralmukat használva lelassítják ellenségeiket, s halálos pontossággal céloznak jégcsapjaikkal.
it: I maghi dell’acqua usano il loro potere per curare, non per distruggere. In battaglia, essi rallentano il nemico usando l’acqua interna al loro corpo ed evocano aghi di ghiaccio con una precisione mortale.

source: water blast
de: Wasserstoß
hu: hullámverés
it: getto d’acqua
ja: 水の爆発
pl: fala wody

source: icicles
de: Eiszapfen
hu: jégcsap
it: punte di ghiaccio

source: Magical Eye
de: Magisches Auge
hu: Mágikus szem
it: Occhio magico
ja: 魔法の目
pl: Magiczne Oko

source: Magical Eyes are a breed of constructs Enlightened Magi often animate. These Eyes are surrounded by a gold aura, focusing its powers through their gaze, and usually ‘seeing’ and therefore hitting their enemies often.
de: Magische Augen sind magische Gebilde, welche häufig von den Erleuchteten beleben werden. Diese Augen sind von einer goldenen Aura umgeben und können ihre Kraft durch ihren Blick bündeln - sie »sehen« ihre Feinde und treffen sie deshalb meist auch.
hu: A mágikus szemek a leggyakoribbak a megvilágosodott mágusok által használt eszközök közül. Aranyló aura veszi őket körül, ennek energiáját használva igézik meg ellenségeiket, ezáltal különösen gyakran el is találják őket.
it: Gli occhi magici sono una razza costruita dai maghi illuminati. Essi sono circondati da un’aura dorata, che viene concentrata attraverso i loro sguardi per colpire i loro nemici “a vista”.

source: Master of Air
de: Meister der Lüfte
hu: Szélmester
it: Maestro dell’aria
ja: 風の支配者
pl: Mistrz Powietrza

source: These Magi are renowned for their speed and for their ability to create powerful winds. In battle, they conjure deadly storms of unspeakable power.
de: Die Meister der Lüfte sind für ihre Schnelligkeit berühmt und dafür, große Winde erschaffen zu können. In der Schlacht beschwören sie tödliche Stürme von unermesslicher Heftigkeit.
hu: Ezek a mágusok a gyorsaságukról közismertek, s arról, hogy hatalmas szeleket képesek támasztani. A csaták hevében iszonyatos erejű halálos viharokat kavarnak.
it: Questi maghi sono celebri per la loro velocità e per la loro abilità di creare potenti venti. In battaglia, evocano tempeste mortali di potenza indescrivibile.

source: short circuit
de: Kurzschluss
hu: rövidzár
it: cortocircuito
ja: 短絡
pl: krótkie spięcie

source: thunder
de: Donner
hu: zivatar
it: tuono
ja: 稲妻
pl: piorun

source: eye of the storm
de: Sturm
hu: hurrikán szeme
it: occhio del ciclone
ja: 嵐の目
pl: oko sztormu

source: Master of Elements
de: Herr der Elemente
hu: Elemek mestere
it: Maestro degli elementi
ja: 精霊の支配者
pl: Mistrz Żywiołów

source: touch
de: Berührung
hu: érintés
it: tocco
ja: 接触
pl: dotyk

source: Master of Fire
de: Meister der Flammen
hu: Tűzmester
it: Maestro del fuoco
ja: 火の支配者
pl: Mistrz Ognia

source: After some time, experienced Fire Magi transcend their mortal bodies, becoming creatures of pure flame. Their control of fire is legendary, and their wrath is terrible to behold.
de: Irgendwann übersteigen fähige Feuermagier ihre sterblichen Körper, um reine Feuerwesen zu werden. Ihre Macht über das Feuer ist legendär, und ihr Zorn entsetzlich.
hu: Az idők múlásával a tűzmágusok átlényegítik halandó testüket, s tisztán csak lángokból építik fel magukat. A tűz feletti uralmuk legendás, haragjukban szörnyű pusztítást végeznek.
it: Passato un po’ di tempo, i maghi del fuoco esperti trascendono i loro corpi mortali, diventando creature di fiamma pura. Leggendario è il loro controllo del fuoco, e terribile è la loro ira.

source: burning fist
de: Flammende Faust
hu: égő ököl
it: pugno di fuoco
ja: 燃え盛る拳
pl: płonąca pięść

source: Master of Water
de: Meister des Wassers
hu: Vízmester
it: Maestro dell’acqua
ja: 水の支配者
pl: Mistrz Wody

source: Masters of Water are powerful healers, and lords of their element. Their control is so great that they are able to regenerate themselves. They also slow their foes.
de: Meister des Wassers sind mächtige Heiler und Gebieter ihres Elementes. So gut beherrschen sie das Wasser, das sie sich selbst heilen und ihre Gegner verlangsamen können.
hu: A vízmesterek nagyerejű gyógyítók, s biztosan uralják elemüket. Olyan hatalmuk van, hogy saját testüket is képesek regenerálni. ezenkívül lelassítják ellenségeiket.
it: I maestri dell’acqua sono potenti guaritori e signori nel controllare il loro elemento. Essi hanno la grande capacità di rigenerarsi da soli e possono rallentare i loro nemici.

source: frozen fist
de: Gefrorene Faust
hu: jeges ököl
it: pugno di ghiaccio
ja: 氷の拳
pl: zamrożona pięść

source: ice strike
de: Eis
hu: jeges csapás
it: colpo di ghiaccio
ja: 氷塊
pl: uderzenie lodu

source: bubble
de: Blase
hu: buborék
it: bolla
ja: 水泡
pl: bańka

source: Mastermage
de: Hermetiker
hu: Mestermágus
it: Maestro dei maghi
ja: 魔術の達人
pl: Mistrz Magów

source: Mastermage knows all kinds of magic, so he can perform a lot of different attacks. When Mastermage is under attack, he creates an energy shield, which absorbs damage.
de: Hermetker kennen alle Formen der Magie und können deshalb auf viele Arten angreifen und sich durch ein Kraftfeld schützen.
hu: A mestermágus minden varázslatot ismer, számos támadást képes alkalmazni. Ha támadás éri, energiapajzsot generál, ami erősen legyengíti a fizikai támadások erejét.
it: I maestri dei maghi conoscono le magie di ogni tipo, e possono usare una moltitudine di attacchi. Quando un maestro dei maghi si trova sotto attacco crea uno scudo energetico in grado di assorbire i danni.

source: lightning
de: Blitz
hu: villám
it: fulmine
ja: 雷
pl: piorun

source: Mu is a creature with unknown origin. It is the cheapest unit in the era, but not the weakest. A large group of these units can be dangerous.
de: Mu sind Kreaturen unbekannten Ursprungs. Die billigste, aber nicht die schwächste Einheit in dieser Epoche. In Scharen können Mu gefährlich sein.
hu: A muk ismeretlen eredetű teremtmények. A korszak legolcsóbb, de nem a leggyengébb egységei. Nagy tömegben veszélyessé válhatnak.
it: Mu è una creatura di origini sconosciute. È l’unità più economica dell’era, ma non la più debole: un grande gruppo di queste unità può rivelarsi molto pericoloso.

source: Mystic Warrior
de: Mystischer Krieger
hu: Misztikus harcos
it: Guerriero mistico
ja: 神秘の戦士
pl: Mistyczny Wojownik

source: Mystic warriors use special staffs to perform both their ranged and melee attacks.
de: Mit ihren besonderen Stäben können Mystische Krieger von nah und fern angreifen.
hu: A misztikus harcosok különleges botokat használnak közelharcban és távolsági harcban is.
it: I guerrieri mistici usano bastoni speciali per migliorare i loro attacchi ravvicinati e a distanza.
ja: 神秘の戦士は、格闘攻撃と投射攻撃の両方に特殊な杖を使います。

source: secret hit
de: Wunderlicher Schlag
hu: rejtett ütés
it: colpo segreto
ja: 秘伝の一撃
pl: sekretny cios

source: Sculptor
de: Gorgonier
it: Scultore

source: gaze
de: Böser Blick
hu: igézés
it: sguardo fisso
ja: 凝視
pl: spojrzenie

source: Shadowmage
de: Magier des Schattens
hu: Árnymágus
it: Mago dell’ombra
ja: 影の魔術師
pl: Cienisty Mag

source: Shadowmagi have learned the secrets of invisiblity. They are completely invisible, but can still be seen in daylight because of their equipment.
de: Schattenmagier haben die Geheimnisse der Unsichtbarkeit erlernt. Sie selbst sind völlig unsichtbar, ihre Ausrüstung ist allerdings im Tageslicht erkennbar.
hu: Az árnymágusok megtanulták a láthatatlanság titkát. Teljesen láthatatlanná válnak, de nappal a fegyverzetük miatt észlelhetők.
it: I maghi dell’ombra hanno imparato i segreti dell’invisibilità ma possono usare questa abilità solo di notte per colpa del loro equipaggiamento che indossano.

source: cursed knifes
de: Fluchmesser
hu: átkozott kés
it: coltelli maledetti
ja: 呪いの小刀
pl: przeklęte noże

source: Sorcerer
de: Gelehrter
hu: Boszorkánymester
it: Incantatore
ja: ソーサラー
pl: Czarodziej

source: Sorcerers are quite powerful while striking from far away, but are weak melee fighters.
de: Gelehrte sind mächtige Fernkämpfer, aber nicht für den Nahkampf geeignet.
hu: A boszorkányok távolsági támadása komoly sebzést okoz, de közelharcban gyengék.
it: Gli incantatori sono abbastanza potenti mentre colpiscono il nemico da lontano, ma deboli negli attacchi ravvicinati.

source: Subversive Mage
de: Verschlagener Magier
hu: Pusztító mágus
it: Mago sovversivo

source: Subversive Magi use black magicks to slow their enemies and to batter them with missles of cold.
de: Verschlagene Magier benutzen schwarze Magie, um ihre Gegner zu verlangsamen oder sie mit Kälte zu beschießen.
hu: A pusztító mágusok feketemágiát használnak ellenségeik lelassítására, s fagyos fuvallatokkal való megsemmisítésére.
it: I maghi sovversivi usano la magia nera per rallentare i loro nemici e i proiettili di gelo per sconfiggerli.

source: Ums (<italic>text='um'</italic> in single) are the Enlightened Kingdom's top secret weapon. These powerful magical creatures are a result of long, hard studies and experiments.
de: Um sind die Geheimwaffe des Reichs der Weisen. Diese mächtigen Zauberwesen sind das Ergebnis langwieriger Forschungen und Experimenten.
hu: Az umok a Megvilágosodottak Királyságának legtitkosabb fegyverei. Ezek a nagyerejű mágikus kreatúrák hosszú tanulmányok és kísérletek eredményei.
it: Gli um (<italic>text='um'</italic> in single) sono l’arma segreta del Regno degli Illuminati. Queste potenti creature magiche sono il risultato di lunghi studi ed esperimenti.

source: piercing punch
it: pugno perforante

source: Void Mage
de: Magier des Nichts
hu: Űrmágus
it: Mago del vuoto

source: Magi of Darkness are masters of the fourth element. They cast powerful darkness spells.
de: Magier des Nichts sind Meister des vierten Elements. Sie wirken mächtige Dunkelzauber.
hu: A mélységi mágusok a negyedik elem mesterei. Hatalmas sötét mágikus varázslatokat használnak.
it: I maghi dell’oscurità sono i maestri del quarto elemento ed evocano potenti incantesimi oscuri.

source: War Mage
de: Kriegsmagier
hu: Harcimágus
it: Mago della guerra
ja: 戦争の魔術師
pl: Mag Zbrojny

source: War Magi are equiped with longswords, and are quit proficient in their use. They are also able to perform devastating ranged attacks.
de: Kriegsmagier kämpfen sowohl mit mächtigen Schadzaubern als auch mit Schwertern,
hu: A harcimágusok pallosokkal vannak felfegyverezve, s félelmetesen bánnak fegyverükkel. Emellett pusztító erejű távolsági támadásuk is van.
it: I maghi della guerra sono molto abili nell’uso dello spadone. Possono inoltre eseguire devastanti attacchi a distanza.

source: Bladedancer
de: Klingentänzer
hu: Pengetáncos
it: Danzatore di lame
ja: ブレードダンサー
pl: Tancerz Ostrzy

source: Blademaster
de: Meister des Dolchs
hu: Pengeforgató
it: Maestro di lame
ja: ブレードマスター
pl: Mistrz Ostrzy

source: daggers
de: Dolche
hu: tőrök
it: pugnali
ja: ダガー
pl: sztylety

source: Chaos Hydra
hu: Káosz hidra
it: Idra del caos
ja: カオスヒドラ
pl: Hydra Chaosu

source: This amazing monster is reinforced by black magic. It always brings death.
de: Dieses erstaunliche Monster wurde mit schwarzer Magie verstärkt. Wo es auftaucht, ist der Tod nicht weit.
hu: Ez a csodálatos szörnyeteg a feketemágiától nyeri erejét. S a halál jár a nyomában.
it: Questo incredibile mostro è rafforzato dalla magia nera. Porta sempre morte.

source: bite
de: Beißen
hu: harapás
it: morso
ja: 噛みつき
pl: ugryzienie

source: headbutt
de: Rammen
hu: homlok
it: testata
ja: 頭突き
pl: uderzenie głową

source: Cold Matriarch
de: Matriarchin der Kälte
hu: Hidegség Ősanyja
it: Matriarca del gelo
ja: 氷の女支配者
pl: Matrona Chłodu

source: Cold Matriarch creates cold aura which makes all cold spells very powerful (up to 25%) and makes fire spells, very weak.
de: Matriarchinnen der Kälte besitzen eine Aura der Kälte, die Kältemagie verstärkt (um bis zu 25%) und Feuermagie schwächt.
hu: A Sötétség Ősanyja hideg aurát von maga köré, amely felerősíti a hideg támadásokat (+25%) s nagyon legyengíti a tűzvarázslatokat.
it: La matriarca del gelo emana un’aura fredda in grado di creare tutti gli incantesimi freddi più forti (fino al 25%) e inoltre può lanciare incantesimi di fuoco molto deboli.
ja: 氷の女支配者は冷気のオーラをまといます。そのため、冷気の魔法はとても強力（+25%）なります。また、火炎の魔法はとても弱くなります。

source: matriarch-fire
de: Brennende Kälte
hu: ősanya-tűz
it: fuoco matriarcale
ja: 女支配者の冷気
pl: ogień matron

source: Commander
de: Kommandant
hu: Parancsnok
it: Comandante
ja: 司令官
pl: Dowódca

source: Dark Assassin
de: Nächtlicher Attentäter
hu: Sötét orgyilkos
it: Assassino oscuro
ja: 闇の暗殺者
pl: Mroczny Zabójca

source: knives
de: Messer
hu: kések
it: coltelli
ja: ナイフ
pl: noże

source: Dark Hunter
de: Jäger
hu: Sötét vadász
it: Cacciatore oscuro
ja: 闇の狩人
pl: Mroczny Myśliwy

source: Dark Slayer
de: Schlächter
hu: Sátáni vérengző
it: Uccisore oscuro
ja: 闇の殺戮者
pl: Mroczny Morderca

source: Dark Warrior
de: Streiter
hu: Sötét harcos
it: Guerriero oscuro
ja: 闇の闘士
pl: Mroczny Wojownik

source: Dark Witch
de: Finsterhexe
hu: Sötét boszorkány
it: Strega oscura
ja: 闇の魔女
pl: Mroczna Wiedźma

source: Experienced in battle witch becomes shadow witch. Now she is more dangerous and she can perform ranged attack 5 times.
de: Kampferfahrene Hexen erhalten den Titel der Finsterhexe. Diese sind noch gefährlicher und können fünf Hexenfeuer bewirken.
hu: A harcban edzett boszorkányok árnyboszorkánnyá válnak. Így sokkal veszélyesebbek, s ötszöri távoli támadással bírnak.
it: Una strega esperta in battaglia può diventare una strega dell’ombra. Ora che è più pericolosa, può eseguire ben 5 volte di fila un attacco a distanza.

source: witch-fire
de: Hexenfeuer
hu: boszorkánytűz
it: fuoco stregato
ja: 魔女の炎
pl: ogień wiedźm

source: Dark Wizard
de: Hexer
hu: Sötét varázsló
it: Stregone oscuro
ja: 闇の魔術師
pl: Mroczny Czarodziej

source: Dark Wizard is equipped whit special staff, which reinforces his spellpower. He can make a lot of damage but his mana ends quicly. That’s why he performs only two attacks.
de: Hexer verstärken ihre Zauberkraft mit einem besonderen Stab. Sie könne großen Schaden anrichten, doch sie erschöpfen sich schnell.
hu: A sötét varázslók különleges bottal fegyverkeztek fel, amely pótolja az elhasznált varázsenergiájukat. Nagy sebzést okoznak, de varázserejük gyorsan lecsökken. Körönként csak két ütésre képesek.
it: Lo stregone oscuro è equipaggiato con un bastone speciale, in grado di rafforzare gli incantesimi. Può infliggere gravi danni ma il suo mana finisce molto velocemente: per questo esegue solo due attacchi.

source: dark spark
de: Funke der Finsternis
hu: sötét szikra
it: scintilla oscura
ja: 闇の火花
pl: mroczna iskra

source: Disciple
de: Eingeweihter
hu: Tanítvány
it: Discepolo
ja: 見習い
pl: Uczeń

source: Every dark dispile dreams about being a great warlock. But for now they must surive. They have very powerful magic but they can’t perform melee attacks.
de: Jeder Eingeweihte träumt davon, ein mächtiger Hexenmeister zu sein. Doch zuvor müssen sie überleben. Ihre Magie ist mächtig, doch sie können sich nicht im Handgemenge zur Wehr setzen.
hu: Minden sötét tanítvány arról álmodik, hogy nagy táltos lesz belőle. De azt meg is kell élniük. Nagyon erős mágával rendelkeznek, de közelharcba nem bocsátkoznak.
it: Ogni discepolo oscuro sogna di diventare un grande stregone, ma per ora devono pensare solo a sopravvivere. Usano potenti magie ma non possono eseguire nessun attacco ravvicinato.

source: General
hu: Tábornok
it: Generale
ja: 将軍
pl: Generał

source: Great Hunter
de: Jagdmeister
hu: Nagy vadász
it: Grande cacciatore
ja: 大狩人
pl: Wielki Łowca

source: Great Hunter can slow enemies by throwing nets.
de: Jagdmeister verstricken ihre Opfer mit Wurfnetzen.
hu: A nagy vadászok lelassítják ellenségeiket a rájuk vetett hálóval.
it: Le reti del grande cacciatore rallentano i nemici.

source: Great Warlock
de: Hexenmeister
hu: Nagy sámán
it: Grande stregone
ja: 大魔道士
pl: Wielki Czarnoksiężnik

source: Great Warlock knows black magic well. He learned a secret of levitation so he can move for a long distance. He is equipped with scythe and he uses very powerful magic spells.
de: Hexenmeister sind Experten der schwarzen Magie. Durch die Kenntnis der Levitation können sie große Entfernungen zurücklegen, und was ihre gewaltigen Flüche nicht bezwingen, erledigen sie mit Sensen.
hu: A nagy táltos kiváló a feketemágiában. Megtanulta a lebegés képességét, így messze távolságokra jut el rövid idő alatt. Kaszával van felfegyverkezve, és erős varázslatokat használ.
it: I grandi stregoni conoscono molto bene la magia nera e hanno imparato la lievitazione, così da avere l’abilità di muoversi a lunghe distanze. È equipaggiato con una falce e usa potenti incantesimi.

source: scythe
de: Sense
hu: múmia
it: falce
ja: 大鎌
pl: kosa

source: dark ball
de: Kugel der Finsternis
hu: sötét labda
it: sfera oscura
ja: 闇の魔力球
pl: mroczna kula

source: Hydra
hu: Hidra
it: Idra
ja: ヒドラ

source: The Hydra is a powerful beast with 3 heads. It regenerates itself and performs 7 attack, when it has full hp.
de: Die Hydra ist ein gewaltiges dreiköpfiges Ungeheuer. Sie ist zur Regeneration fähig und kann bei voller Gesundheit sieben Angriffe ausführen.
hu: A hidra egy háromfejű, erős szörnyeteg. Életereje teljében hétszer támad, s regenerálódik is.
it: L’idra è una forte bestia a 3 teste. Si rigenera da sola e quando la sua salute è al massimo riesce a colpire 7 volte di fila il proprio nemico.

source: Master of Darkness
de: Herr der Finsternis
hu: Sötétség Mestere
it: Maestro dell’oscurità
ja: 闇の支配者
pl: Mistrz Ciemności

source: He is the synonym of the darkness. His spellpower is the highest in the era. When he is moving, he turns himself into bats. When night begins, Master of Dakness is the most powerful unit in the game during night.
de: Dieses Ebenbild der Finsternis verfügt über die größte Zauberkraft in dieser Epoche, und in der Nacht ist er die stärkste aller Einheiten. Wenn er sich bewegt, verwandelt er sich in einen Schwarm Fledermäuse.
hu: Ő testesíti meg a sötétséget. Varázsereje a korszakban a legnagyobb. Amikor mozog, denevérformát ölt. Az éj leszálltával a Sötétség Mestere válik a leghatalmasabb éjszakai egységgé.
it: È sinonimo di oscurità e le sue magie sono le più grandi di tutta l’era. Quando giunge la notte, il maestro dell’oscurità è l’unità più potente del gioco e si trasforma in uno stormo di pipistrelli per muoversi.

source: implosion
hu: robbanás
it: implosione
ja: 爆縮
pl: implozja

source: Master of War
de: Heerführer
hu: Háború Mestere
it: Maestro della guerra
ja: 戦の支配者
pl: Mistrz Wojny

source: Matriarch of Darkness
de: Matriarchin der Finsternis
hu: Sötétség Ősanyja
it: Matriarca dell’oscurità
ja: 闇の女主人
pl: Mistrz Ciemności

source: Shadow Matriarch knows no mercy. She creates dark aura, which makes all enemy units inside fight worse. Also she can perform witch-fire spell 7 times.
de: Matriarchinnen der Finsternis kennen keine Gnade. In ihrer Aura der Finsternis werden alle feindlichen Einheiten geschwächt.
hu: A Sötétség Ősanyja nem ismer irgalmat. Sötét aurát bocsát ki magából, amelyben minden ellenséges egység gyengébben harcol. Ezenkívül hétszer csap le boszorkánytűzzel.
it: La matriarca dell’ombra non conosce pietà. Crea un’aura oscura che penalizza i nemici al suo interno, facendoli combattere male. Può eseguire i fuochi stregati ben 7 volte.

source: blood gate
de: Tor des Blutes
hu: vérkapu
it: portale di sangue
ja: 血糊の扉
pl: krwawe wrota

source: Matriarch of Emptiness
de: Matriarchin der Leere
hu: Üresség Ősanyja
it: Matriarca del nulla
ja: 空虚の女支配者
pl: Matrona Pustki

source: Matriarch of emtiness owns powerful orb, which drains all magical energy from air. That means all spells do minimal damage.
de: Eine Matriarchin der Dunkelheit trägt einen mächtigen Talisman, der ihrer Umgebung alle magische Energie entzieht. Deshalb verursachen alle Zauber nur minimalen Schaden.
hu: Az Üresség Ősanyjának van egy mágikus gömbje, amely magába szív minden mágikus erőt a levegőből, ezért a mágikus támadások alig ejtenek rajta némi karcolást.
it: La matriarca del nulla possiede una potente sfera in grado di assorbire tutta l’energia magica proveniente dall’aria: ciò significa che tutti gli incantesimi nemici faranno danni minimi.

source: Raging Hydra
de: Zorneshydra
hu: Őrjöngő hidra
it: Idra furiosa
ja: 怒り狂うヒドラ
pl: Wściekła Hydra

source: Sworddancer
de: Schwertänzer
hu: Kardtáncos
it: Danzatore di spade
ja: ソードダンサー
pl: Tancerz Ostrzy

source: swords
de: Schwerter
hu: kardok
it: spade
ja: 剣
pl: miecze

source: Witch
de: Hexe
hu: Boszorkány
it: Strega
ja: 魔女
pl: Wiedźma

source: Witches are servants of darkness. They use special magic attack called witch-fire. It is cheap spell and drains energy from an enemy. In close range witches use their spears.
de: Hexen sind Dienerinnen der Finsternis. Durch das sogenannte Hexenfeuer, das sich schnell beschwören lässt, können sie einen Feind seiner Energie berauben. Im Nahkampf verwenden Hexen ihre Speere.
hu: A boszorkányok a sötétség szolgái. Speciális támadásukat boszorkánytűznek nevezik. Ez egy olcsó varázslat, s az ellenség életerejét szívják el. Közelharcban a boszorkányok a dárdájukat használják.
it: Le streghe sono le serve dell’oscurità. Invocano un facile incantesimo chiamato “fuoco stregato”, il quale assorbe energia dal nemico. In combattimenti ravvicinati le streghe usano la lancia.

source: Air Avatar
de: Luftmanifestation
hu: Szélvész
it: Avatar d’aria
ja: 風の化身
pl: Awatar Powietrza
