Repository: wescamp/Era_of_Magic-1.10
Catalog: po/*.po
Languages: de, hu, it, ja, pl

source: Rhamis are a race of limber and swift creatures residing in the Abyss. Four-armed and, like jinns, blessed with the gift of intelligence, Rhamis carry out their work as the precise strike force of the summoners. Due to some foreign magical affinity, Rhamis regenerate their bodies promptly after becoming wounded. They are armed with a blade in each hand, casting blows and slashes with astonishing inhuman speed. Through their four blades and spryness, a Rhami can dive into combat and strike before their foes can react. Rhamis are fiercely loyal and search to enact revenge upon their fallen comrades.
de: Die Rhami' sind eine Rasse schlanker und flinker Geschöpfe, die den Abgrund bewohnen. Vierarmig und wie Dschinn mit Intelligenz begabt, führen die Rhami' präzise bOperationen für die Beschwörer aus. Durch eine fremdartige magische Neigung heilen die Wunden der Rhami' sehr schnell. In jeder Hand tragen sie eine Klinge, mit der sie Hiebe und Schläge mit erstaunlicher unmenschlicher Geschwindigkeit austeilen, Durch ihre vier Klingen und Grazilität kann eine Rhami in doe Schlacht eintauchen und zuschöagen, bevor die Reflexe ihres Gegners eintreten. Rhami' sind leidenschaftlich treu und streben nach Vergeltung für ihre gefallenen Kammeraden.
hu: A rhamik fürge, hajlékony lények, akik a Mélységben tartózkodnak. Négy kezük van, s a dzsinnekhez hasonlóan intelligensek is, ezért a rhamik a varázslók megbízható csapásmérő seregét képezik. Valami különös mágikus hatásra a rhamik teste regenerálódik. Minden kezükben kardot tartanak, s bámulatos gyorsasággal osztogatják csapásaikat. Négy pengéjük és fürgeségük révén a rhamik villámgyorsan támadnak, mielőtt ellenségük felocsúdhatna a meglepetéstől. A rhamik szenvedélyes hűséggel szolgálnak, s kitartóan keresik a lehetőséget elesett társaik megbosszulására.
it: Le rhami sono una razza di agili e flessibili creature residenti nell’Abisso. Con quattro braccia e, come i geni, benedette con il dono dell’intelligenza, le rhami possono rigenerare i loro corpi e adempiono il loro lavoro come accurato esercito per gli evocatori. Sono armate con una lama in ogni mano, ed eseguono colpi sfiatati con straordinaria velocità sovrumana e uccidono senza dare al nemico il tempo di reagire. Le rhami sono molto devote e cercano di vendicarsi dei loro compagni caduti.

source: sworddance
de: Schwertwirbel
hu: kardtánc
it: danza della spada
ja: 剣の舞
pl: taniec mieczy

source: Embellished in a body of gilded-gold, and always seen with a trinket of elemental fire dangling from one hand, Rhami’datus have become eagle-eyed, slicing incisively with their killing edges. Rhami’datus have learned to wield fire, turning them into the pyromancers of the summoners, second to fire elementals but far more intelligent. Most of these Rhamis are promoted into commanding positions, though some prefer entering frays alongside their companions, fulfilling their roles as ardent avengers for the dead.
de: Durch einen güldenen Körper gezeichnet und stets mit einem Pokal elementaren Feuers in einer Hand, verfügen Rhami'datu über Adleraugen und schneiden präzise mit ihren tödlichen Klingen. Rhami'datu haben das Feuer als Waffe gemeistert, wodurch sie zu den Flammenwerfern al-Kamijas wurden, hinter den Feuergeistern, aber weit klüger. Die meisten dieser Rhami' werden in Führungspositionen befördert, auch wenn einige lieber mit ihren Kammeraden in die Schlacht ziehen, um ihre Rolle des Vergelters der Toten zu erfüllen.
hu: A sasszemű rhami'datuk rendkívül éles pengéikkel szabdalják ellenségeiket, miközben aranyszínű testükön visszatükröződnek az elemi tűzből készült csecsebecséik fényei. A rhami'datuk kiválóan használják a tüzet céljaik érdekében, így a varázslók tűzmágusként is használhatják őket, akár úgy is, mint tűzlényeket, bár messze értelmesebbek azoknál. Ezen rhamik legtöbbje parancsnoki pozícióba kerül, habár néhányan jobb szeretnek a csata sűrűjében vitézkedni, s buzgó halálosztóként megjelenni a csatatéren.
it: Impreziosite in un corpo dorato, le rhami’datu sono in possesso di un ciondolo speciale che lancia fuoco elementale e sono più abili a sventrare i loro nemici con le loro lame. Seconde solo agli elementali di fuoco (ma sempre più intelligenti), le rhami’datu hanno imparato a brandire il fuoco, divenendo le piromanti degli evocatori. Molte di queste rhami sono promosse come comandanti, ma c’è sempre qualcuna che preferisce combattere al fianco dei loro compagni, vendicando i caduti in battaglia.

source: Rhami’kais trade in their four scimitars for a single weapon: the spear. With this, Rhami’kais attain more power and precision with their attacks but at the loss of speed. RhamiKais, charismatic and as sentient as humans, lead others into combat, organizing attacks with timing and skill. Rhami’kais also can launch magical attacks through their eyes that drain the strength and life of opponents into their own.
de: Rhami'kai ersetzen ihre vier Säbel durch eine Waffe: den Speer. Durch diese erhalten sie schmerzhaftere und genauere Angriffe, doch verlieren sie an Schnelligkeit. Rhami'kai, charismatisch und dem Menschen intellektuell ebenbürtig, führen andere in die Schlacht, planen Angriffe mit Zeitgefühl und Geschick. Zudem können sie mit ihren Augen magische Angriffe abfeuern, durch die Kraft und Leben ihrer Gegner ihnen zukommt.
hu: A rhami'kaik a handzsárjaikat egyetlen dárdára cserélték. Ennek következtében nagyobb erővel és pontosabb támadással avatkozhatnak a küzdelembe, viszont elveszítették gyorsaságukat. A rhami'kaik fenségesek és érzékenyek, mint az emberek, született hadvezérek, akik jól időzített támadásokat vezetnek. A rhami'kaik szemükből mágikus sugarat lövellnek ellenségeikre, és elszívják annak életerejét, hogy azzal is növeljék a sajátjukat.
it: L’arte delle rhami’kai consiste nel maneggiare quattro scimitarre per fondere una sola arma: la lancia. Con questa, le rhami’kai ottengono più potere e precisione dai loro attacchi ma perdono molta della loro velocità. Carismatiche e sensibili tanto quanto gli umani, esse comandano i propri soldati in combattimento, organizzando veloci e forti attacchi. Le rhami’kais possono inoltre lanciare attacchi magici dai loro occhi in grado di assorbire la forza e la vita dei loro nemici.

source: Summoner
de: Beschwörer
hu: Varázsló
it: Evocatore
ja: 召喚士
pl: Przywoływacz

source: Promoted to the Second Degree, summoners are proficient enough to perform minor summonings, using their own bodies as the medium. With a magical circle traced in their hands, they can let loose magical arrows that strike foes with surefire aim. Summoners, armed with hammers and scimitars, are trained in slaying enemies in both close quarters and afar. Special Notes: Precision: Ranged attack of this unit always has a 80% chance to hit.
de: In den Zweiten Rang erhobenen Beschwörer sind erfahren genug, um geringere Beschwörungen durchzuführen, wobei ihr Körper als Medium dient. Mit einem magischen Kreis in der Hand verschießen sie magische Pfeile verläßlicher Genauigkeit. Beschwörer sind darin geübt, mit Hammer und Säbel bewaffnet, Gegner von nah wie fern niederzustrecken.
hu: Kettes fokozatot elérve a varázslók már elég gyakorlottak ahhoz, hogy kisebb lényeket idézzenek meg, saját testüket használva közvetítő közegként. A mágikus körüket használva mágikus nyilat lövellhetnek az ellenségre a biztos találat tudatával. A varázslók pöröllyel és handzsárral felfegyverkezve közeli és távoli ellenségeket egyaránt megsemmisíthetnek. Megjegyzés: Precizitás: Az egység távoli támadása 80% valószínűséggel talál.
it: Promossi al secondo rango, gli evocatori sono abbastanza abili nell’eseguire evocazioni minori, utilizzando il proprio corpo come mezzo. Scagliano frecce magiche con infallibile precisione disponendo di un cerchio magico tracciato nelle loro mani; oppure uccidono i loro nemici con martelli e scimitarre sia da vicino e sia da distante. Note speciali: Precisione: gli attacchi a distanza di questa unità ha sempre l’80% di possibilità di colpire.

source: magic arrow
de: Zauberpfeil
hu: mágikus nyíl
it: freccia magica
ja: 魔法の矢
pl: magiczna strzała

source: Summons Master
de: Meister der Beschwörung
it: Maestro delle evocazioni

source: Few men in all of history have ever embraced the veiled mystery that comes naturally with the title of the Fourth Degree. These are men who can wield the entire power of the Abyss with their right arm and the complete devastation of summoning magic with their left. A summons master has attained the culmination of all summoning arts crafted and comprehended in history. Encircling a summons master is his magnum opus: the megacircle. The circle teems with magicks of all imaginations—magicks to empower, mend, bless, cure, destroy, create, and remake. Within the vast and mystic megacircle, the air itself screams as elementals burst forth from their world into this one through the circle’s unearthly inscriptions. Men within the master’s circle are invested with supernatural gifts, their wounds closing by the aid of pure magic and their strength jumping twofold. Towers of heavenly light shriek into the skies from the megacircle’s symbols, obliterating all within range. All around the summons master, miracles occur. Ruin is wrought.
de: Wenige Männer haben je das verborgene Wissen erworben, das der Titel des Vierten Ranges mit sich bringt. Dies sind jene großen Männer, die die gesamte Macht des Abgrundes in der rechten und die volle Kraft der Beschwörung in der linken Hand tragen. Die Gesamtheit aller bisher durchgeführten und verstandenen Beschwörungen hat ein Meister der Beschwörung erlernt. Den Meister der Beschwörung umgibt sein Magnum Opus: Der Kreis der Macht. Der Kreis ist belegt mit allen vorstellbaren Zaubern — zu stärken, zu schwächen, zu segnen, zu heilen, zu zerstören, zu erschaffen, zu erneuern. Die Luft selbst schreit, während Elementargeister aus ihrer Welt in diese brechen durch des Kreises irdische Inschriften. Männer in des Meisters Kreis erhalten übernatürliche Gaben, ihre Wunden schließen sich durch reine Magie und ihre Stärke verdoppelt sich. Säulen himmlischen Lichts schießen zum Himmel auf durch die Symbole des Kreises und zerstören alles in ihrem Weg. Überall um den Meister der Beschwörung geschehen Wunder. Das Ende ist nahe.
hu: A történelem során csak kevés ember tapasztalhatta meg azt a misztikus homályt, amely a negyedik fokozatot elért varázslókat övezi. Ezek az emberek tökéletesen uralják a Mélység mágikus erejét, az egyik kezükkel teremtenek, lényeket idéznek meg, a másikkal pusztítanak. A megidézés művészete és a Mélység megértése az a csúcspont, amit ezek a mesterek teljesen a magukévá tettek. A varázslómestereket övezi a legtökéletesebb mágikus kör: a bűvkör. Ebben a bűvkörben kiteljesedik a mágia hatása—erővel ruház fel, gyógyít, kúrál, gyengíti, megsebzi az ellenséget, regenerál, s a megidézés alapját adja. Ettől a roppant erejű misztikus bűvkörtől a levegő is sivít, amikor az elemi lények kiszáguldanak másvilági lakhelyükről, hogy e világba lépjenek. A mestert övező bűvkör rendkívüli ajándékokkal látja el a benne tartózkodó embereket, sebeik begyógyulnak, erejük megnövekszik. A bűvkör szimbólumaiból mennyei sugarak törnek az ég felé, s átjárnak mindent a hatókörben. A varázslómesterek körül számos csoda történik, a romok is helyreállítódnak.
it: Pochi uomini della storia hanno abbracciato il mistero velato dal titolo di quarto rango. Questi sono uomini in grado di maneggiare l’intero potere dell’Abisso con la mano destra e la devastazione completa delle arti di evocazione con la sinistra. Un maestro delle evocazioni raggiunge il culmine di tutte le arti evocative insegnate e comprese nel corso della storia. L’arte di un maestro delle evocazioni dà vita all’opera più grande: il mega-cerchio. Il cerchio abbonda di tutte le cose che si possono immaginare: magie che possono richiamare, riparare, curare, distruggere, creare, e ricreare. Gli uomini all’interno del cerchio vengono rivestiti con doni soprannaturali, le loro ferite vengono chiuse dall’aiuto della magia pura e la loro forza diventa due volte più forte. Dai simboli del mega-cerchio si alza una luce abbagliante nei cieli, che cancella tutto ciò che avvolge. Attorno ai maestri delle evocazioni accadono miracoli. Il male è vinto.

source: incantation of power
de: Machtwort
hu: varázserő
it: incantesimo del potere
ja: 力ある呪文
pl: inkantacja mocy

source: Water Avatar
de: Wassermanifestation
hu: Folyamlény
it: Avatar d’acqua
ja: 水の化身
pl: Awatar Wody

source: With time, the water elemental dramatically increases both its size and strength of current to become something grander: an avatar of water. Ceaselessly turning in hypnotizing spirals of surges, water avatars manipulate their bodies into whatever form suits the battle. Their bodies have become tumultuous and wilder in the heat of combat, their whole form a chaotic typhoon of rain and water. To this effect, many a dazed soldier have sometimes wondered why the frothy tides of a beach were pulling at his feet in the middle of a battlefield.
de: Im Laufe der Zeit werden Größe und Strömung eines Wassergeistes zu etwas viel gewaltigeren erhoben: Einer Manofestation des Wassers. Wassermanifestationen verändern ihre ruhelos in hypnotisierenden Spiralen pulsierenden Leiber in jene Form, welche in der Schlacht nützlich ist. Ihre Körper sind unruhiger geworden und wilder in der Hitze des Gefechts, eine chaotische Brandung aus Wasser und Regen. Aus diesem Grund haben sich viele verwirrte Soldaten gefragt, wieso die Tiden eines Strandes in der Schlacht ihn von den Füßen rissen.
hu: Kis idő elteltével a vízlények méretben és alakban is nagymértékben megváltoztak, s valami mássá alakultak: folyamlénnyé. Szakadatlanul örvénylő áramlataikkal a folyamlények csata közben bármilyen alakot képesek felvenni. Csata hevében a kavargó testük egy esővel és vízzel örvénylő tájfun képét idézi fel. Sok embert zavart meg csata közben a váratlanul lábára pottyanó, tajtékzó víztömeg.
it: Col passare del tempo, l’elementale d’acqua aumenta drasticamente la propria grandezza e forza per diventare qualcosa di più grandioso: un avatar d’acqua. Il corpo agitato e turbolento dell’avatar d’acqua forma un tifone caotico di pioggia e acqua: molti soldati confusi si domandano come abbiano fatto le maree a trascinare i loro piedi nel mezzo della battaglia.

source: Water Elemental
de: Wassergeist
hu: Vízlény
it: Elementale d’acqua
pl: Żywiołak Wody

source: The Abyss is home to aquatic beings composed of nothing more than the same pure water essential for all living creatures. Such a being is held together by a singular magical bond circulating its whole watery form. This grants it regeneration when submerged in other bodies of water. The extraordinary water in its body has moderate healing properties, which can mend the injuries of allies. Less volatile than the other inhabitants of the Abyss, water elementals are preferred by the more conservative of summoners. Yet these elementals are by no means harmless, and the unwary opponent may find their bodies frozen at a moment’s glance, their limbs transformed into cold, useless ice.
de: Der Abgrund ist Heimat aquatischer Wesen, die aus nichts bestehen als dem reinen Wasser, das alles Leben benötigt. Ein solches Wesen wird durch einen Zauber zusammengehalten, der seinen ganzen wässrigen Körper durchfließt. Deshalb regeneriert es sich, wenn es in einem anderen Wasserkörper untertaucht. Das außergewöhnliche Wasser in seinem Körper hat beschränkte Heilkraft, die die Wunden Verbündeter lindern kann. Weniger aggressiv als andere Bewohner des Abgrundes, werden Wassergeister von eher konservativen Beschwörern bevorzugt. Doch diese Geister sind ganz und gar nicht harmlos, und ein unvorsichtiger Gegner wird möglicherweise im nu erstarren, seine Glieder nicht mehr als kaltes, nutzloses Eis.
hu: A Mélység a hona azoknak a vízi lényeknek is, amelyek semmi másból, csak tiszta vízből épülnek fel, amely minden más élő lény számára is alapvető fontosságú. Ezt a lényt viszont csak a benne áramló mágikus energia tartja össze. Ez az energia teszi lehetővé azt is, hogy más testekből elvont vízzel regenerálódjon. A testében felhalmozott víz ugyanakkor azt is lehetővé teszi, hogy a mellette lévő szövetséges egységek kisebb sebeit begyógyítsa. A Mélység többi lakójához képest kevésbé változékonyak, így a biztonságot kedvelő varázslók előszeretettel idézik meg őket. Azért ezeket a lényeket sem kell teljesen ártalmatlannak tekinteni, hiszen a figyelmetlen ellenség testét egy szempillantás alatt dermesztő hideg éri, s végtagjai is elfagyhatnak.
it: L’Abisso è la casa per esseri composti solamente di acqua pura, elemento essenziale per ogni creatura vivente. Ogni creatura è legata da uno speciale incantesimo che rende il loro aspetto completamente liquido, favorendone la rigenerazione. Inoltre la straordinaria acqua che compone il loro corpo ha delle moderate proprietà curative, che può riparare i danni degli alleati. Meno volatili rispetto agli altri abitanti dell’Abisso, gli elementali d’acqua sono i favoriti dagli evocatori più conservatori. Eppure questi elementali non sono affatto innocui: il nemico più incauto può trovarsi congelato in un istante, con le membra trasformate in freddo, inutile ghiaccio.

source: Water God
de: Wassergott
hu: Tengeristen
it: Dio dell’acqua
ja: 水の神
pl: Bóstwo Wody

source: Scarce even in the Abyss, water gods have frozen into the shape of glacial serpents. Despite their rigid appearance, these beasts of water dart across the land with startling grace and flexibility. Water gods are considered miracles of life by Summoners, the magical water within them allowing them to remedy the wounds of allies by their mere presence. Their arctic beauty and strength, dazzling to all who oppose the Summoners, can freeze a man’s heart even before his body is engulfed in a bone-chilling blizzard.
de: Selbst im Abgrund sind Wassergötter selten. Sie sond in die Gestalt eisiger Schlangen gefroren. Ihrem starren Aussehen zu trotz gleiten jene Monster des Wassers über das Land mit erstaunlichem Anmut und Beweglichkeit. Wassergötter gelten in al-Kamija als Wunder des Lebens, das magische Wasser in ihnen erlaubt ihnen, Verbündete durch ihre bloße Anwesenheit zu heilen. Ihre frostige Schönheit und Stärke, die jeden, der sich al-Kamija entgegenstellt. verwirrt, kann das Herz gefrieren lassen, noch bevor der Körper in einem bitterkalten Schneestumr gefangen ist.
hu: Néhány tengeristen még a Mélységben jégkígyó formába fagyott. Merev formájuk ellenére meglepő hajlékonysággal és könnyedséggel szelik át a szárazföldet. A tengeristeneket a varázslók az élet csodájának tartják, a bennük lüktető mágikus víz hatására a szomszédos szövetséges egységeket pusztán a jelenlétükkel gyógyítják. Hideg szépségük és erejük megbabonázza a varázslók ellenségeit, szívüket hideg borzongás járja át, mielőtt testüket a hóvihar csontig hatoló jégszilánkjai megfagyasztják.
it: Introvabili persino nell’Abisso, gli dei dell’acqua si sono congelati assumendo la forma di un serpente glaciale. Malgrado il loro aspetto inflessibile, queste bestie d’acqua si muovono con sorprendente grazia e flessibilità. Gli dei dell’acqua sono considerati dagli evocatori come miracoli della vita e l’acqua pura e magica che li compongono aiuta a guarire le ferite degli alleati. La loro forza e la loro bellezza artica abbagliano chiunque si oppone agli evocatori, congelando il cuore di un uomo prima che il suo corpo venga inghiottito in una gelante bufera di neve.

source: race^Tharis
de: Tharis
hu: Tharis
it: Tharis
pl: Tharis

source: race+female^Tharis
de: Tharis
hu: Tharis
it: Tharis
pl: Tharis

source: race+plural^Tharis
de: Tharis
hu: Tharisok
it: Tharis
pl: Tharis

source: race^Cyclops
de: Zyklop
hu: Küklopsz
it: Ciclope
pl: Cyklop

source: race+female^Cyclops
de: Zyklop
hu: Küklopsz
it: Ciclope
pl: Cyklop

source: race^Cyclopes
de: Zyklopen
hu: Küklopszok
it: Ciclopi
pl: Cyklopi

source: race^Roc
de: Rokh
hu: Rokmadár
it: Roc
pl: Rok

source: race+female^Roc
de: Rokh
hu: Rokmadár
it: Roc
pl: Rok

source: race^Rocs
de: Rokh
hu: Rokmadarak
it: Roc
pl: Roki

source: race^Magical
de: Magisches Geschöpf
hu: Mágikus lény
it: Magico
ja: 魔法生物
pl: Magiczny

source: race+female^Magical
de: Magisches Geschöpf
hu: Mágikus lények
it: Magica
pl: Magiczna

source: race+plural^Magical
de: Magische Geschöpfe
hu: Mágikus lények
it: Magici
ja: 魔法生物
pl: Magiczni

source: race^Salamander
de: Salamander
hu: Szalamandra
it: Salamandra
pl: Salamandra

source: race+female^Salamander
de: Salamander
hu: Szalamandra
it: Salamandra
pl: Salamandra

source: race^Salamanders
de: Salamander
hu: Szalamandrák
it: Salamandre
pl: Salamandra

source: water
de: Wasserwesen
hu: víz
it: acqua
ja: 水
pl: woda

source: Made of Water: This unit is made of water. As a result, if it is standing in water, it will receive 6 hp.
de: Wasserwesen: Da diese Einheit aus Wasser besteht, erlangt sie im Wasser sechs Lebenspunkte.
hu: Vízlény: Ez az egység vízből áll. Emiatt vízi terepen 6 ÉP-t gyógyul.
it: Fatto di acqua: L’unità è fatta di acqua. Quindi, se si trova in acqua, riceverà 6 pf.
ja: 水より生まれしもの: このユニットは水から作られました。そのため、水の中ではヒットポイントが 6 回復します。
pl: Zbudowany z wody: Ta jednostka składa się całkowicie z wody. Dlatego jeśli stoi w wodzie oddzyskuje siły (6hp na turę)

source: Made of Water: This unit is made of water. If it stands in water, it will receive 6 hp.
it: Fatto d’acqua: L’unità è fatta di acqua. Se si trova in acqua, riceverà 6 pf.

source: fire
de: Feuerwesen
hu: tűz
it: fuoco
ja: 火
pl: ogień

source: Made of Fire: This unit is made of fire. If it stands in lava, it will receive 6 hp.
de: Feuerwesen: Diese Einheit besteht aus Hitze und heilt 6 LP auf Lava.
hu: Tűzlény: Ez az egység tűzből áll. Ha lávaterepen áll, 6 ÉP-t gyógyul.
it: Fatto di fuoco: L’unità è fatta di fuoco. Se è ferma sulla lava, riceverà 6 pf.

source: megacircle
de: Kreis der Macht
hu: bűvkör
it: mega-cerchio
ja: 大魔法陣
pl: megakrąg

source: Megacircle: This unit owns powerful magic circle which affects all units inside. All friendly units fight better (+125%, +100%, +75%, +50%, +25% — lvl 0, 1, 2, 3, 4) and regenerate themselves.
it: Mega-cerchio: L’unità possiede potenti cerchi magici in grado di condizionare tutte le unità vicine. Tutte le unità amiche combattono meglio (+125%, +100%, +75%, +50%, +25% — lvl 0, 1, 2, 3, 4) e si rigenerano da sole.

source: always hits
de: unentrinnbar
hu: mindig talál
it: colpisce sempre
ja: 必中
pl: zawsze trafia

source: Always Hits: This attack always has a 100% chance to hit
it: Colpisce sempre: L’attacco ha sempre una probabilità di colpire pari al 100%.

source: no counter-attack
de: keine Gegenwehr
hu: nincs ellentámadás
it: nessun contrattacco
ja: 反撃封じ
pl: brak kontrataku

source: no counter-attack: The opponent has a 0% chance to hit, when this unit is attacking. Does not work on opponents with berserker frenzy.
it: nessun contrattacco: Quando l’unità sta attaccando, l’avversario ha sempre una probabilità di colpire pari allo 0%. Non funziona contro i nemici che posseggono l’abilità “furia” o “mania da battaglia”.

source: evasion
de: Ausfall
hu: gyengítés
it: evasione
ja: 忌避
pl: unik

source: Evasion: When this attack is used offensively, this unit takes one third less damage in retaliation.
de: Ausfall: Wenn hiermit angegriffen wird, erleidet diese Einheit nur zwei Drittel des Scha-dens, den die Gegenwehr verursacht.
hu: Gyengítés: Amikor ilyen támadással támad az egység, az ellentámadás egyharmaddal kisebb sebzést okoz a normálnál.
it: Evasione: Quando questo attacco è usato in modo offensivo, l’unità riceve un terzo di danno in meno durante la rivalsa.
ja: 忌避: 攻撃時にこの攻撃を選ぶと、このユニットは反撃のダメージを 1/3 に減少することができます。
pl: Unik: Kiedy ten atak użyty jest ofensywnie, jednostka otrzymuje o 1/3 mniej obrażeń przy kontrataku przeciwnika.
