Repository: wescamp/Era_of_Magic-1.10
Catalog: po/*.po
Languages: de, hu, it, ja, pl

source: Avatars of the earth, though colossal, are slow-moving, hobbled by the weight of their bulk. For this reason, earth avatars are bought out into the battlefield for defending important landmarks such as mountains and hilltops. Situated in defensible areas, avatars with their outlandish strength crush parties of opposition while bracing against all varieties of attacks. When all is done, these giants stand still and tall like massive sculptures; over time, avatars begin to house tiny sprigs of vegetation growing outside of its rocky cracks.
de: Die Manifestationen der Erde sind gewaltig, doch auch langsam durch ihre immense Masse. Deshalb werden sie in der Schlacht eingesetzt, um wichtige Landmarken wie Berge zu halten. In den zu verteidigenden Gebieten zerquetschen sie gegnerische Trupps mit unnatürlicher Stärke, ohne selbst an den Angriffen zu leiden. Ist alles getan, stehen diese Riesen still wie gewaltige Statuen; im Laufe der Zeit siedeln sich in den Felsspalten einer Erdmanifestation Pflanzen an.
hu: A földgólemek, habár hatalmasak, lassú mozgásúak, lévén roppant súlyt hordoznak. Emiatt a földgólemeket a stratégiailag fontos tereptárgyak védelme érdekében szokták bevetni a csatamezőn, főleg hegyeken és dombokon. Védelmi pozícióban elhelyezkedve a földgólemek emberfeletti erejükkel szétzúzzák ellenségeiket, miközben szilárdan ellenállnak mindenféle támadásnak. Amikor mindennek vége van, ezek az óriások még mindig ott tornyosulnak a helyükön, mint a szobrok; idővel a sziklás külső rétegükön megtelepszik a növényzet is.
it: Gli avatar di terra, anche se enormi, sono molto lenti per colpa della loro massa, e per questa ragione vengono evocate nei campi da battaglia per difendere le zone più importanti situate tra le montagne o le colline. Grazie alla loro strana forza, gli avatar schiacciano le truppe nemiche fermandone tutti i vari tipi d’attacco e quando la missione è conclusa, questi giganti smettono di muoversi e rimangono immobili come se fossero delle statue di pietra: col passare del tempo, dei piccoli ramoscelli di vegetazione crescono al di fuori delle fessure rocciose dell’avatar.

source: hit
de: Lawine
hu: ütés
it: colpo
pl: cios

source: Earth Elemental
de: Erdgeist
hu: Földlény
it: Elementale di terra
pl: Żywiołak Ziemi

source: The most unswerving of all elementals are the ones born from the earth. Such large elementals carry the strength of easily ten men each, but their true function are living fortresses, defending lines of troops with their uncompromising and sturdy rock-skin. Earth elementals are capable of withstanding barrages of blows before finally collapsing into shambles of stones, returning back to the earth. After their summoning from the Abyss, earth elementals are imbued with regenerative abilities by their summoners to improve them as living shields, thus expanding their lifespans and their services to their masters.
de: Die unnachgiebigsten Elementargeister sind jene, die der Erde entspringen. Diese riesigen Geister haben jeder für sich die Kraft von gut zehn Männern, doch ihre wahre Funktion ist die lebender Festungen, die die Schlachtreihen mit ihrer unnachgiebigen und harten Felsenhaut verteidigen. Erdgeister können schwere Schläge einstecken, bis sie schlussendlich zu Felsbrocken zerfallen, um zur Erde zurückzukehren. Nachdem sie aus dem Abgrund beschworen wurden, werden Erdgeister von ihren Beschwörern mit Regenerationsfähigkeit verzaubert, um sie als lebende Schilde zu verbessern, sodass ihre Lebens- und Dienstzeit verlängert wird.
hu: Az elemi lények közül a földből születettek térnek el leginkább az átlagostól. Ezek a hatalmas elemi lények tíz ember erejével bírnak, de igazi hasznuk, hogy élő erődként használhatóak, az arcvonalakat szilárdan tartják, mivel durva, kőkemény bőrüket alig fogja fegyver. A földlények hatékonyan állnak ellen a csapásoknak mígnem apró kavicsokra törik, s visszahull a porba. A Mélységből való megidézésük után a földlényeket regenerációs képességgel ruházzák fel a varázslók, s így élettartamukat és szolgálataikat is meghosszabbítva élő pajzsként használják őket.
it: Gli elementali più fedeli di tutti sono quelli nati sulla terra. Questi riescono a trasportare facilmente dieci uomini robusti con sé, ma la loro vera funzione è quella di essere delle fortezze viventi, con il compito di difendere le truppe con il loro irriducibile corpo roccioso. Gli elementali della terra sono in grado di resistere a raffiche di colpi prima di frantumarsi in pezzi di pietra, tornando alla terra. Dopo la loro evocazione dall’Abisso, gli elementali della terra sono capaci di rigenerarsi e vengono usati dai loro evocatori come scudi viventi, ampliando così la loro durata di vita ed i loro servizi ai loro padroni.

source: Earth God
de: Erdgott
hu: Földisten
it: Dio della terra
ja: 土の神
pl: Bóstwo Ziemi

source: Earth gods are simply gargantuan: one raised fist can shake the very foundations of the land. Many tales have been told about the work of such gods who lumber across the earth, so great in size that entire villages are dwarfed by their presence. Bulwarks against the strongest swords, lances, and spells, packing enough force to pulverize dozens in a single downward strike, and continuously regenerating their stony bodies, earth gods are no easy feat to bring down-or even force back.
de: Erdgötter sind schlicht gigantisch: eine erhobene Faust kann den Grund des Landes erschüttern. Viele Geschichten werden erzählt von den Taten jener Götter, die die Erde überragten, so gewaltig, dass ganze Dörfer in ihrer Gegenwart winzig erscheinen. Als Bollwerke gegen Schwerter, Lanzen und Zauber, Dutzende mit einem einzigen Schlag auf dem Boden zermalmend, stets ihre steinernden Körper regenerierend, sind Erdgötter nur schwerlich nieder- oder auch nur auf die Knie zu zwingen.
hu: A földistenek egyszerűen gigantikusak: ha öklük lesújt, a föld az alapjáig beleremeg. Sok legenda szól a csapásról, amit ezek az istenek okoznak azzal, hogy átdübörögnek a földeken, s akik mellett a legnagyobb falvak is eltörpülnek. Masszív felépítésük ellenáll a legerősebb kardoknak, lándzsáknak, de még a varázslatoknak is, s annyi erőt hordoznak magukban, hogy egy ütéssel tucatnyi ellenséget zúznak szét, ráadásul folyamatosan regenerálódnak is. A földisteneket kemény dió porba dönteni-de még a térdre kényszerítésük is embertpróbáló feladat.
it: Gli dei della terra sono semplicemente enormi: un solo pugno può far tremare le fondamenta della terra. Molte leggende narrano di foreste nate al loro passaggio, e di quanto grandi siano in dimensioni da fare sembrare interi villaggi delle formiche in loro presenza. Resistenti alle spade più taglienti, alle lance, agli incantesimi e grazie alla loro capacità di rigenerarsi di continuo il proprio corpo e alla loro forza in grado di polverizzare decine di nemici in un colpo solo, gli dei della terra non saranno tutt’altro che facili da abbattere.

source: Cataclysmic by nature, efreets are jinns who have rejected most, if not all, of their inner desires to learn. Efreets, for profound reasons beyond the comprehension of their peers, search to cause destruction in their conquests. To this, their magical bodies have sunken into a crimson-reddish hue, tempering their magic with fire’s touch. In battles, efreets bask in razing and laying waste to whatever their blazes can reach.
de: Von Natur aus eine Katastrophe sind Afriten Djinn, die ihren innneren Wissensdurst größten teils oder gar vollständig abgelehnt haben. Aus Gründen, die für ihre Genossen nicht nachvollziehbar sind, versuchen Afriten, Zerstörung auf ihren Streifzügen auszusähen. Ihre Haut hat ist scharlachrot geworden, ihre Magie mit feuriger Berührung verändert. In der Schlacht legen Afriten alles in Schutt und Asche, was ihre Lohen erreichen können.
hu: Az ifritek zavaros természetű dzsinnek, akik elfojtották a legtöbb, ha nem az összes, belső késztetésüket a tanulásra. Az ifritek, feljebbvalóik teljes értetlenségére, a pusztítást részesítik előnyben. Mágikus testük karmazsinvörös árnyalatot vett fel, s mágikus erejük tüzes érintéssé alakult. Csatában az ifritek az ellenség teljes megsemmisítésére törekednek, mindennek az elpusztítására, amelyhez tüzes érintésükkel csak hozzáférnek.
it: Distruttivi per natura, gli efreet sono geni dalla pelle rossa cremisi, che usano la magia del fuoco. Per ragioni profonde al di là della comprensione dei loro coetanei, gli efreet hanno rifiutato ogni loro intimo desiderio conoscitivo e cercano di causare distruzione nelle loro conquiste, compiacendosi nell’incenerire tutto ciò con le loro fiamme.

source: magic
de: Zauber
hu: mágia
it: magico
ja: マジック
pl: magia

source: Fire Avatar
de: Feuermanifestation
hu: Tűzgólem
it: Avatar di fuoco
ja: 火の化身
pl: Awatar Ognia

source: After fire consumes enough fuel-flesh, bones, wood, iron, even entire landscapes-it will unavoidably grow into something far more sinister in shape and body. It is a dreadful sight to behold the fire avatar as it takes flight with its fiery wings, casting a blazing light on earth and man. The magic within its body has honed, granting the avatar a magical potency in its fire-wrought claws. Only dauntless summoners are able to lead such devastating beings in war without fear of being reduced to ashes.
de: Wenn Feuer genug Brennstoff- sprich: Fleisch, Knochen, Holz, Eisen, ganze Landstriche gar- verzehrt, wird es zwangsläufig zu etwas wachsen von viel ominöserer Gestalt. Es ist ein entsetzlicher Anblick, wie eine Feuermanifestation mit feurigen Schwingen emporsteigt und Erde und Menschen in lohendes Licht taucht. Die verstärkte Magie ihres Körpers verleiht ihren flammenden Krallen Zauberkraft. Nur die furchtlosesten Beschwörer können mit solch zerstörerischen Kreaturen in den Krieg ziehehn, ohne zu fürchten, zu einem Häufchen Asche zu verbrennen.
hu: Miután a tűz elegendő muníciót emésztett fel -muníció alatt a húst, a csontot, a fát, a vasat, de magát a földet is értjük- elkerülhetetlenül megváltozik az alakja és a teste is. Szörnyűséges látvány tárul az elé, aki megpillantja a tűzgólemet, ahogy tüzes karjaival harcol, s tüzes csóvákat lövell a földre és az emberekre. A testében lüktető mágia átjárja minden porcikáját, s lehetővé teszi a mágikus csapás kilövellését tüzes karmaiból. Csak a legelszántabb varázslók képesek irányítani ezeket a lényeket, akik nem félnek attól, hogy maguk is hamuvá lesznek a környezetében.
it: Dopo aver consumato la carne, ossa, legno, ferro e perfino interi paesaggi, il fuoco inevitabilmente cambia forma e si trasforma in qualcosa di molto sinistro: l’avatar di fuoco. Una visione terribile vedere volare l’avatar di fuoco con le sue ali ardenti, abbagliando l’uomo e la terra. La magia conservata dentro al corpo garantisce all’avatar di sfoderare i loro artigli infuocati e solo gli evocatori abbastanza impavidi sono capaci di comandarli in guerra senza farsi ridurre in cenere.

source: Fire Elemental
de: Feuergeist
hu: Tűzlény
it: Elementale di fuoco
pl: Żywiołak Ognia

source: Fire is a dangerous manifestation of nature’s destruction. While adept users of magic can craft fire from nothing but thin air, there is nothing more terrible than an actual materialization of living flame and fury. Its fiery form visible in pitch darkness, the fire elemental is but an entity of arcane magic summoned from the Abyss, almost always brought out for intent of war. From the moment the elemental is brought into this world, it burns bright with mindlessness and follows the orders of its summoner until its very extinguishing.
de: Feuer ist eine gefährliche Form der zerstörerischen Natur. Während fähige Zauberer Feuer aus dünner Luft schaffen können, ist nichts schrecklicher als eine wahrliche Verkörperung von lebenden Feuer und Zorn. Als aus dem Abgrund beschworenes Geschöpf mystischer Energien, fast immer für den Krieg, ist die feurige Gestalt des Feuergeistes in tiefster Nacht sichtbar. Sobald der Geist in diese Welt eintritt, brennt er voller Gedankenlosigkeit und folgt den Befehlen seines Beschwörers, bis er erloschen ist.
hu: A tűz a természet pusztító erejének veszélyes megjelenése. A gyakorlott mágiahasználók a levegőből is képesek tüzet csiholni, nincs is szörnyűbb annál, mint amikor a harag ezen élő formái megtestesülnek. Ez a tüzes alak a legsötétebb éjben is látható, a tűzlény a Mélység földöntúli mágikus erejéből idéződik meg, s majdnem mindig hadi célra. Attól a pillanattól kezdve, hogy a lény evilágra születik, esztelenül feléget mindent, ami az útjába kerül, s amit a megidézője parancsol, egészen addig, míg véglegesen ki nem húny.
it: Il fuoco è la manifestazione più pericolosa della distruzione naturale. Anche se gli adepti sanno creare il fuoco dal nulla, non c’è nulla di più terribile di un’effettiva materializzazione della fiamma viva. Con la sua forma ardente visibile nell’oscurità più assoluta, l’elementale del fuoco è un’entità esoterica e magica evocata dall’Abisso, quasi sempre portata fuori per combattere in guerra. Dal momento in cui viene trascinato in questo mondo, l’elementale brucia senza curarsi di niente ed esegue gli ordini dei propri evocatori fino alla propria estinzione.

source: Fire God
de: Feuergott
hu: Tűzisten
it: Dio del fuoco
ja: 火の神
pl: Bóstwo Ognia

source: Upon reaching the pinnacle of its conflagration, the elemental has utterly become a moving inferno, a god of its own respect. Even the summoners who have bought such legends from the Abyss tremble at the sight of the flying phoenix aflame, its massive wings sending sparks and embers downwards onto the far-below ground. Growing brighter and stronger with every foe fed into its flames, the fire god appears as a miniature sun in the darkest of nights. Everything in its marked path is set ablaze.
de: Am Höhepunkt seiner Lohe wird ein Feuergeist ein sich bewegendes Inferno, ein Gott. Selbst jene Beschwörer, die solche Legenden aus dem Abgrund fördern, erzittern vor dem Anblick des Flugs des lodernden Phönix, wenn seine riesigen Flügel Funken und Flammen dem Boden weit unterhalb entgegen schicken. Mit jedem Feind, der seinen Flammen anheil fällt, wird er heller und stärker, in der Nacht erscheint der Feuergott wie eine kleine Sonne in der dunkelsten der Nächte. Alles, was in seinem Wege steht, wird in Flammen gelegt.
hu: A tűzvész csúcsára érve az elemi lény végül mozgó pokollá változik, istenné, aki csak magára van tekintettel. Még a varázslók is, akik pedig számos történetet tudnak róluk, remegve állnak, ha meglátják ezeket a repülő, főnixként izzó lángnyelveket, a szikrát szóró szárnyaikat. Minden egyes elemésztett ellenség után fényesebbekké és erősebbekké válva a tűzistenek egy kis napként világítanak a sötét éjszakában. Amerre csak elhaladnak, nyomukat lángtenger követi.
it: Una volta raggiunto il culmine della conflagrazione, l’elementale diventa improvvisamente un inferno vivente, un dio con tutto il rispetto. Persino gli evocatori che hanno procurato queste leggende dall’Abisso tremano alla vista delle ali imponenti della fenice che sparpagliano scintille e cenere per terra. Il dio del fuoco appare come un sole in miniatura nel buio più totale che inghiotte ogni nemico con le proprie fiamme. Ogni cosa che si trova nel suo territorio verrà incenerita all’istante.

source: Grand Summoner
de: Hoher Beschwörer
hu: Nagy varázsló
it: Grande evocatore
ja: 大召喚士
pl: Wielki Przywoływacz

source: Summoners, scholars and warriors alike will eventually reach the Second Degree provided enough talent and cunning. The Third Degree, however, does not come easily to non-geniuses of the arts. ‘Grand summoners’, as they are called by their peers, value both war and wisdom equally in earning their precious knowledge of summoning elementals from the Abyss. Respected and feared, grand summoners eliminate foes with absolute certainty in the wake of their circles of destruction. Special Notes: Circle: The ranged attack of this unit always has a 100% chance to hit.
de: Beschwörer erreichen als Kriegergelehrte irgendwann den Zweiten Rang, solange sie klug und talentiert genug sind. Der Dritte Rang ist hingegen nur schwerlich zugängig für Nicht-Genies. »Hohe Beschwörer«, wie sie von ihren Kollegen genannt werden, schätzen Kriegskunst und Weisheit gleich, um ihr kostbares Wissen über die Beschwörung der Geister des Abgrundes zu erlangen. Geschätzt und gefürchtet vernichten Hohe Beschwörer mit vollkommener Sicherheit, wenn ihre Kreise der Zerstörung ihr Werk aufnehmen.
hu: A varázslók, mágusok és harcosok egyaránt, elég könnyen elérhetik a kettes fokozatot, ha tehetségesek és kitartóak. A hármas fokozatot elérni viszont egyáltalán nem könnyű. A 'nagy varázslók', ahogy őket a többiek hívják, mind háborús tapasztalataik, mind bölcsességük révén meglehetősen nagy tudást halmoztak fel, s nagy biztonsággal idéznek meg lényeket a Mélységből. A rettegve tisztelt nagy mágusok könnyed magabiztossággal semmisítik meg ellenségeiket a pusztító körük aktiválása által. Megjegyzés: Kör: Az egység távoli támadása 100% valószínűséggel talál.
it: Evocatori, scolari e guerrieri di ogni tipo riescono a raggiungere il secondo rango solo grazie al talento e alle proprie abilità. Il terzo rango invece non è facilmente raggiungibile dai meno dotati in queste arti. I “grandi evocatori”, come essi vengono chiamati dai loro signori, sono uomini valorosi sia in guerra e sia in saggezza, che si sono guadagnati la loro preziosa conoscenza riguardo le evocazioni degli elementali dall’Abisso. Rispettati e temuti, i grandi evocatori eliminano i nemici con assoluta certezza grazie ai loro cerchi di distruzione. Note speciali: L’attacco a distanza di questa unità ha sempre una possibilità pari al 100% di colpire.

source: circle of destruction
de: Kreis der Zerstörung
hu: pusztítókör
it: cerchio della distruzione
ja: 破壊の魔法陣
pl: krąg zniszczenia

source: Great Efreeti
de: Mächtiger Afrit
hu: Nagy ifrit
it: Grande efreeti
ja: グレートイフリート
pl: Wielki Ifryt

source: Great efreetis seethe with a fiery rage that manifests itself in the form of their magic’s wake. In bodies of smoldering heat and flames, both militants and civilians have been burnt mercilessly to charred remains and then to ashes by these fervent beings. Settlements are annihilated overnight by a great efreeti, leaving nothing left but smoldering ruins. Little has anyone understood of their intent or anger, but little does it matter to the summoners who drive them forward, making as much use as possible of their blasts of hellfire and ravaging firestorms.
de: Ein Mächtiger Afrit glüht mit einer feurigen Rage, die sich in der Gestalt ihrer Zauber niederschlägt. In Körpern aus brütender Hitze und Flammen wurden Kämpfer wie Zivilisten zu verkohlten Leichen und schließlich zu Asche verbrannt von diesen glühenden Wesen. Siedlungen werden über Nacht von eienm Großen Afriten ausgelöscht, nichts bleibt über als rauchende Ruinen. Wenig ist über ihr Ziel oder ihren Zorn bekannt, aber wenig kümmert dies die Beschwörer, weche sie vorwärts treiben, um ihre Brünste aus Höllenfeuer und wütenden Feuerstürme am besten auszunutzen.
hu: A nagy ifritek izzó belső tüze, amely hajtja őket, egyben a gyengeségük is. E forróvérű lényekkel való találkozás után úgy a civilek, mint a katonák teste kegyetlenül megperzselődik, gyakran csak hamuvá égett maradványok lesznek belőlük. Ha egy nagy ifrit pusztít el egy települést, csak füstölgő romok maradnak hátra. Nagyon kevesen értik meg a motivációikat és a dühüket, de azok a varázslók ezt ki is használják, s a lehetőségekhez képest maximálisan kihasználják ezeknek a lényeknek a pokoli természetét és pusztító indulatait.
it: I grandi efreeti ribollono con un’ardente ferocia che si manifesta sotto forma di scia magica. Molti militari e civili sono stati ridotti in cenere in modo spietato per colpa di queste creature avvolte dal fuoco. Si racconta che in passato un grande efreet, nel giro di una notte, abbia annientato intere colonie lasciando al suo passaggio solo rovine fumanti. Nessuno ha mai compreso le loro intenzioni, ma questo non è un grosso problema per gli evocatori che sfruttano il loro fuoco infernale e lle loro devastanti tempeste ardenti.

source: destruction
de: Vernichtung
hu: irtótűz
it: distruzione
ja: 破壊
pl: destrukcja

source: Great Jinn
de: Großer Djinn
hu: Nagy dzsinn
it: Grande genio
ja: グレートジン
pl: Wielki Dżin

source: New summoners learn early on that jinns are much different from the elementals they have summoned from the Abyss. Jinns bear an insatiable thirst for knowledge that will soon cause them to become great jinns. Wiser than their own masters and possessing some fundamentals of summoning, great jinns are treated similarly to humans, if not better for their insight. Great jinns frequently hold positions of authority, commanding divisions and even having a place of power in councils. Gifted with quick minds, great jinns still search for answers to life’s questions, despite the position they have.
de: Jungbeschwörer lernen schnell, dass Djinn grundverschieden sind von den Elementargeistern, die sie aus dem Abgrund beschworen. Djinn besitzen eine unstillbaren Wissenshunger, und das Wissen wird sie bald zu Großen Dsjinn erheben. Nun weiser als ihre Heerren und der Grundlagen der Beschwörung kundig, werden Große Djinn wie Menschen behandelt, wenn sie nicht gar als noch intelligenter gelten. Große Djinn bekleiden oft Führungspositionen, führen Regimenter und halten gar Posten in Räten inne. Dank ihrer klugen Geister und trotz der ihnen verliehenen Ämter suchen Große Djinn immer noch Antworten.
hu: Az újdonsült varázslók hamar megtanulják, hogy a dzsinnek sokkal bonyolultabb teremtmények, mint az elemi lények. A dzsinnek nyughatatlanul szomjazzák a tudást, aminek révén nagy dzsinnekké válhatnak. Bölcsebbek a mestereiknél, s részben a megidézés tudományát is megismerik. A nagy dzsinneket teljesen emberszámba veszik, ha másért nem is, éleselméjűségükért. A nagy dzsinnek gyakran kerülnek parancsnoki pozíciókba, alakulatokat vezényelnek, s még a tanácskozó asztaloknál is helyet kapnak. Gyors észjárásuk miatt folyton keresik az élet értelmét, mindegy milyen helyre állítják őket.
it: I nuovi evocatori imparano in fretta che i geni sono molti diversi dagli elementali che vengono evocati dall’Abisso. I geni portano una sete insaziabile per la conoscenza che li renderà dei grandi geni. Più saggi dei loro maestri e in possesso di qualche fondamento sulle evocazioni, i grandi geni vengono trattati allo stesso modo degli esseri umani, anche se non migliori in fatto di perspicacia. I grandi geni occupano spesso posizioni di autorità, comandano divisioni e persino detengono un posto di potere nei consigli. Dotati d’intelligenza, i grandi geni sono sempre alla ricerca di risposte alle domande della vita.

source: magical scimitar
de: Magischer Säbel
hu: mágikus handzsár
it: scimitarra magica
ja: マジカルシミター
pl: magiczny sejmitar

source: Heavy Camel Rider
de: Kamelritter
hu: Nehéz tevegelő
it: Grande cavalcatore di cammelli
ja: ラクダの重騎兵
pl: Ciężki Wielbłądzi Jeździec
