Repository: wescamp/Era_of_Magic-1.10
Catalog: po/*.po
Languages: de, hu, it, ja, pl

source: The Kirios is the most powerful warrior in the Kharos nation. He is a commander-in-chief of the Kharos army. His willpower is amazing. There is no spell, which could stop him from reaching an enemy and destroy it with one single solar beam (70% reduction in spell damage).
de: Der Kirios, größter Recke von ganz Kharos, Oberster Kommandeur der Geweihten Armee, ist so unglaublich willensstark, das kein Zauber ihn aufhalten könnte, einen Feind mit einem einzigen Sonnestrahl zu einem Häufchen Asche zu verbrennen.
hu: A kirios a kharos nép legerősebb harcosa. Kharos hadseregének vezérlő parancsnoka. Elképesztő akaratereje van. Nincs olyan varázslat, ami megállíthatná, ha nekitámad egy ellenségnek, hogy egyetlen napfénykévével megsemmisítse (70%-kal csökkenti a mágikus támadások erejét).
it: Il kirios è il guerriero più forte nella nazione di Kharos ed è il comandante supremo dell’esercito di Kharos. Il suo potere è fenomenale perché non esiste nessun incantesimo in grado di fermarlo e può inoltre eliminare il nemico con un singolo raggio solare (70% di danni magici in meno)
pl: Wojownik doskonały. Tyle tylko o nim wiadomo poza granicami Kharos; grozę budzi zwłaszcza w kraju Therian, gdzie wciąż żywa jest pamięć o tym, jak podczas walnej bitwy z Kharos Kirios, stojąc na czele strażników słońca, własną ręką zabił trzech generałów mrocznych elfów i zmusił do ucieczki mistrza wojny. A kim jest naprawdę? To gwardzista najwyższej rangą mistrzyni światła, a także promienia. Jest zwierzchnikiem strażników słońca i najpotężniejszym z ich grona. Jego moc magiczna sięgnęła wyżyn, które przekroczyć mogą jedynie mistrzowie żywiołów, światła czy ciemności. Z pomocą energii słonecznej spopiela swych wrogów, a potrafi też, czerpiąc ze światła, regenerować swe siły, już bez tego mając gigantyczną witalność. Kirios, dzierżący włócznię ze sztandarem Kharos, jest na polu bitwy gwarantem zwycięstwa. --Poliuks

source: fusion
de: Schmelze
hu: robbanás
it: fusione
pl: fuzja

source: solar beam
de: Sonnenstrahl
hu: fénykéve
it: raggio solare
pl: promień słoneczny

source: beam
de: Strahl
hu: fénysugár
it: raggio
pl: promień

source: Beam: When this attack is used, the attacker can hurt a unit behind his primary target. Damage dealt to the second target equals to 2/3 of raw firepower.
it: Raggio: Quando si usa questo attacco, si colpisce l’unità che si trova dietro al bersaglio primario. Il danno inflitto al bersaglio secondario equivale a 2/3 della normale potenza.

source: Master of Sun
de: Sonnenmeister
hu: Napmester
it: Maestro del sole
ja: 太陽の支配者
pl: Mistrz Słońca

source: Master of Sun attacks in a twinkle of an eye, so enemy can’t succesfully defend himself. This amazing unit releases huge amounts of sun energy in one point. This ability allows him to focus the sun rays 6 times on a target.
de: Der Angriff des Sonnenmeisters dauert nur einen Augenblick, in dem sich seine Gegner nicht richtig verteidigen können. Diese gewaltige Einheit kann gewaltige Sonnenenergien bündeln.
hu: A napmester egy szempillantás alatt támad, így az ellenség képtelen védekezni ellene. Ez a csodálatos egység nagy mennyiségű napenergiát képes egy pontra összpontosítani. Ez a képesség egy támadás alatt hatszori csapásra teszi alkalmassá az egységet.
it: Il maestro del sole attacca in un batter d’occhio, senza lasciare scampo al nemico. Questa fantastica unità rilascia una grande quantità di energia solare in un solo colpo e colpisce per ben 6 volte il proprio bersaglio.

source: ultraspeed
de: Schnellster Angriff
hu: villámütés
it: super-velocità
pl: ultraszybkość

source: female^Mistress of Light
de: Herrin des Lichts
hu: Fényességes Hölgy
it: Padrona della luce
pl: Mistrzyni Światła

source: Mistress of Light is an extremely powerful healer.
de: Die Herrin des Lichtes ist eine sehr fähige Heilerin.
hu: A Fényességes Hölgy egy rendkívüli erejű gyógyító.
it: La padrona della luce è una guaritrice estremamente potente.

source: lightstorm
de: Gleißendes Licht
hu: fényvihar
it: tempesta di luce
ja: 光の嵐
pl: świetlna burza

source: Platinum Warrior
de: Platinsoldat
hu: Platinaharcos
it: Guerriero di platino
ja: 白金の闘士
pl: Platynowy Wojownik

source: Platinum warriors are equipped with a very sharp sword, silver spear and mace.
de: Platinsoldaten tragen scharfe Schwerter, einen silbernen Speer und Streitkolben.
hu: A platinaharcosok nagyon éles karddal, ezüstpajzzsal és buzogánnyal vannak felfegyverezve.
it: I guerrieri di platino sono equipaggiati con mazza, lancia d’argento e con una spada molto tagliente.
pl: "Być moze to ostatnia strona Kronik Królestwa pisana moją ręką.Błędem wielkim było wszczynanie wojny z Tazokiem. Jego armia okazała się być bezwzględnie mocniejsza od naszej, w co niestety nie chce ale musze uwierzyć. Kiedyś, już niepamiętam kiedy, podziwiałem i myślałem o jego dzielnych wojownikach atakujących Bastion. Teraz już znam odpowiedź na swoje niegdyś zadane pytanie. Ta grupka wojowników gdyby dobiegła do Bastionu napewno zrobiła by borute moim knechtom. Wiem to bo taki sam wzrok jak oni mieli ci morderczy rycerze którzy jak sie domyślam tworzą doborowe odziały Tazoka, bo waleczniejszych rycerzy nie widziałem. Sam jeden pozbawiał życia dziesięciu moich ludzi. Z potężną siła łamali kości korbaczami, przeszpilali na wskroś włóczniami i rozchlapywali juche mieczami tak ostrymi jak żal jaki do siebie żywie za to co poczyniłem niespełna dwa lata temu.Twierdza upadnie po raz pierwszy w swej historii...Królestwo upadnie po raz pierwszy w swej historii..." Król Marden a.d.678 --Zaku

source: female^Prophet of Light
de: Prophetin des Lichts
hu: Fénypróféta
it: Profetessa della luce
pl: Prorok Światła

source: blinding light
de: Gleißendes Licht
hu: vakító fénysugár
it: luce abbagliante
pl: oślepiające światło

source: Protector
de: Verteidiger
hu: Védelmező
it: Protettore
ja: 保護兵
pl: Protektor

source: The Protector holds a large towershield.
de: Der Verteidiger ist mit einem großen Turmschild ausgerüstet.
hu: A védelmező hatalmas pajzsot hordoz magával.
it: Il protettore possiede un grande scudo.

source: shield
de: Schild
hu: pajzs
it: scudo
ja: 盾
pl: tarcza

source: Revenger
de: Vergelter
hu: Bosszúálló
it: Vendicatore
ja: 復讐兵
pl: Mściciel

source: The Revenger is a heavy tactical defense unit. His retaliation strikes are always successful.
de: Der Vergelter ist ein schwerer Verteidiger. Er trifft stets, wenn er verteidigt.
hu: A bosszúálló egy nehézfegyverzettel ellátott védőegység. Az ellencsapása mindig talál.
it: Il vendicatore è una forte unità tattica e difensiva, e i suoi colpi di rivalsa hanno sempre successo.

source: Shielder
de: Schützer
hu: Pajzsos
it: Scudiero
ja: 盾使い
pl: Tarczownik

source: Shielder is a heavy unit with large shield. He is equipped with spear. This unit is very steadfast, and if there is more of them they can be unstopable.
de: Schützer sind schwere Infanteristen mit großen Schilden. Mir einem Speer gewappnet, können sie nur schwerlich bezwungen werden, und in Scharen können sie unbesiegbar werden.
hu: A pajzsos egy nehéz pajzzsal ellátott egység. Dárdája is van. Robusztus egység, s ha többen vannak együtt, akkor megállíthatatlanok.
it: Lo scudiero è una forte unità equipaggiata con un grande scudo e con la lancia. Questa unità è molto difensiva, e può diventare inarrestabile se si trova in gruppo.
pl: Druga, obok białych wojowników, podstawowa formacja wojsk Kharos. Jednak ich zadania są diametralnie różne - tarczownicy są używani wyłącznie niemal do defensywy. Tarczownicy noszą ciężkie, ograniczające nieco ich ruchliwość zbroje, ogromne tarcze i włócznie. Ich ekwipunek przystosowany jest do utrzymywania pozycji zdobytych przez białych wojowników, a także obrony oblężonych twierdz. Żadnej formacji jazdy czy piechoty nie uda się bezkarnie przebić się przez ich linie; potrafią oni w potrzebie stworzyć ze swych tarcz żywy mur, osłaniając odwrót czy przegrupowanie armii. Tarczownicy to żołnierze z krwi i kości, wierni i gotowi do poświęceń, za żołd gotowi oddać swe życie. --Poliuks

source: Silver Warrior
de: Silbersoldat
hu: Ezüstharcos
it: Guerriero argentato
ja: 銀の闘士
pl: Srebrny Wojownik

source: He wears a good armor and is very dangerous because of his skills.
de: Gute Panzerung und Erfahrung machen den Silbersoldaten sehr gefährlich.
hu: Kitűnő vértje van, s képességei miatt nagyon veszélyes.
it: Indossa una buona armatura ed è molto pericoloso.
pl: "Odpieraliśmy ich oblężenie przez cztery długie i ciężkie miesiące. W końcu udało im się przełamać naszą obrone i wejść do bastionu. Moi rycerze byli całkowicie zaskoczeni gdy ONI pojawili sie NAGLE w koszarach. Żaden knecht nie dobiegł do zbrojowni, tylko kilku z całego garnizonu udało się uciec i wycofać do twierdzy. Srebrni wojownicy (bo tak moi ludzie zaczeli ich nazywać) walczą z niezwykłą lekkością, ich ruchy są tak płynne i finezyjne a zarazem szybkie że komukolwiek było by trudno powstrzymać ich furie. Posługiwali się nawet magią wystrzeliwując serie jaskrawych pocisków nie dając uciec zdezorientowanym obrońcom. Ich nagłe pojawienie się w koszarach okazało się być przyczyną posiadania przez nich miejętności przemieszczania się w mgnieniu oka w miejsce oddalone nawet o kilkanaście metrów. Niewiem skąd mają takie zdolności ale póki co nie mam czasu o tym myśleć. Na szczęście udało się naszym magom postawić barierę, by nie mogli dostać się do twierdzy w taki sam sposób jak do Bastionu. Ale magowie długo jej nie utrzymają..." Król Marden a.d.678 --Zaku

source: female^Sister of Light
de: Schwester des Lichts
hu: Fénynővér
it: Sorella della luce
pl: Siostra

source: Slicer
de: Reißer
hu: Daraboló
it: Fenditore
ja: 切りつける者
pl: Siekacz

source: Sun Follower
de: Jünger der Sonne
hu: Naphívő
it: Adepto del sole
ja: 太陽の信奉者
pl: Wyznawca Słońca

source: The Sun Follower is a very dangerous unit. His willpower is so high, that he can negate some agressive spells (30% reduction in spell damage).
de: Der Jünger der Sonne ist eine sehr mächtige Einheit. Seine Willensstärke ist so groß, dass er einige Angriffzauber abwehren kann (30% weniger Schaden durch Zauber).
hu: A naphívők veszélyes egységek. Olyan akaraterővel rendelkeznek, hogy a mágikus támadások csak csökkentett erővel hatnak rájuk (30%-kal csökken a sebzés).
it: L’adepto del sole è molto pericoloso perché il suo potere è così alto da essere in grado di respingere gli incantesimi più aggressivi. (30% di riduzione per i danni magici)
pl: Elitarni, niezwykli wojownicy, najpotężniejsi w całym Kharos. Są oni strażnikami świątyń, kapłanek i promienia. Posiadający predyspozycje fizyczne i mentalne do zostania wyznawcami słońca selekcjonowani są, podobnie jak fanatycy, już w młodości. Przywdziewają kryjące całkowicie ich twarz złote maski; widzą jedynie przez swe zdolności prekognicji, będące dlań jakby trzecim okiem. Posiadają nadnaturalną, magiczną moc pochodzącą się ze słońca; wyznawcy nie panują jednak nad nią na tyle, by korzystać z niej swobodnie. Mimo to, za jej pomocą tworzą wokół siebie mistyczną tarczę, broniącą przed zaklęciami. Ich oręż to długie włócznie, którymi posługują się z zabójczą siłą i precyzją. Tajemniczy wyznawcy światła wzbudzają swą powierzchownością lęk u wrogów, którzy o nich nie słyszeli, a panikę wśród nieprzyjaciół, którzy wiedzą, z kim będą musieli się zmierzyć. --Poliuks

source: Sun Guardian
de: Wächter der Sonne
hu: Napőr
it: Guardiano del sole
ja: 太陽の守護者
pl: Strażnik Słońca

source: The Sun Guardian is more powerful than the Follower. Being so strong, he is chosen to protect the most important shrines in the Kharos country (50% reduction in spell damage).
de: Der Wächter der Sonne ist mächtiger als der Jünger. Wegen seiner Stärke ist es seine Aufgabe, die wichtigsten Schreine des Landes Kharos zu beschützen (50% weniger Schaden durch Zauber).
hu: A napőr sokkal erősebb, mint a hívő. Erejük miatt választották őket Kharos országa legfontosabb szent helyeinek védelmére (50%-kal csökkenti a mágikus támadások erejét).
it: Il guardiano del sole è molto più potente dell’adepto. È così forte che è stato eletto per proteggere i santuari più importanti della nazione di Kharos (50% danni magici in meno)

source: War Banner
de: Standarte
hu: Hadizászló
it: Stendardo di guerra
ja: 戦旗
pl: Sztandar Wojenny

source: White Warrior
de: Weißer Soldat
hu: Fehér harcos
it: Guerriero bianco
ja: 白の闘士
pl: Biały Wojownik

source: White warriors are equipped with a very sharp sword.
de: Weiße Soldaten führen sehr scharfe Schwerter.
hu: A fehér harcosok nagyon éles karddal vannak felfegyverezve.
it: I guerrieri bianchi sono equipaggiati con una spada molto tagliente.
pl: "W pierwszej linii Król Tazok posłał na naszą armie całkiem spory oddział tych wojowników. Nie stanowili oni dla nas dużego zagrożenia - nawet nie zdążyli dobiec do bastionu. Ale muszę im przyznać determinacje, gdyż gdy wielu z nich padało od cienia naszych strzał ani jeden z żyjących nie cofał sie by wyjść z zasięgu łuków, biegli na oślep jakby nie widząc rze?i jaką im prawiliśmy. Teraz z perspektywy czasu boje się myśleć co by było gdyby choćby garstce udało się dobiec do bastionu... " Król Marden a.d.678 --Zaku

source: Balloon
de: Ballon
hu: Léghajó
it: Mongolfiera
ja: 気球
pl: Balon

source: Capable of more than ample speeds, they can cover virtually any terrain with ease, and with a firebomb carrying dwarf in tow, have the potential to become a major nuisance in the heat of combat. Indeed, they are risky foes to attack, and only by turning their weapons against them can one remotely hold any certainty to disposing of them.
de: Einen Ballon als »schnell« zu bezeichnen, ist eine Untertreibung, und so gibt es für ihn kein ungünstiges Gelände, was in Kombination mit einem Brandbomben werfenden Zwerg im Korb zu einem großen Problem in der Hitze der Schlacht werden kann. Sie sind wahrlich gefährliche Gegner und nur, ihre eigenen Waffen gegen sie einzusetzen, erlaubt es, sie einigermaßen sicher loszuwerden.
hu: Több, mint elegendő gyorsasággal rendelkeznek, így könnyedén mozognak bármilyen terep felett, s a kosárban szállított tűzbombával a csata hevében döntő fölényre tehetnek szert. Valóban nehéz támadást indítani ellenük, s csak saját fegyverüket fordítva ellenük bízhat bárki abban, hogy elintézi őket.
it: Grazie alla loro velocità, possono coprire facilmente ogni tipo di terreno e possono attaccare avendo a bordo un nano bombarolo insediato all’interno del rimorchio. Certamente rappresentano una grave minaccia in battaglia e bisogna eliminarli il prima possibile.

source: bombs
de: Bombardierung
hu: bomba
it: bombe
ja: 爆弾
pl: bomby

source: Dwarvish Heavy Warrior
de: Schwerer Infanterist
hu: Törp nehéz harcos
it: Grande nano guerriero
ja: ドワーフの熟練闘士
pl: Krasnoludzki Ciężki Wojownik

source: gun
de: Gewehr
hu: fegyver
it: fucile
ja: 銃
pl: pistolet

source: Dwarvish Rune Lord
de: Runeneroberer
hu: Törp rúnaúr
it: Nano signore di rune
ja: ドワーフのルーン貴族
pl: Krasnoludzki Władca Run

source: runic sword
de: Verzaubertes Schwert
hu: rúnakard
it: spada runica
ja: ルーンソード
pl: runiczny miecz

source: Dwarvish Rune Warrior
de: Runeninfanterist
hu: Törp rúnaharcos
it: Nano guerriero di rune
ja: ドワーフのルーン闘士
pl: Krasnoludzki Runiczny Wojownik

source: Dwarvish Tank
de: Panzer
hu: Törp tank
it: Carro armato dei nani
ja: ドワーフの戦車
pl: Krasnoludzki Czołg

source: trample
de: Niedertrampeln
hu: taposóláb
it: schiacciamento
ja: 踏みつけ
pl: zdeptanie

source: explosive ammo
de: Explosivgeschoss
hu: robbanó lövedék
it: colpi esplosivi
ja: 火炎弾
pl: amunicja eksplodująca

source: piercing ammo
de: Durchbruchsgeschoss
hu: robbanótöltény
it: colpi perforanti
ja: 徹甲弾
pl: amunicja przebijająca

source: Dwarvish Warrior
de: Infanterist
hu: Törp harcos
it: Nano guerriero
ja: ドワーフの闘士
pl: Krasnoludzki Wojownik

source: Though Runists in name, very few of dwarfish kin have both have the capacity and the willingness to dedicate their existences in rune-making. Instead, many will immerse themselves in what they believe was nature’s intended desire — the way of the warrior. Their dour, stout figures serve them suitably, as they learn to wield weaponry with born alacrity. If one seeks to incur a Dwarrow’s wrath, then do so at your own peril, for if any risk their lives intruding within the iron strongholds which dwarves inhabit, then they will be greeted by these foot soldiers, blade bearing warriors that are sure to fend off any attempts at assault.
de: Auch wenn sie de iure Runologen sind, bringen nur sehr wenige Zwerge sowohl Talent als auch Wille auf, ihr Leben der Runenkunde zu widmen. Stattdessen wenden sie sich dem zu, was sie für ihre natürliche Bestimmung hallten — dem Soldatentum. Ihre stämmige Statur ist dazu sehr geeignet, wenn sie mit natürlicher Begeisterung den Umgang mit den Waffen lernen. Sollte jemand um den Zorn eines Zwergenreiches bemüht sein, dann tue er dies auf eigene Gefahr, denn falls jemand in ihre eisernen Bastionen eindringt und ihr leben bedroht, werden sie von dieser Infanterie begrüßt werden, klingenschwingende Soldaten, die jeden Angriff vereiteln werden.
hu: Habár nevükben szerepel a rúna, a törpök közül kevesen rendelkeznek a rúnavésés képességével, s még kevesebben hajlandók életüket e képesség fejlesztésének szentelni. Ehelyett belemerülnek a természetüknek jobban megfelelő harci kiképzésbe. Szikár, zömök termetük megfelelően szolgálja őket, mivel velükszületett fürgeségüknél fogva könnyen megtanulják a fegyverforgatást is. Ha valaki meg akarja ismerni a törpök haragját, csak saját felelősségére próbálkozzon, hiszen vasból épült erődeikbe benyomulva ezek a gyalogosok fogadják őket, akik félelmetes pengéikkel bármi áron megakadályoznak mindenféle behatolási kísérletet.
it: Anche se vengono chiamati runisti, solo poche stirpi di questi nani hanno la capacità e la buona volontà di dedicare la propria esistenza alla fabbricazione di rune. Molti invece scelgono ciò di cui credono che la natura li abbia designato: la strada del guerriero. Il loro aspetto severo e robusto li aiuta a brandire le armi con prontezza. Se qualcuno attira su se stesso la furia di un nano sarà in grosso pericolo, e per chi s’introduce abusivamente nelle loro roccaforti verrà accolto da guerrieri forti e pronti in grado di neutralizzare ogni tipo di assalto.

source: Flying Fortress
de: Fliegende Festung
hu: Repülő erőd
it: Fortezza volante
ja: 空飛ぶ要塞
pl: Latająca Forteca

source: Flying Fortresses symbolize the height of dwarfish ingenuity. Looked upon as an airborne tank, a Flying Fortress employs a trio of immense rotor blades to support their flight, with the giant balloon retreating into a secondary support. As well as enabling the crew to equip themselves with larger and more powerful weapons, it has also nullified the great weaknesses previous models had against fire. These intimidating monsters are capable of dominating the skies, unleashing their wrath upon those unfortunate enough to cross their path. If the twin powered heavy cannon fire does not spell their doom, then the chattering of the machine guns and the pounding of explosives will. Over the centuries, they have accrued a fearsome reputation, and are rightly feared by all but the strongest foe.
de: Fliegende Festungen sind der Höhepunkt des Genies des Kleinen Volks. Dieser Panzer der Lüfte fliegt mithilfe dreier riesiger Rotoren, während der Ballon nur noch eine unterstützende Rolle erfüllt. Dies ermöglicht zum einen der Mannschaft, mehr und großkalibrigere Waffen einzusetzen, zudem wird die große Schwäche vorheriger Modelle, die Feueranfälligkeit, behoben. Diese furchteinflößenden Monstrositäten können ohne weiteres die Lufthoheit zu erringen, und ihren Zorn auf jene Unglückseligen, die in ihre Flugbahn geraten, zu richten. Wenn die schwere Zwillingskannone nicht ihr Schicksal besiegelt, so werden es das Sperrfeuer der Maschinengewehre und der Bombenhagel tun. Jahrhunderte des Luftkriegs haben die Fliegenden Festungen grausige Berühmtheit eingebracht, und nur die stärsten Gegner der Zwerge erschaudern -zu Recht- nicht beim Gedanken an diese Maschinen.
hu: A repülő erődök képviselik a törp leleményesség csúcsát. Kinézetre egy repülő tankhoz hasonlítanak, repülésüket három légcsavar biztosítja, ehhez társul a felszállást biztosító ballon. A legénység nagyerejű fegyverekkel van felszerelve, s kijavították a korábbi modellek gyengeségeit is. Ezek a félelmetes szörnyetegek uralják az eget, s gátlástalanul kiélik dühüket azokon a szerencsétleneken, akik keresztezik az útjukat. Ha a duplacsövű ágyúk tüze véletlenül nem intézné el őket, a kattodó gépfegyverek vagy a kidobott aknák biztosan végeznek velük. A századok során babonás tisztelet alakult ki irányukban, s még a legerősebb ellenségek is félik őket.
it: La fortezza volante simboleggia l’apice della tecnologia dei nani. Costruita in modo da avere la potenza di un carro armato e il vantaggio dell’aria, questa macchina da guerra ha a disposizione per volare tre grandi rotori e un pallone aerostatico come supporto secondario. Questo modello azzera ogni debolezza al fuoco presente nei modelli precedenti, inoltre dispone di un equipaggio ben attrezzato con armi all’avanguardia. Questi mostri di metallo che dominano i cieli, sfoderano la loro furia su chiunque abbia la sfortuna di incontrarli sulla propria strada. Le mitragliatrici e le bombe riescono a centrare il bersaglio laddove il doppio cannone pesante fallisce. Secolo dopo secolo, la loro reputazione di morte e distruzione aumentò, diventando un pericolo cosi grande da far tremare anche i guerrieri più potenti.

source: machine gun
de: Maschinengewehr
hu: gépfegyver
it: mitragliatrice
ja: マシンガン
pl: karabin maszynowy

source: cannon
de: Kanone
hu: ágyú
it: cannone
ja: カノン
pl: działo

source: Heavy Balloon
de: Schwerer Ballon
hu: Nehéz ballon
it: Mongolfiera pesante
ja: 大気球
pl: Ciężki Balon
