Repository: wescamp/Era_of_Magic-1.10
Catalog: po/*.po
Languages: de, hu, it, ja, pl

source: Random Default
de: Zufällige Standardfaktion
hu: Véletlen alapbeállítás
it: Predefinito casuale
pl: Losowy

source: Era of Magic
de: Zeit der Magie
hu: Mágikus kor
it: Era della magia
ja: 魔法の時代
pl: Era Magii

source: EoMa RPG
it: EdM RPG

source: EoMa Heroes
it: EdM eroi

source: EoMa Masters & Slaves
it: EdM maestri e schiavi

source: Default + EoMa
it: Predefinita + EdM

source: Heroes + EoMa
it: Eroi + EdM

source: range^kamikaze
de: Kamikaze
hu: kamikázé
it: kamikaze
pl: kamikaze

source: Barbarians
de: Barbarenhorde
hu: Barbárok
it: Barbari
ja: バーバリアン
pl: Barbarzyńcy

source: Dark Blood Alliance
de: Die Allianz der Dunkelblüter
hu: Sötét Vér Szövetség
it: Alleanza sanguescuro
ja: どす黒い血の同盟
pl: Sojusz Ciemnokrwistych

source: Destroyers
it: Devastatori

source: Sky Kingdom
de: Reich des Himmels
hu: Égi Királyság
it: Regno dei Cieli
ja: 空の王国
pl: Podniebne Królestwo

source: Runemasters
de: Runologen
hu: Rúnamesterek
it: Maestri di rune
ja: ルーンマスター
pl: Mistrzowie Run

source: Ancient Cyclops
de: Zyklopenältester
hu: Ősi küklopsz
it: Ciclope antico
ja: 古代のサイクロプス
pl: Starożytny Cyklop

source: eye
de: Böses Auge
hu: szem
it: occhio
ja: 視線
pl: oko

source: Barbarian
de: Barbar
hu: Barbár
it: Barbaro
ja: バーバリアン
pl: Barbarzyńca

source: sword+axe
de: Schwert und Axt
hu: kard+bárd
it: spada+ascia
ja: 剣+斧
pl: miecz+topór

source: Barbarian Berserker
de: Berserker
hu: Őrjöngő barbár
it: Barbaro furioso
ja: バーバリアンの狂戦士
pl: Barbarzyński Berserker

source: Barbarian King
de: Barbarenherrscher
hu: Barbár király
it: Re dei barbari
ja: バーバリアンの王
pl: Barbarzyński Król

source: Barbarian Lord
de: Barbarenhäuptling
hu: Barbár úr
it: Signore dei barbari
ja: バーバリアンの貴族
pl: Barbarzyński Władca

source: Blood Warrior
de: Blutrünstiger
hu: Véreskezű
it: Guerriero sanguinario
ja: 血糊の闘士
pl: Krwawy Wojownik

source: Cyclops
de: Zyklop
hu: Küklopsz
it: Ciclope
ja: サイクロプス
pl: Cyklop

source: Cumbersome and lacking fine intellect, the Cyclops race had been driven near to extinction before becoming a part of the barbarian horde. Two centuries later and these lumbering beasts have flourished, growing in both strength and number. Some say that it was a strange magic which bound the cyclopes to their new allegiance and is perhaps a reason for their increased power. One thing about these beasts is a certainty: when facing one in combat it is best not to get hit.
de: Ungeschickt und nicht sehr helle standen die Zyklopen am Rande des Aussterbens, bevor sie Teil der Barbarenhorde. Zwei Jahrhunderte gedeihen diese Kolosse, werden immer stärker und zahlreicher. Es heißt, eine seltsame Magie binde die Zyklopen an ihre neuen Verbündeten, was der Grund für ihre erhöhte Macht sein könnte. Doch eines steht fest: steht man einem Zyklopen im Kampf gegenüber, sollte man besser nicht getroffen werden.
hu: Az ormótlan, szubintelligens küklopszok a kipusztulás szélére jutottak, mielőtt a barbár hordák kebelébe kerültek. Két évszázad alatt ezek a fanyűvő szörnyek egy új virágkort értek meg, számuk és erejük is megnövekedett. Azt rebesgetik, hogy valamilyen különleges mágia kapcsolja ezeket a küklopszokat az új szövetségeseikhez, s talán ez okozza a megnövekedett erejüket is. Egyetlen dolog biztos ezekkel a szörnyekkel kapcsolatban: ha csatában szembekerülsz velük, erősen ajánlott elkerülni az ütéseiket.
it: Enormi e privi di intelletto, l’antica razza dei ciclopi veniva cacciata e stava inevitabilmente estinguendo prima di diventare una parte dell’orda dei barbari finché, inspiegabilmente, dopo due secoli queste creature hanno cominciato a proliferare, crescendo in forza e numero. Non si sa ancora perché i ciclopi combattano insieme ai barbari, alcuni dicono che la fedeltà dei ciclopi sia legata da una strana magia e questo presupposto sembrerebbe una valida ragione del loro incremento di potere. Una cosa su queste bestie è certa: quando ne hai uno di fronte in combattimento, evita di farti colpire.

source: Cyclops Breaker
de: Reihenbrecher
hu: Romboló küklopsz
it: Ciclope spaccatutto
ja: サイクロプスの破壊者
pl: Cyklop Łamacz

source: Cyclops Destroyer
de: Vernichtender Zyklop
hu: Pusztító küklopsz
it: Ciclope distruttore
ja: サイクロプスデストロイヤー
pl: Cyklop Niszczyciel

source: tree
de: Baumkeule
hu: fa
it: tronco
ja: 木
pl: drzewo

source: tree thrown
de: Geworfener Baum
hu: hajítófa
it: lancio del tronco
ja: 木を投げる
pl: rzut drzewem

source: Mighty Cyclops
de: Mächtiger Zyklop
hu: Brutális küklopsz
it: Ciclope possente
ja: 強力なサイクロプス
pl: Mocarny Cyklop

source: Fire Cyclops
de: Feuerzyklop
hu: Tűzküklopsz
it: Ciclope del fuoco
ja: 火のサイクロプス
pl: Ognisty Cyklop

source: Goblin Archer
de: Kobold-Schütze
hu: Kobold íjász
it: Goblin arciere
ja: ゴブリンの射手
pl: Goblin Łucznik

source: poisoned arrow
de: Giftpfeil
hu: mérgezett nyíl
it: freccia avvelenata
ja: 毒矢
pl: zatruta strzała

source: Goblin Assassin
de: Koboldmörder
hu: Kobold bérgyilkos
it: Goblin assassino
ja: ゴブリンの暗殺者
pl: Goblin Zabójca

source: Goblin Hunter
de: Koboldjäger
hu: Kobold vadász
it: Goblin cacciatore
ja: ゴブリンの狩人
pl: Goblin Myśliwy

source: explosion
hu: robbanás
it: esplosione
ja: 爆発
pl: eksplozja

source: Goblin Rouser
de: Kobold-Veteran
hu: Kobold felbujtó
it: Goblin incitatore
ja: 最強ゴブリン
pl: Goblin Plądrownik

source: Standard-bearers are an oddity amongst goblins. A goblin who has survived enough battles to be considered a veteran is rare enough, and it is rarer still for the other goblins to recognize and respect his veteran status. Nonetheless, a rouser’s frenzied goading effectively steels the younger at arms to fight harder and longer before they die.
de: Überlebt ein koboldischer Speerträger die wilden Schlachten, in die sie von den Orks geschickt werden, erhält er den Titel eines Veteranen. Er rüstet sich mit einem längeren und besseren Speer aus, der es ihm ermöglicht, im Nahkampf immer den ersten Angriff auszuführen und wird wieder in die Schlacht geschickt.
hu: A zászlótartók a koboldok közt nagyon ritkák. Egy kobold, aki sok csatát látott, és túl is élte azokat, olyan ritka a koboldok között, hogy méltán kiérdemli a többiek tiszteletét és nagyrabecsülését. Emiatt aztán a nógatásuk valósággal megacélozza az ifjú koboldokat, akik keményebben és tovább harcolnak, mielőtt meghalnak.
it: I portabandiera sono una stranezza tra i goblin. Un goblin sopravvissuto a numerose battaglie per essere considerato un veterano è abbastanza raro, ed è ancora più raro per gli altri goblin a riconoscere e rispettare lo stato di veterano. Nondimeno, un tifoso incitatore stimola i giovani davanti a combattere più duramente e più a lungo prima di morire.

source: spear throw
de: Wurfspieß
hu: hajítódárda
it: tiro con la lancia
ja: 投げ槍
pl: rzut włócznią

source: Goblin Runt
de: Kobold-Speerträger
hu: Nyápic kobold
it: Goblin omuncolo
ja: 小ゴブリン
pl: Mały Goblin

source: Belonging to a race already small in statue Goblin runts are born smaller and weaker then most. Indeed it is a wonder that such tiny creatures can fight at all, armed as they are with any piece of pointy scrap metal found lying around. Their superiors use them for cannon fodder, hurling them into impossible situations with often surprising results.
de: Alle Kobolde, die nicht in der Lage sind, auf einem Wolf zu reiten, werden von den Orks mit zerschlissenen Lederrüstungen und rostigen Speeren ausgerüstet und in Massen auf den Gegner losgelassen. Sie dienen hauptsächlich als Kanonenfutter, um den orkischen Kriegern mehr Zeit für die eigentliche Offensive zu verschaffen.
hu: A nyápicok még az általában kistermetű koboldok közül is kitűnnek törpeségükkel. Már az is csoda, hogy egy ilyen parányi lény harcba bocsátkozik, s ráadásul még páncélt is viselnek, amit az elhullajtott fémdarabkákból eszkábálnak maguknak. Feletteseik ágyútöltelék gyanánt használják őket, képtelen helyzetekben is bevetik őket nemegyszer meglepően eredményesen.
it: Rispetto alle altre razze, i goblin omuncoli sono ancora più piccoli e più deboli. Infatti, è una meraviglia che tali creature siano in grado di combattere, per di più armate di qualche pezzo di ferraglia trovata in giro. Vengono inoltre sfruttati come “carne da cannone” dai loro superiori, che li scagliano in assurde situazioni con risultati spesso sorprendenti.
pl: Gobliny, wbrew wielu przeczącym przekazom, zdają się być wręcz urodzone do wojny. Pomimo ich słabości i tchórzostwa, w społeczeństwie goblinów absolutnie nie ma nikogo, kto by nie walczył. W ten sposób powstają hordy wymachujących włóczniami, miernych wojowników, którzy gotowi są zmiażdżyć każdego wroga, o ile tylko będą mieli przewagę siedmiu do jednego. Mimo, że w wielu sercach widok szarżujących, potykających się o swe własne włócznie goblinów stanowi widok bardziej śmieszny niż przerażający, to nie można odmówić im zajadłości i zaangażowania. Przynajmniej do czasu, kiedy przechylająca się w nie tę stronę co trzeba sytuacja nie skłoni ich do ucieczki... --barowei

source: Goblin Sniper
de: Kobold-Scharfschütze
hu: Kobold mesterlövész
it: Goblin cecchino
ja: ゴブリンの狙撃手
pl: Goblin Snajper

source: Goblin Warbanner
de: Bannerträger der Kobolde
hu: Kobold zászlótartó
it: Goblin con stendardo di guerra
ja: ゴブリンの戦旗
pl: Gobliński Chorąży

source: Goblin Warrior
de: Kobold-Krieger
hu: Kobold harcos
it: Goblin guerriero
ja: ゴブリンの闘士
pl: Goblin Wojownik

source: Orcish Warbanner
de: Bannerträger der Orks
hu: Ork zászlótartó
it: Orco con stendardo di guerra
ja: オークの戦旗
pl: Ork Chorąży

source: Savage and warlike Orcs form the back bone of the Barbarian hordes. Orc society is ill-suited to large-scale warfare, which leaves their small tribes at prey to the more organized might of the world’s various armies. However in the last two centuries something has changed. Orcs now fight with Cyclops, Trolls, Rocs and goblins side by side whether it be in brutal hunting packs or full blown armies. The origins of this change are unknown but one thing is sure, when the barbarian hordes come screaming for your blood the Orcs will be leading the charge.
de: Wilde und kriegerische Orks bilden das Rückrat der Barbarenhorden. Die Gesellschaft der Orks ist nicht für größere Kriege geeignet, was ihre kleinen Stämme zu leichten Opfern für die vielen besser organisierten Armeen der Welt macht. Doch in den letzten zwei Jahrhunderten hat sich irgendetwas verändert. Orks kämpfen nun Seite an Seite mit Zyklopen, Trollen, Rokhs und Kobolden, als grausame Jägertrupps wie auch als richtige Armeen. Der Ursprung dieses Wandels ist unbekannt, doch eines ist sicher: Dürsten die Barbarenhorden nach Blut, führen die Orks den Sturm.
hu: A kegyetlen és harcimádó orkok alkotják a barbár hordák gerincét. Az ork társadalomra súlyos csapást mértek a kiterjedt, nagyszabású háborúk, mivel a kisebb törzsek hamar elvéreztek a jólszervezett különböző eredetű seregekkel szemben. Az utóbbi két évszázad során azonban valami megváltozott. Az orkokkal vállvetve napjainkban küklopszok, trollok, rokmadarak és koboldok is harcolnak úgy az egyszerű portyákon, mint az óriási sereggel bonyolított hadjáratokon. Hogy mi okozta ezt a változást, senki sem tudja, de az eredményt mindenki láthatja, amikor vad csatakiáltásokkal vérszomjas orkok állnak a rohamozó csapatok élén.
it: Gli orchi selvaggi e guerrieri formano la spina dorsale delle orde barbariche. La società degli orchi mal si adatta alla grande guerra, in cui ogni componente lascia la propria piccola tribù per arruolarsi tra le varie armate mondiali. Comunque qualcosa è cambiato negli ultimi due secoli: gli orchi ora combattono fianco a fianco dei ciclopi, dei troll, dei roc e dei goblin sia che si tratti di gruppi da caccia o eserciti regolari. Le origini di questo cambiamento sono sconosciute ma una cosa è certa, quando le orde barbariche vengono a reclamare il tuo sangue, gli orchi comanderanno l’assalto.

source: Orcish Warrior
de: Wilder
hu: Ork harcos
it: Orco guerriero
ja: オークの闘士
pl: Ork Wojownik

source: Raging Cyclops
de: Gewaltiger Zyklop
hu: Őrjöngő küklopsz
it: Ciclope furioso
ja: 怒り狂うサイクロプス
pl: Wściekły Cyklop

source: Roc Master
de: Rokhbändiger
hu: Rokhajcsár
it: Maestro di roc
ja: ロックの支配者
pl: Mistrz Roków

source: Roc Rider
de: Rokhreiter
hu: Roklovas
it: Cavalcatore di roc
ja: ロックの乗り手
pl: Jeździec Roków

source: The Rocs of Thornspire Mountain had long grown fat off the flesh of the goblins who lived below. It took one particularly mad and foolhardy goblin to change the fate of his people when he set out to tame the beasts. After several narrow escapes the goblin managed to steal an egg from the great birds and rose it under his care. Less then three months later when the Rocs attacked they were surprised to hear a piercing cry from above and even more surprised when they were ripped to shreds by one of their own. To this day the goblins ride tamed Rocs into battle, their battle cries the only warning of impending doom.
de: Die Rokhs des Bergs Dornenturm hatten sich lange am Fleisch der talbewohnenenen Kobolde fettgefressen. Ein besonders irrer und tollkühner Kobold änderte schließlich das Schicksal seines Volkes, als er auszog, die Vögel zu zähmen. Nach mehreren knappen Fluchten konnte der Kobold ein Ei der riesigen Räuber stehlen und ausbrüten. Als weniger als drei Monate später die Rokhs erneut angriffen, waren sie überrascht, als sie einen durchdringenen Schrei aus der Höhe hörten und mehr noch, als einer von ihnen sie zerfetzte. Seit diesem Tag reiten die Kobolde auf zahmen Rokhs in die Schlacht, und ihre Schreie sind die einzige Wahnung vor dem drohenden Unheil.
hu: A Thornspire-hegység rokmadarai sokáig az alant lakó koboldok húsából híztak kövérre. Mígnem egy félőrült, merész kobold gyökeresen új irányt szabott a történéseknek, s megszelidítette ezeket a repülő bestiákat. Többszöri, hajszál híján tragikusan végződő kísérlet után sikerült egy tojást ellopnia a nagy madaraktól, s kikeltenie és felnevelnie egy fiókát. Három hónappal később a vadászó rokmadarakat egy éles vijjogással a levegőből támadta meg, s szaggatta szét saját fajtársuk. Ettől a naptól kezdve a koboldok rokmadarakon lovagolva mentek csatázni, s csatakiáltásuk a közelgő végítélet előjelévé vált.
it: Tanto tempo fa, i roc della Montagna di Thornspire si cibavano della carne dei goblin che vivevano di sotto. Ci è voluto un goblin particolarmente pazzo e avventato per cambiare il destino del suo popolo, il quale decise di domare queste bestie. Si racconta che dopo diverse fughe il goblin alla fine sia riuscito a rubare un uovo rosa di roc, avendone molta cura. Dopo appena tre mesi, quando i roc attaccarono il villaggio, furono sorpresi nel sentire un grido lacerante e ancora di più quando furono strappati a brandelli da un loro simile. Fino ad oggi i goblin cavalcano roc addomesticati per la battaglia, e il grido di guerra dei rapaci avverte la morte imminente.
pl: Roki z Cierniowej Góry przez długi czas obrastały w tłuszcz a to za sprawą pożywnych Goblinów mieszkających u podnóży. Dopiero jeden wyjątkowo szalony i lekkomyślny postanowił odmienić los swoich ziomków i wyruszył oswoić te dzikie bestie. Po kilku cudem udanych ucieczkach Goblin zdołał wykraść jajo prosto z gniazda wielkiego ptaka i wysiedzieć je samemu. Po mniej niż trzech miesiącach, kiedy Roki ponownie zaatakowały goblińską wioskę, zaskoczone zostały słysząc przenikliwy pisk z góry, tym bardziej, że chwilę później zostały rozerwane na strzępy przez jednego ze swoich. Od tamtej pory Gobliny wykorzystują oswojone Roki do walki, a ich okrzyki bojowe zwiastują wrogowi nadchodzącą zagładę.

source: Troll Fire Wizard
de: Trollzauberer
hu: Troll tűzvarázsló
it: Troll stregone del fuoco
ja: トロルの火の魔術師
pl: Czarownik Ognia

source: Troll shamans are the mystical leaders of the trolls. Though not as strong or tough as other trolls, their true power lies in their fire magic, which they use to blast enemies with gouts of fire.
de: Trollzauberer sind die mystischen Führer der Trolle. Sie sind nicht so stark wie andere Trolle, aber ihre wahre Macht liegt in ihrer Feuermagie, mit der sie ihren Feinden eine Gischt aus Feuer entgegenschleudern.
hu: A troll sámánok a trollok misztikus vezetői. Habár nem olyan erősek, mint a többi troll, igazi erejük a tűzmágiájukban rejtőzik, amelynek segítségével pusztító tűzvihart bocsátanak ellenségeikre.
it: I troll sciamani sono i capi mistici dei troll. Anche se non forti come gli altri troll, il loro potere risiede nel fuoco magico, usato per distruggere i nemici.
pl: Trolle szamani to mistyczni przywódcy Trolli. Choć nie są tak silni jak inni przedstawiciele tego gatunku, ich prawdziwa moc leży w magii ognia, której używają aby spopielić swych przeciwników płonącymi kulami.

source: flame blast
de: Feuer
hu: tűzvihar
it: fiammata
ja: 炎の爆発
pl: ognisty podmuch

source: Troll Sorcerer
de: Feuertroll
hu: Troll boszorkány
it: Troll incantatore
ja: トロルの魔術師
pl: Troll Czarodziej

source: The Trolls within the Barbarian horde do not practice magic as it is known to most races of the world although it easily could be confused for such. Rather the rough skin of these mysterious creatures when brought into rapid contact with itself can spark, igniting any flammable materials around them. Thus with a snap of the fingers trolls can ignite the small bundles of straw held within their palms before flinging them at the enemy. Such is the preternatural aim of the Troll Sorcerers that no matter where the target is hiding they will unerringly seek it out.
de: Die Trolle in der Barbarenhorde wirken Magie nicht, wie sie den meisten Völkern der Welt bekannt ist, obschon sie leicht mit ihr zu verwechseln ist. Stattdessen kann die raue Haut dieser geheimnisvollen Geschöpfe Funken schlagen, wenn sie schnell aneinander gerieben wird, und so alles Flammbare in ihrer Nähe entzünden. Deshalb können Trolle mit einem Schnipsen die kleine Strohbündel entflammen, die sie in den Händen halten, bevor sie diese auf ihre Feinde werfen. Die angeborene Treffsicherheit der Feuertrolle ist so hoch, dass, wo sich das Ziel auch verstecken mag, sie es fehlerlos finden können.
hu: A barbár hordák trolljai közismerten nem használnak mágiát, de az ilyen vélekedést könnyen összezavarhatják az ilyen jelenségek. Valójában e misztikus lények durva bőre adja a jelenség kulcsát, amely dörzsölés hatására szikrázik, s e szikrák gyújtanak meg bármilyen gyúlékony anyagot. Ezt kihasználva a trollok ujjpattintással szikrát csiholnak, ami meggyújtja a markukban tartott szalmát, s ezt dobják az ellenségre. Így magyarázható a troll boszorkányok természetfeletti képessége, s így hiába bújik el a célpont, a támadás mindig eléri.
it: Come molti sanno, i troll appartenenti all’orda barbarica non praticano la magia anche se ciò non è del tutto veritiero. Grazie alla loro pelle ruvida che, se sfregata accende ogni tipo di materiale infiammabile, possono eseguire una tecnica speciale: con il semplice schiocco di dita i troll accendono dei piccoli fasci di paglia celati nelle loro mani per gettarli via contro il bersaglio. E non importa dove il nemico si nasconda, la loro prodigiosa mira è infallibile.

source: Troll Warbanner
de: Bannerträger der Trolle
hu: Troll zászlótartó
it: Troll con stendardo di guerra
ja: トロルの戦旗
pl: Troll Chorąży

source: banner
hu: hadizászló
it: stendardo
ja: 旗
pl: Chorągiew

source: Battle Toad
de: Kriegskröte
hu: Harcivarangy
it: Rospo da battaglia
ja: 戦闘型カエル
pl: Ropucha Bojowa

source: paw
de: Trampeln
hu: mancs
it: zampa
ja: 足
pl: łapa

source: tongue
de: Zunge
hu: nyelv
it: lingua
ja: 舌
pl: język

source: charge
de: Ansturm
hu: roham
it: carica
ja: 突進
pl: szarża

source: Black Salamander
de: Schwarzer Salamander
hu: Fekete szalamandra
it: Salamandra nera
ja: ブラックサラマンダー
pl: Czarna Salamandra

source: wrist blade
de: Handklinge
hu: csuklópenge
it: lama da polso
ja: リストブレード
pl: naręczne ostrze

source: Blue Salamander
de: Blauer Salamander
hu: Kék szalamandra
it: Salamandra blu
ja: ブルーサラマンダー
pl: Błękitna Salamandra

source: Chaos Rider
de: Chaosreiter
hu: Káosz lovas
it: Cavalcatore del caos
ja: カオスワイバーンの乗り手
pl: Jeździec Chaosu

source: scream
de: Gebrüll
hu: sikoly
it: urlo
ja: 叫び
pl: krzyk

source: Chaos Wyvern
hu: Káosz sárkánykígyó
it: Viverna del caos
ja: カオスワイバーン
pl: Chaotyczna Wiwerna

source: tackle
de: Niederwerfen
hu: szerszám
it: afferra
ja: 体当たり
pl: uderzenie

source: Chosen of Forest
de: Auserwählter des Waldes
hu: Erdei Kiválasztott
it: Prescelto della foresta
ja: 森林の選民
pl: Wybraniec Lasu

source: iceball
de: Eisball
hu: jéggolyó
it: sfera di ghiaccio
ja: 氷球
pl: kula lodu

source: Clan Leader
de: Stammesführer
hu: Klánfőnök
it: Capo clan
ja: 一族の指導者
pl: Przywódca Klanu

source: Adepts who excel in battle, usually through cunning implementation of their water magicks, become the de-facto leaders of their clans, as signified by the extra feathers in their headdresses. Their knowledge expands, allowing them to enspell their claws to make them more powerful; to cast deadlier ice-balls; and to cast better healing magic.
de: Schamanen, die in der Schlacht hervorragen, meist aufgrund kluger Anwendung ihrer Wasserzauber, werden zu den tatsächlichen Stammesführern, wie die zusätzlichen Federn in ihrem Kopfschmuck signalisieren. Ihr wissen wächst, sodass sie ihre Krallen mächtiger zaubern, tödlichere Eisbälle schleudern und besser heilen können.
hu: Azok a gyakornokok, akik a csatákban is bizonyították rátermettségüket, leginkább furfangos vízmágia bevetésével, ténylegesen is a klánjuk vezetőivé válnak, amelyet a fejpántjukba tűzött tollakkal fejeznek ki. Tudásuk növekedésével karmaikat is mágikus fegyverré alakítják; még halálosabb jéggolyókat lövellnek, s hatékonyabban gyógyítanak.
it: Gli adepti che eccellono in battaglia di solito perfezionano i loro attacchi d’acqua, diventando leader dei loro clan, come simboleggiato dalle piume del loro copricapo. La loro conoscenza si espande a tal punto da essere capaci di: combattere con artigli molto potenti, evocare sfere di ghiaccio mortali, e guarire meglio le ferite degli alleati.

source: Corrupted Shaman
de: Verdorbener Schamane
hu: Megrontott sámán
it: Sciamano corrotto
ja: 堕落した呪術師
pl: Zdeprawowany Szaman
