Repository: wescamp/Era_of_Magic-1.10
Catalog: po/*.po
Languages: de, hu, it, ja, pl

source: dark aura
de: Aura der Finsternis
hu: sötét aura
it: aura oscura
ja: 闇のオーラ
pl: mroczna aura

source: Dark Aura: Makes all adjacent enemy units fight worse (−25% for attack).
de: Die Aura der Finsternis schwächt alle Gegner (senkt den Schaden um 25%)
hu: Sötét Aura: A sötét aura az ellenséges támadások sebzését csökkenti (25%-kal).
it: Aura oscura: Induce tutte le unità nemiche adiacenti a combattere male (-25% ad ogni attacco)

source: ultracures
de: Perfekte Heilung
hu: szupergyógyítás
it: super-cura
ja: 超回復
pl: ultrauzdrowienie

source: Heals +12: Allows the unit to heal adjacent friendly units at the beginning of each turn. A unit cared for by this healer may heal up to 12 HP per turn. A curer can cure a unit of poison, although that unit will receive no additional healing on the turn it is cured of the poison.
de: Perfekte Heilung; Diese Einheit kann benachbarte Verbündete um zwölf Lebenspunkte heilen oder Gift entfernen.
hu: Gyógyítás +12: A közeli egységeket minden kör elején meggyógyítja. A meggyógyított egység legfeljebb 12 ÉP-t gyógyul körönként. Az egység képes kikúrálni a mérgezésből is, ekkor viszont nem gyógyul a páciens.
it: Guarisce +12: Cura le unità amiche adiacenti all’inizio di ogni turno. Un’unità curata dal guaritore può dopo ricevere un massimo di 12 pf al turno. Un guaritore cura un’unità avvelenata, sebbene quell’unità curata dal veleno non riceverà nessun punto ferita addizionale al turno.
ja: 回復 +12: このユニットは隣接した友好的なユニットをターン開始時に回復させます。 このユニットに治療されるユニットは 1 ターンに最大でHPが 12 回復します。また、毒を受けたユニットを治療することができます。ただし、毒から治療されたそのターン内には、さらなる回復は受けられません。
pl: Uzdrawia +12: Jednostka ta uzdrawia wszystkie przyległe sojusznicze jednostki na początku każdej tury.Jednostka leczona przez tego uzdrowiciela może odzyskać do 12 punktów życia. Uzdrowiciel może uleczyć jednostkę z zatrucia, ale wtedy jednostka ta nie dostanie w tej samej turze dodatkowych punktów życia.

source: defender
de: Verteidiger
hu: védelmező
it: difensore
ja: 擁護
pl: obrońca

source: Defender: Adjacent friendly units receive a +20% bonus to all resistances (up to a maximum of 40%).
de: verteidiger: Alle umliegenden Verbündete erhalten einen Bonus von 20% auf alle Resistenzen (bis zu 40%)
hu: Védelmező: A közeli baráti egységek +20% ellenállással vérteződnek fel (legfeljebb 40%-ig)
it: Difensore: Unità amiche adiacenti ricevono un +20% di bonus aggiunto alle loro resistenze (fino ad arrivare a un massimo di 40%).
ja: 擁護: 隣接する友好的なユニットは、全ての攻撃型に対する抵抗力が +20% 向上 (最大 40%) します。
pl: Obrońca:

source: precision
de: Genauigkeit
hu: precizitás
it: precisione
ja: 精度
pl: precyzja

source: Precision: This attack always has a 80% chance to hit
it: Precisione: L’attacco ha sempre una probabilità di colpire pari all’80%.

source: circle of resistance
de: Schutzkreis
hu: ellenállási kör
it: cerchio della resistenza
ja: 抵抗の魔法陣
pl: krąg odporności

source: Circle of Resistance: This unit and all adjacent friendly units receive a +20% bonus to fire, cold, and arcane resistances.
de: Schutzkreis: Diese und alle angrenzenden Verbündeten erhalten einen Bonus von 20% auf die magischen Resistenzen.
hu: Ellenállási kör: Ez az egység és a baráti egységek +20% ellenállással vérteződnek fel a tűz, a hideg és a földöntúli támadások ellen.
it: Cerchio della resistenza: L’unità e tutte le unità amiche vicine ad essa ricevono un bonus pari al +20% per resistere agli attacchi esoterici, al fuoco e al freddo.

source: circle of susceptibility
de: Kreis der Verwundbarkeit
hu: gyengítő kör
it: cerchio della suscettibilità

source: Circle of Susceptibility: All adjacent enemy units’ fire, cold, and arcane resistances are weakened by 20%.
de: Kreis der Verwundbarkeit: Alle angrenzenden Feinde erhalten einen Malus von 20% auf die Magieresistenzen.
it: Cerchio della suscettibilità: Le resistenze agli attacchi esoterici, al fuoco e al gelo di tutte le unità nemiche adiacenti vengono ridotte del 20%.

source: deadzone
de: Sperrgebiet
hu: holtsáv
it: zona morta
ja: 死角
pl: martwa strefa

source: Deadzone: Adjacent friendly units receive a 99% bonus to fire, cold, and arcane resistances.
de: Umliegende Verbündete erhalten einen Bonus von 99% auf die Magieresistenzen.
hu: Holtsáv: A szomszédos baráti egységek 99% ellenállást kapnak a tűz-, hideg és földöntúli támadások ellen.
it: Zona morta: Le unità amiche vicine ricevono un bonus pari al 99% alla resistenza esoterica, al fuoco e al freddo.

source: cold aura
de: Aure der Kälte
hu: hideg aura
it: aura fredda
ja: 冷気のオーラ
pl: mroźna aura

source: Cold Aura: Area around this unit provides a 50% bonus to fire resistance and a −25% bonus to cold resistance.
de: Aura der Kälte: Im Gebiet um diese Einheit ist die Feuerreisistenz um 50% höher und die Kälteresistenz um 25% geringer.
hu: Hideg aura: A szomszédos egységek 50% ellenállást kapnak a tűztámadások ellen, s 25%-kal csökken a hideg támadások elleni védelmük. Minden hideg varázslat nagyon hatásos ebben az aurában.
it: Aura fredda. L’aura attorno al nemico garantisce un bonus di 50% alla resistenza al fuoco e -25% alla resistenza al freddo.

source: revenge
de: Vergeltung
hu: bosszú
it: vendetta
ja: 報復
pl: zemsta

source: Revenge: The unit has 100% hitting chance during retalitation.
it: Vendetta: L’unità ha una probabilità di colpire pari al 100% durante la rivalsa.

source: Kamikaze: This unit always hits a target when attacking, but it dies instantly.
de: Kamikaze: Diese Einheit trifft bei jedem Angriff ihr Opfer, stirebt aber sofort.
hu: Kamikaze: ez az egység mindig talál, de egyúttal maga is megsemmisül.
it: Kamikaze: L’unità colpisce sempre un bersaglio quando attacca, ma muore istantaneamente.

source: hit and run
de: Rückzug
hu: üss és fuss
it: mordi e fuggi
pl: cios i ucieczka

source: Hit and Run: This unit gains 3 moves back after attacking, but cannot attack again.
de: Rückzug: Diese Einheit erhält 3 BP nach einem Angriff, kann aber nicht nochmalangreifen
hu: Üss és fuss: Ez az egység támadás után még rendelkezik 3 mozgásponttal, de támadását már nem ismételheti meg.
it: Mordi e fuggi: L’unità guadagna 3 mosse in più dopo aver attaccato, senza però attaccare di nuovo.
ja: ヒットエンドラン: このユニットは攻撃した後に移動力を 3 得ます。再度攻撃することはできません。
pl: Cios i Ucieczka: Jednostka dostaje 3 dodatkowe punkty ruchu po ataku, ale nie może zaatakować ponownie w tej samej turze.

source: FLEE!
de: LAUF!
hu: FUTÁS!
it: FUGGI!
ja: 再移動！
pl: UCIEKAJ!

source: mountain ambush
de: Gebirgskrieger
hu: hegyi rajtaütés
it: imboscata nei monti
ja: 伏兵（山）
pl: górska zasadzka

source: mountain ambush
de: Gebirgskrieger
hu: hegyi rajtaütés
it: imboscata nei monti
ja: 伏兵（山）
pl: górska zasadzka

source: Mountain Ambush: This unit can hide in mountains and hills, and remain undetected by its enemies. Enemy units cannot see this unit while it is in mountains or hills, except if they have units next to it. Any enemy unit that first discovers this unit immediately loses all its remaining movement.
de: Gebirgskrieger: Diese Einhand kann sich auf Bergen und Hügeln verstecken. Feindliche Einheiten können diese Einheit nicht sehen oder angreifen, wenn sie sich in bergigem Gelände aufhält, außer wenn sich eine feindliche Einheit auf einem angrenzenden Feld befindet, oder direkt nachdem die Einheit selbst angegriffen hat.
hu: Hegyi rajtaütés: Ez az egység képes elrejtőzni a hegyi és dombsági terepen, ezáltal ellenfelei számára láthatatlanná válik. Az ellenséges egységek nem látják ezt az egységet, míg hegyen vagy dombon áll, kivéve ha mellélépnek. Az első ellenséges egység, amely felderíti ennek az egységnek a helyzetét, elveszti a mozgáspontjait.
it: Imboscata nei monti: L’unità è in grado di nascondersi nelle montagne e nelle colline, avendo la possibilità di non essere rilevata dai suoi nemici. Le unità nemiche non possono vedere se è nascosta nelle montagne o nelle colline, ad eccezione se essa si trova vicino a loro. Alcune unità nemiche perdono immediatamente tutti i loro movimenti restanti dopo aver scoperto per primi l’unità nascosta.
ja: 伏兵（山）: このユニットは山や丘に隠れることができます。そのため、山や丘にいれば敵に見つかることはありません。 このユニットが山や丘にいるときは、敵のユニットはこのユニットの隣にいる場合以外は、このユニットを見つけることはできません。このユニットを初めて見つけた敵ユニットは、それ以上移動することはできません。
pl: Górska Zasadzka: Jednostka potrafi się chować w górach i na wzgórzach. Wrogie oddziały nie mogą dostrzeć tej jednostki, kiedy stoi ona w górach lub na wzgórzach, ale tylko pod warunkiem, że obok tej jednostki nie stoją inne, również wrogie oddziały. Jeśli jakakolwiek jednostka przypadkiem natrafi na jednostkę ukrywającą się, traci wszystkie punkty ruchu.

source: Mountain Ambush: This unit can hide in forest, and remain undetected by its enemies. Enemy units cannot see this unit while it is in mountains or hills, except if they have units next to it. Any enemy unit that first discovers this unit immediately loses all its remaining movement.
it: Imboscata sui monti: L’unità è in grado di nascondersi nelle foreste, avendo la possibilità di non essere rilevata dai propri nemici. Le unità nemiche non possono vedere se è nascosta nelle montagne o nelle colline, a meno che non abbiano unità accanto. Qualsiasi nemico che scopre per primo l’unità perde immediatamente tutti i movimenti restanti.

source: fury
de: Amok
hu: őrjöngés
it: furia
pl: furia

source: Fury: This unit can attack another unit after killing an enemy.
de: Amok: Diese Einheit kann nach dem Töten ihres Gegners erneut angreifen.
hu: Őrjöngés: Ez az egység újra támadhat egy ellenséges egység megölése után.
it: Furia: L’unità attacca un’altra unità dopo aver ucciso un nemico.

source: FURY!
de: AMOK!
hu: ŐRÜLET!
it: FURIA!
ja: 激怒！
pl: FURIA!

source: furious death
de: Zorniger Tod
hu: tomboló halál
it: morte furiosa
pl: wściekła śmierć

source: Furious Death: Moments before this unit's death, it flies into a fury. The unit with this ability attacks all adjacent units and then it finally dies.
de: Zorniger Tod: In den letzten Augenblicken ihres Lebens verfällt diese Einheit in Raserei. Sie beschödigt alle angrenzenden Einheiten, bevor sie stirbt.
hu: Tomboló halál: Amikor ez az egység meghal, tombolni kezd. Utolsó erejével megtámad minden szomszédos egységet, mielőtt végleg kimúlna.
it: Morte furiosa: Prima di morire, l’unità scatena tutta la sua furia. L’unità con questa abilità attacca tutti i nemici nei pressi e poi finalmente muore.

source: battlefrenzy
de: Mordlust
hu: harcikedv
it: mania da battaglia
pl: szał bojowy

source: Battlefrenzy: When this attack is used, this units gets an extra strike and additional damage (+2) after each successful hit. Does not work on defense.
de: Mordlust: Mit jedem Treffer steigt der Schaden um 2 und die Schläge um 1. Funktioniert nur offensiv.
hu: Harcikedv: Amikor az egység ilyen támadást használ, egy plusz csapást mér és minden sikeres találat után egyre nagyobb sebzést(+2) okoz. Védekezésnél ez nem működik.
it: Mania da battaglia: Quando si usa questo attacco, l’unità riceve un colpo e un danno aggiuntivi (+2) dopo ogni colpo andato a segno. Non funziona in difesa.

source: Battlefrenzy: This unit gets one extra strike and additional damage (+2) with each hit during attack. Does not work on defense.
de: Mordlust: Mit jedem Treffer steigt der Schaden um 2 und die Schläge um 1. Funktioniert nur offensiv.
hu: Harcikedv: Amikor az egység ilyen támadást használ, egy plusz csapást mér és minden sikeres találat után egyre nagyobb sebzést(+2) okoz. Védekezésnél ez nem működik.
it: Mania da battaglia: L’unità riceve un colpo e un danno aggiuntivi (+2) a ogni colpo andato a segno, durante gli attacchi. Non funziona in difesa.

source: hard landing
de: Bruchlandung
hu: megsemmisítő vég
it: atterraggio duro

source: Hard Landing: When this large unit is destroyed, it falls on a ground dealing damage to all adjacent units.
it: Atterraggio duro: Quando questa grande unità viene distrutta, cade a terra causando danni a tutte le unità presenti nei pressi.

source: parachute
de: Fallschirm
hu: ejtőernyős
it: paracadute
pl: spadochron

source: Parachute: The pilot of this machine is equipped with parachute and he can survive a destruction of his vehicle.
de: Fallschirm: Der Pilot dieser Maschine verfügt über einen Fallschirm und kann so die Zerstörung seines Vehikels überleben.
hu: Ejtőernyős: Ennek a masinának a pilótája fel van szerelve ejtőernyővel, így túlélheti járművének megsemmisülését.
it: Paracadute: Il pilota di questa macchina è equipaggiato con un paracadute che permette di sopravvivere alla distruzione del proprio veicolo.

source: repairs +5
de: Reparatur +5
hu: javítás +5
it: ripara +5
pl: reperuje +5

source: Repairs +5: Allows the unit to repair adjacent friendly mechanical units at the beginning of each turn. A unit cared for by this healer may heal up to 5 HP per turn.
de: Reparatur +5: Diese Einheit repariert benachbarte freundliche Maschinen, wodurch fünf Lebenspunkte zurückgewonnen werden.
hu: Javítás +5: Az egység képes a mellette lévő baráti mechanikus egység javítására. A javított egység életereje legfeljebb 5 ÉP-vel nő körönként.
it: Ripara +5: All’inizio di ogni turno, abilità l’unità a riparare le unità amiche vicine di tipo meccanico. Un’unità curata dal guaritore può salire di 5 pf ad ogni turno.
ja: 修理 +5: このユニットはターン開始時に隣接した友好的な機械ユニットを修理することができます。 このユニットは毎ターン 5 HP 回復させることができます。
pl: Reperuje +5: Pozwala jednostce naprawiać sąsiednie mechaniczne jednostki na początku każdej tury. Jednostka naprawiona w ten sposób odzyskuje 5 punktów życia.

source: repairs +8
de: Reparatur +8
hu: javítás +8
it: ripara +8
pl: reperuje +8

source: Repairs +8: Allows the unit to repair adjacent friendly mechanical units at the beginning of each turn. A unit cared for by this healer may heal up to 8 HP per turn.
de: Reparatur +8: Diese Einheit repariert benachbarte freundliche Maschinen, wodurch acht Lebenspunkte zurückgewonnen werden.
hu: Javítás +8: Az egység képes a mellette lévő baráti mechanikus egység javítására. A javított egység életereje legfeljebb 8 ÉP-vel nő körönként.
it: Ripara +8: All’inizio di ogni turno, abilità l’unità a riparare le unità amiche vicine di tipo meccanico. Un’unità curata dal guaritore può salire di 8 pf ad ogni turno.
ja: 修理 +8: このユニットはターン開始時に隣接した友好的な機械ユニットを修理することができます。 このユニットは毎ターン 5 HP 回復させることができます。

source: Grenade: When this attack is used, all units adjacent to a target get damage. Does not work on defense.
de: Alle benachbarten Einheiten werden von diesem Angriff verletzt. Funktioniert nur offensiv.
hu: Gránát: Amikor ezt a támadást használják, minden szomszédos egység sebződik. Védekezés közben nem használható.
it: Granata: Quando si usa questo attacco, tutte le unità adiacenti al bersaglio ricevono dei danni. Non funziona in difesa.

source: rune aura
de: Runenaura
hu: rúnaaura
it: aura runica
pl: runiczna aura

source: Rune Aura: When this ability is activated, all Rune Masters create special auras. Adjacent units on hexes: s, ne, nw receive a 99% bonus to fire, cold and arcane resistance. Other units receive a −99% bonus to fire, cold and arcane resistance. The transformation lasts for one turn. Transformed unit cannot attack.
de: Runenaura: Wird diese Fähigkeit aktiviert, erzeugen alle Runologen für eine Runde (in der sie nicht handeln können) eine besondere Aura. Eine Einheit südlich, nordöstlich und -westlich eines Runologen erhält einen Bonus von 99% gegen die magischen Schadenstypen, die anderen Nachbarn erleiden eine Strafe gleicher Höhe.
hu: Rúnaaura: Amikor aktiválják ezt a képességet, a rúnamesterek egy speciális aurát kreálnak. A szomszédos déli, északkeleti, északnyugati mezőkön álló egységek 99% ellenállásra tesznek szert a tűz, a hideg és a földöntúli támadások ellen. A többi szomszédos egység -99% ellenállást szerez ugyanezen támadások ellen. Az átalakulás egy körig tart. Az átalakult egység nem támadhat.
it: Aura runica: Quando questa abilità è attivata, tutti i Maestri di Rune creano delle auree speciali. Le unità vicine agli esagoni (s, ne, no) ricevono un bonus di resistenza agli attacchi esoterici, al fuoco e al freddo pari al 99%. Le altre unità, invece, ricevono -99% contro questi tipi di attacco. La trasformazione dura un solo turno. Le unità trasformate non possono attaccare.

source: Activate Aura (24 Gold)
it: Attivare l’aura (24 oro)

source: Activate aura? (24 Gold)
it: Attivare l’aura (24 oro)

source: You don’t have enough gold to activate the rune aura!
de: Ihr habt nicht genug Gold, die Runenaura zu aktivieren!
hu: Nincs elég aranyad, hogy aktiváld a rúnaaurát!
it: Non hai abbastanza oro per attivare l’aura runica!

source: Rune Aura: Adjacent friendly units on hexes: s, ne, nw receive a 99% bonus to fire, cold and arcane resistance. Other units receive a −99% bonus to fire, cold and arcane resistance.
de: Runenaura: Angrenzende Verbündete in den Feldern S, NO und NW erhalten einen Bonus von 99% Resistenz gegen die magischen Schadenstypen. Alle anderen Einheiten erleiden dies als Malus.
hu: Rúnaaura: A déli, északkeleti és északnyugati mezőkön álló szomszédos baráti egységek ellenállása +99%-kal nő a tűz-, a hideg és a földöntúli támadások ellen. A többi egység ellenállása 99%-kal csökken ugyanezen támadások ellen.
it: Aura runica: Le unità vicine agli esagoni (s, ne, no) ricevono un bonus di resistenza agli attacchi esoterici, al fuoco e al freddo pari al 99%. Le altre unità ricevono un bonus di -99% contro questi tipi di attacco.

source: swallow +4
de: verschlingen
hu: bekebelezés +4
it: recupera +4
pl: połknięcie +4

source: Swallow +4: This unit gains 4 hitpoints added to its current health whenever it kills a living unit.
de: Verschlingen: Tötet diese Einheit eine lebende Einheit, heilt sie vier Lebenspunkte.
hu: Bekebelezés +4: Ez az egység 4 ép-vel növeli aktuális ép-jét valahányszor megöl egy élő egységet.
it: Recupera +4: L’unità guadagna 4 punti ferita ogni volta che uccide un’unità nemica vivente.
ja: 飲み込む +4: このユニットが生命をもつユニットを殺したとき、ヒットポイントが 4回復します。
pl: Połknięcie +4: Ta jednostka odzyskuje 4 punkty życia za każdym razem kiedy zabija żywą jednostkę.

source: swamp ambush
de: Sumpfkrieger
hu: mocsári rajtaütés
it: imboscata nelle paludi
ja: 伏兵（沼地）
pl: bagienna zasadzka

source: Swamp Ambush: This unit can hide in swamp, and remain undetected by its enemies. Enemy units cannot see this unit while it is in swamp, except if they have units next to it. Any enemy unit that first discovers this unit immediately loses all its remaining movement.
de: Moorwanderer: Diese Einhand kann sich in Sümpfen verstecken. Feindliche Einheiten können diese Einheit nicht sehen oder angreifen, wenn sie sich in einem Sumpf aufhält, außer wenn sich eine feindliche Einheit auf einem angrenzenden Feld befindet, oder direkt nachdem die Einheit selbst angegriffen hat.
hu: Mocsári rajtaütés: Ez az egység képes elrejtőzni a mocsárban, ezáltal ellenségei számára láthatatlanná válik. Az ellenséges egységek nem látják ezt az egységet, míg mocsárban áll, kivéve ha mellélépnek. Az első ellenséges egység, amely felderíti ennek az egységnek a helyzetét, elveszti a mozgáspontjait.
it: Imboscata nelle paludi: L’unità è in grado di nascondersi nelle paludi, avendo la possibilità di non essere rilevata dai propri nemici. Le unità nemiche non possono vedere se è nascosta nelle paludi, a meno che non abbiano unità accanto. Qualsiasi nemico che scopre per primo l’unità perde immediatamente tutti i movimenti restanti.
ja: 伏兵（沼地）: このユニットは沼地に隠れることができます。そのため、沼地にいれば敵に見つかることはありません。 このユニットが沼地にいるときは、敵のユニットはこのユニットの隣にいる場合以外は、このユニットを見つけることはできません。このユニットを初めて見つけた敵ユニットは、それ以上移動することはできません。
pl: Bagienna Zasadzka: Jednostka potrafi się chować w na bagnach. Wrogie oddziały nie mogą dostrzeć tej jednostki, kiedy stoi ona wbagnie, ale tylko pod warunkiem, że obok tej jednostki nie stoją inne, również wrogie oddziały. Jeśli jakakolwiek jednostka przypadkiem natrafi na jednostkę ukrywającą się, traci wszystkie punkty ruchu.

source: Swamp Ambush: This unit can hide in forest, and remain undetected by its enemies. Enemy units cannot see this unit while it is in swamp, except if they have units next to it. Any enemy unit that first discovers this unit immediately loses all its remaining movement.
it: Imboscata nelle paludi: L’unità è in grado di nascondersi nelle foreste, avendo la possibilità di non essere rilevata dai propri nemici. Le unità nemiche non possono vedere se è nascosta nelle paludi, a meno che non abbiano unità accanto. Qualsiasi nemico che scopre per primo l’unità perde immediatamente tutti i movimenti restanti.

source: water ambush
de: Schwimmender Lauerer
hu: vízi rajtaütés
it: imboscata in acqua
ja: 伏兵（水）
pl: Wodna Zasadzka

source: Water Ambush: This unit can hide in water, and remain undetected by its enemies. Enemy units cannot see this unit while it is in water, except if they have units next to it. Any enemy unit that first discovers this unit immediately loses all its remaining movement.
it: Imboscata in acqua: L’unità è in grado di nascondersi in acqua, avendo la possibilità di non essere rilevata dai propri nemici. Le unità nemiche non possono vedere questa unità mentre è in acqua, a meno che non abbiano unità accanto. Qualsiasi nemico che scopre per primo l’unità perde immediatamente tutti i movimenti restanti.

source: Water Ambush: This unit can hide in forest, and remain undetected by its enemies. Enemy units cannot see this unit while it is in water, except if they have units next to it. Any enemy unit that first discovers this unit immediately loses all its remaining movement.
it: Imboscata in acqua: L’unità è in grado di nascondersi nelle foreste, avendo la possibilità di non essere rilevata dai propri nemici. Le unità nemiche non possono vedere se è nascosta in acqua, a meno che non abbiano unità accanto. Qualsiasi nemico che scopre per primo l’unità perde immediatamente tutti i movimenti restanti.

source: cave ambush
de: Höhlenkunde
hu: barlangi rajtaütés
it: imboscata nelle caverne
ja: 伏兵（洞窟）
pl: Jaskiniowa Zasadzka

source: Cave Ambush: This unit can hide in cave, and remain undetected by its enemies. Enemy units cannot see this unit while it is in cave, except if they have units next to it. Any enemy unit that first discovers this unit immediately loses all its remaining movement.
de: Höhlekunde: Diese Einhand kann sich in Höhlen verstecken Feindliche Einheiten können diese Einheit nicht sehen oder angreifen, wenn sie sich in einer Höhle aufhält, außer wenn sich eine feindliche Einheit auf einem angrenzenden Feld befindet, oder direkt nachdem die Einheit selbst angegriffen hat.
hu: Barlangi rajtaütés: Ez az egység képes elrejtőzni a barlangban, ezáltal ellenségei számára láthatatlanná válik. Az ellenséges egységek nem látják ezt az egységet, míg barlangban áll, kivéve ha mellélépnek. Az első ellenséges egység, amely felderíti ennek az egységnek a helyzetét, elveszti a mozgáspontjait.
it: Imboscata nelle caverne: L’unità è in grado di nascondersi nelle caverne, avendo la possibilità di non essere rilevata dai propri nemici. Le unità nemiche non possono vedere se è nascosta nelle caverne, a meno che non abbiano unità accanto. Qualsiasi nemico che scopre per primo l’unità perde immediatamente tutti i movimenti restanti.
ja: 伏兵（洞窟）: このユニットは洞窟に隠れることができます。そのため、洞窟にいれば敵に見つかることはありません。 このユニットが洞窟にいるときは、敵のユニットはこのユニットの隣にいる場合以外は、このユニットを見つけることはできません。このユニットを初めて見つけた敵ユニットは、それ以上移動することはできません。
pl: Jaskiniowa Zasadzka: Jednostka potrafi się chować w jaskiniach. Wrogie oddziały nie mogą dostrzeć tej jednostki, kiedy stoi ona w tunelach jaskiń, ale tylko pod warunkiem, że obok tej jednostki nie stoją inne, również wrogie oddziały. Jeśli jakakolwiek jednostka przypadkiem natrafi na jednostkę ukrywającą się, traci wszystkie punkty ruchu.
