Repository: wescamp/Era_of_Magic-1.10
Catalog: po/*.po
Languages: de, hu, it, ja, pl

source: To summon a unit right-click on adjacent hexes near a selected summoner. You need all movement points (and remaining attacks) to summon one creature. You are unable to summon from castles or keeps. A new unit can’t be summoned on water. Every summoning adds +4 to current experience. If there are 2 or more summoners, a new unit will be summoned by the last selected unit able to summon.
de: Um eine Einheit zu beschwören, klickt mit recht auf Felder neben dem ausgewählten Beschwörer. Ihr verbraucht beim Beschwören alle Bewegungspunkte (und verbleibenen Angriffe). Ihr könnt nicht von Burgen aus beschwören und nicht ins Wasser oder in Dörfer. Jede Beschwörung bringt vier Erfahrungspunkte. Sind zwei oder mehr Beschwörer verfügbar, wird die neue Einheit von zur Beschwörung fähigen Einheit beschworen, die als letzte ausgewählt war.
hu: Egy egység megidézéséhez jobbklikk a választott varázsló melleti mezőre. Minden mozgáspontra szükség van (s támadási lehetőségre is) egy egység megidézéséhez. Kastélyban, erődben nem lehet megidézni. Vízre sem lehet lényt megidézni. Minden megidézés +4 TP-növekedéssel jár. Ha két vagy több varázsló is képes megidézni az adott mezőre, akkor az utoljára kiválasztott varázsló fogja megidézni a lényt.
it: Per evocare un’unità basta clickare col mouse destro negli esagoni vicini all’evocatore selezionato. Hai bisogno di tutti i punti mossa (e attacchi restanti) per evocare una creatura. Non puoi evocare nei castelli, nei villaggi e in acqua. Ogni evocazione aggiunge +4 punti all’esperienza attuale. Se ci sono 2 o più evocatori, una nuova unità verrà evocata dall’ultima unità evocatrice selezionata.

source: summon
de: Beschwörung
hu: megidézés
it: evocazione
pl: przywołanie

source: Summon: this unit can summon new units near him, but not in villages.
de: Beschwörung: Diese Einheit kann andere Einheiten in benachbarten freien Feldern erschaffen, aber nicht in Dörfern.
hu: Megidézés: ez az egység képes új lényeket megidézni a mellette álló mezőre, kivéve falvakba.
it: Evocazione: l’unità può evocare nuove unità attorno a lui, ma non nei villaggi.
ja: 召喚: このユニットは、自身の近くに新しいユニットを召喚することができます。ただし、村には召喚できません。
pl: Przywołanie: ta jednostka może przywoływać w swoim pobliżu inne jednostki, ale nie może robić tego we wioskach.

source: Summon Fire Elemental (15 Gold)
de: Beschwöre einen Feuergeist (15 G)
it: Evoca elementale di fuoco (15 oro)

source: Summon Water Elemental (16 Gold)
de: Beschwöre einen Wassergeist (16 G)
it: Evoca elementale d’acqua (16 oro)

source: this unit can create other units in the near free spaces, but not in villages.
de: Diese Einheit kann andere Einheiten in benachbarten freien Feldern erschaffen, aber nicht in Dörfern.
hu: ez az egység megidézhet más egységeket egy szmszédos szabad mezőre, ami nem falu.
it: l’unità può creare altre unità nei spazi liberi vicini, ma non può farlo nei villaggi.
ja: このユニットは自身の近くの 村以外の空いている場所に別のユニットを創り出すことができます。
pl: ta jednostka może tworzyć inne jednostki w pobliskich pustych heksach, ale nie we wioskach.

source: Summon Fire Elemental (7 Gold)
de: Beschwöre einen Feuergeist (7 G)
it: Evoca elementale di fuoco (7 oro)

source: Summon Water Elemental (7 Gold)
de: Beschwöre einen Wassergeist (7 G)
it: Evoca elementale d’acqua (7 oro)

source: Summon Air Elemental (8 Gold)
de: Beschwöre einen Luftgeist (8 G)
it: Evoca elementale d’aria (8 oro)

source: Summon Earth Elemental (8 Gold)
de: Beschwöre einen Erdgeist (8 G)
it: Evoca elementale di terra (8 oro)

source: Summon Rhami (12 Gold)
de: Beschwöre eine Rhami (12 G)
it: Evoca rhami (12 oro)

source: Summon Jinn (14 Gold)
de: Beschwöre einen Dschinn (14 G)
it: Evoca genio (14 oro)

source: Summon Fire Elemental (12 Gold)
de: Beschwöre einen Feuergeist (12 G)
it: Evoca elementale di fuoco (12 oro)

source: Summon Water Elemental (12 Gold)
de: Beschwöre einen Wassergeist (12 G)
it: Evoca elementale d’acqua (12 oro)

source: Summon Air Elemental (16 Gold)
de: Beschwöre einen Luftgeist (16 G)
it: Evoca elementale d’aria (16 oro)

source: Summon Golem (16 Gold)
de: Beschwöre einen Golem (16 G)
it: Evoca golem (16 oro)

source: summon roc
de: Rokh herbeirufen
hu: rokmadár megidézése
it: evoca roc
pl: przyzwanie roka

source: Summon Roc: this unit can summon new units near him, but not in villages.
de: Rokh herbeirufen: Diese Einheit ruft eine neue Einheit neben ihr, aber nicht in Dörfern.
hu: Rokmadár megidézése: ez az egység a szomszédos mezőre, ami nem falu, megidézhet egy új egységet.
it: Evoca roc: l’unità può evocare nuove unità vicine a lui, ma non nei villaggi.
ja: ロックの召喚: このユニットは自身の近くの 村以外の空いている場所に別のユニットを召喚することができます。
pl: Przyzwanie Roka: ta jednostka może przyzwać inne w swoim pobliżu, ale nie we wioskach.

source: Summon Roc Rider (22 Gold)
de: Rokhreiter herbeirufen (22 G)
it: Evoca cavalcatore di roc (22 oro)

source: magical
de: magisch
hu: mágikus lény
it: magico
ja: 魔法生物
pl: magiczny

source: female^magical
de: magisch
hu: mágikus lény
it: magica
ja: 魔法生物
pl: magiczna

source: Era of Magic RPG
hu: Mágikus kor SZJ
ja: 魔法の時代 RPG
pl: Era Magii RPG

source: Era of Magic Masters
hu: Mágikus kor mesteri szint
pl: Era Magii Mistrzowie

source: Default + Magic
hu: Alap+Mágikus

source: Heroes + Magic
hu: Hősök+Mágikus

source: bolas
hu: bola
ja: ボーラ
pl: bole

source: Goblin Kamikaze
de: Kamikaze-Kobold
hu: Kobold kamikázé
ja: ゴブリンの特攻隊

source: chakram
hu: csakram
ja: チャクラム
pl: czakram

source: Beam: When this attack is used, the attacker can hurt a unit behind his primary target.
hu: Fénykéve: Ha ezzel támadnak meg egy egységet, akkor a mögötte álló egység is sebződik.
pl: Promień: Kiedy ten atak jest użyty, atakujący może razić jednostkę stojącą za swoim głównym celem.

source: Golem
hu: Gólem
ja: ゴーレム

source: Guru
hu: Mester
ja: 導師

source: inferno
de: Feuersbrunst
hu: pokoli tűz
ja: 猛火

source: Efreet
de: Afrit
hu: Ifrit
pl: Ifryt

source: waterhome
hu: vízlakó
ja: 水に住むもの
pl: wodny

source: waterhome: This unit is made of water. If it stands in water, it will receive 6 hp.
hu: vízlakó: Ez az egység vízből áll. Ha vízi terepen áll, 6 ÉP-t gyógyul.
ja: 水に住むもの: このユニットは水から作られました。そのため、水の中ではヒットポイントが 6 回復します。
pl: Zbudowany z wody: Ta jednostka składa się całkowicie z wody. Dlatego jeśli stoi w wodzie oddzyskuje siły (6hp na turę)

source: lavahome
hu: lávalakó
ja: 溶岩に住むもの
pl: ognisty

source: lavahome: This unit is made of fire. If it stands in lava, it will receive 6 hp.
hu: lávalakó: Ez az egység tűzből áll. Ha lávaterepen áll, 6 ÉP-t gyógyul.

source: megacircle: This unit owns powerful magic circle which affects all units inside. All friendly units fight better (+125%, +100%, +75%, +50%, +25% — lvl 0, 1, 2, 3, 4) and regenerate themselves.
hu: bűvkör: Ez az egység egy mágikus kisugárzással bír, amely a szomszédos egységekre hatást gyakorol. A baráti egységek jobban harcolnak (+125%, +100%, +75% +50%, +25% - 0, 1, 2, 3, 4 szintű) és regenerálódnak.

source: always hits: This attack always has a 100% chance to hit
hu: mindig talál: Ez a támadás 100% eséllyel talál.
ja: 必中: この攻撃は常に 100% の確率で命中します。
pl: zawsze trafia: Atak ten ma zawsze 100% szansy na trafienie.

source: no counter-attack: The opponent has always a 0% chance to hit, when this unit is attacking.
hu: nincs ellentámadás: Az ellenséges egységnek esélye sincs, hogy ellentámadása sikerrel jár.
ja: 反撃封じ: このユニットが攻撃したとき、対象は反撃することができません。
pl: brak kontrataku: Przeciwnik nie odpowiada będąc zaatakowanym przez tę jednostkę.

source: evasion: When this attack is used offensively, this unit takes one third less damage in retaliation.
hu: gyengítés: When this attack is used offensively, this unit takes one third less damage in retaliation.
pl: Unik: Kiedy ten atak użyty jest ofensywnie, jednostka otrzymuje o 1/3 mniej obrażeń przy kontrataku przeciwnika.

source: precision: This attack always has a 80% chance to hit
hu: precizitás: Ez a támadás mindig 80% eséllyel talál
ja: 精度: この攻撃は常に 80% の確率で命中します。
pl: precyzja: Atak ten ma zawsze 80% szansy na trafienie.

source: revenge: The unit has 100% hitting chance during retalitation.
hu: bosszú: Ez az egység mindig 100% eséllyel talál visszatámadáskor.

source: Ambush: This unit can hide in forest, and remain undetected by its enemies. Enemy units cannot see this unit while it is in mountains or hills, except if they have units next to it. Any enemy unit that first discovers this unit immediately loses all its remaining movement.
hu: Rajtaütés: Ez az egység elrejtőzhet az erdőben, s ezáltal ellenségei számára láthatatlanná válik. Az ellenséges egységek nem látják ezt az egységet, míg erdőben áll, kivéve ha mellélépnek. Az első ellenséges egység, amely felderíti ennek az egységnek a helyzetét, elveszti a mozgáspontjait.
pl: Zasadzka: Jednostka potrafi się chować w lasach. Wrogie oddziały nie mogą dostrzeć tej jednostki, kiedy stoi ona w lasach, ale tylko pod warunkiem, że obok tej jednostki nie stoją inne, również wrogie oddziały. Jeśli jakakolwiek jednostka przypadkiem natrafi na jednostkę ukrywającą się, traci wszystkie punkty ruchu.

source: Hard landing: When this large unit is destroyed, it falls on a ground dealing damage to all adjacent units.
hu: Megsemmisítő vég: Amikor ez az egység meghal, a szomszédos egységeknek is sebzést okoz.

source: Activate Aura (24g)
hu: Aura aktiválása (24a)
pl: Aktywuj Aurę (24g)

source: Activate aura? (cost: 24g)
hu: Aktiválod az aurát? (költsége: 24a)
pl: Aktywować aurę? (koszt: 24g)

source: Ambush: This unit can hide in forest, and remain undetected by its enemies. Enemy units cannot see this unit while it is in swamp, except if they have units next to it. Any enemy unit that first discovers this unit immediately loses all its remaining movement.
hu: Rajtaütés: Ez az egység a mocsárban képes elrejtőzni, s így ellenségei számára láthatatlanná válik. Az ellenséges egységek nem látják ezt az egységet, míg mocsárban áll, kivéve ha mellélépnek. Az első ellenséges egység, amely felderíti ennek az egységnek a helyzetét, elveszti a mozgáspontjait.
pl: Zasadzka: Jednostka potrafi się chować w lasach. Wrogie oddziały nie mogą dostrzeć tej jednostki, kiedy stoi ona w lesie, ale tylko pod warunkiem, że obok tej jednostki nie stoją inne, również wrogie oddziały. Jeśli jakakolwiek jednostka przypadkiem natrafi na jednostkę ukrywającą się, traci wszystkie punkty ruchu.

source: water ambush: This unit can hide in water, and remain undetected by its enemies. Enemy units cannot see this unit while it is in water, except if they have units next to it. Any enemy unit that first discovers this unit immediately loses all its remaining movement.
hu: Vízi rajtaütés: Ez az egység a vízben képes elrejtőzni, s így ellenségei számára láthatatlanná válik. Az ellenséges egységek nem látják ezt az egységet, míg vízben áll, kivéve ha mellélépnek. Az első ellenséges egység, amely felderíti ennek az egységnek a helyzetét, elveszti a mozgáspontjait.

source: Ambush: This unit can hide in forest, and remain undetected by its enemies. Enemy units cannot see this unit while it is in water, except if they have units next to it. Any enemy unit that first discovers this unit immediately loses all its remaining movement.
hu: Rajtaütés: Ez az egység a vízben képes elrejtőzni, s így ellenségei számára láthatatlanná válik. Az ellenséges egységek nem látják ezt az egységet, míg vízben áll, kivéve ha mellélépnek. Az első ellenséges egység, amely felderíti ennek az egységnek a helyzetét, elveszti a mozgáspontjait.
pl: Zasadzka: Jednostka potrafi się chować w lasach. Wrogie oddziały nie mogą dostrzeć tej jednostki, kiedy stoi ona w lesie, ale tylko pod warunkiem, że obok tej jednostki nie stoją inne, również wrogie oddziały. Jeśli jakakolwiek jednostka przypadkiem natrafi na jednostkę ukrywającą się, traci wszystkie punkty ruchu.

source: Ambush: This unit can hide in forest, and remain undetected by its enemies. Enemy units cannot see this unit while it is in cave, except if they have units next to it. Any enemy unit that first discovers this unit immediately loses all its remaining movement.
hu: Rajtaütés: Ez az egység elrejtőzhet az erdőben, s ezáltal ellenségei számára láthatatlanná válik. Az ellenséges egységek nem látják ezt az egységet, míg erdőben áll, kivéve ha mellélépnek. Az első ellenséges egység, amely felderíti ennek az egységnek a helyzetét, elveszti a mozgáspontjait.
pl: Zasadzka: Jednostka potrafi się chować w lasach. Wrogie oddziały nie mogą dostrzeć tej jednostki, kiedy stoi ona w lesie, ale tylko pod warunkiem, że obok tej jednostki nie stoją inne, również wrogie oddziały. Jeśli jakakolwiek jednostka przypadkiem natrafi na jednostkę ukrywającą się, traci wszystkie punkty ruchu.

source: Awaken: If a friendly adjacent unit with more than one hitpoint at the beginning of the battle dies, it is resurrected, gets +6 experience and remains in battle with one hitpoint. If it dies again (having one hitpoint), it will be killed for sure.
hu: Visszahívás: ha egy szomszédos baráti egység, amelynek 1-nél több ÉP-je van, meghal, akkor az 1 ép-vel visszatér, 6 TP-t kap, s tovább harcol. Ha újra meghal (1 ép-vel), akkor végleg eltávozik az élők közül.

source: banish: If a Banisher hits an enemy magical unit, the enemy will turn into a DG ‘Dimensional Gate’, (this happens only if the target is exactly one level below the banisher). If the enemy is at least two levels below your banisher, it’ll get completely destroyed. Any other enemy won’t be affected.
hu: irtás: Ha egy szellemirtó megüt egy mágikus lényt, az átalakul dk-vá ‘dimenziókapuvá’, (ez csak akkor történik meg, ha a célpont egy szinttel a támadó szintje alatt van). Ha a megtámadott egység legalább két szinttel a támadó alatt van, akkor teljesen megsemmisül. Más ellenséges egység esetén nem történik semmi.

source: circle of banishment: This unit can affect enemy magical units that are next to it, making them fight worse. Adjacent enemy magical units of lower level will do less damage in battle. When a unit adjacent to, of the same level, or a lower level than, and is an enemy of the unit with Circle of Banishment engages in combat, its attacks do less damage (−40% lvl0, −30% lvl1, −15% lvl2, −10% lvl3).
hu: irtókör: Az egység köre csökkenti a szomszédos mágikus ellenséges egység erejét, s az gyengébben harcol. A szomszédos alacsonyabb szintű ellenséges mágikus egység kisebbet sebez a csatában. Ha a szomszédos mezőn álló egység az irtókörös egység ellensége, s azonos vagy nála alacsonyabb szintű, akkor sebzése a szintjétől függően csökken (-40% 0-s szinten, -30% 1-s szinten, -15% 2-s szinten, -10% 3-s szinten).

source: +$this_unit.level exp
de: +$this_unit.level Erfahrung
hu: +$this_unit.level TP
ja: 経験値 $this_unit.level 獲得

source: Double attack!
ja: 2回攻撃！
pl: Podwójny atak!

source: Default+Magic
pl: Domyślna+Magii

source: Heroes+Magic
pl: Bohaterowie+Magii

source: Cumbersome and lacking fine intellect the Cyclop race had been driven near to extinction before becoming a part of the barbarian horde. Two centuries later and these lumbering beasts have flourished, growing in both strength and number. Some say that it was a strange magic which bound the Cyclops to their new allegiance and is perhaps a reason for their increased power. One thing about these beasts is a certainty, when facing one in combat it is best not to get hit.
pl: Toporna i mało inteligentna rasa Cyklopów o mało nie wymarła przed przyłączeniem się do barbarzyńskich hord. Dwieście lat później te ciężko stąpające bestie ponownie urosły w liczbie i sile. Niektórzy mówią, że to na skutek działania jakiejś dziwnej magii, która uczyniła z Cyklopów istoty bardziej pokorne niż wcześniej i która jednocześnie zwiększyła ich wytrzymałość. Jedno jest pewne: jeśli mierzysz się w walce z jednym z nich, lepiej żebyś nie oberwał.

source: hatchet
ja: 手斧
pl: siekierka

source: Savage and warlike Orcs form the back bone of the Barbarian hordes. Orc society is ill-suited to large-scale warfare, which leaves their small tribes at prey to the more organised might of the world's various armies. However in the last two centuries something has changed. Orcs now fight with Cyclops, Trolls, Rocs and goblins side by side whether it be in brutal hunting packs or full blown armies. The origins of this change are unknown but one thing is sure, when the barbarian hordes come screaming for your blood the Orcs will be leading the charge.
pl: Dzikie i skore do walk Orki, trzon barbarzyńskich hord. Społeczeństwo orków jest nieprzystosowane do prowadzenia działań wojennych na wielką skalę, przez co ich małe plemiona są łatwym kąskiem dla bardziej zorganizowanych armii. Jednak w ostatnich dwustu latach coś się zmieniło. Orki walczą ramię w ramię z Cyklopami, Trolami, Rokami i Goblinami, czy to w brutalnych starciach myśliwych, czy też w pełnowymiarowych armiach. Źródło tej przemiany jest nieznane, choć jedno wiadomo na pewno: jeśli kiedykolwiek barbarzyńskie hordy przyjdą spragnione twojej krwi, Orkowie będą im przewodzić.

source: spear
ja: 槍
pl: włócznia

source: crossbow x2
ja: クロスボウ x2
pl: kusza x2

source: Second target!
pl: Drugi cel!

source: claws
ja: かぎ爪
pl: pazury

source: Abyss Mage
ja: 深淵の魔術師
pl: Mag Ciemności

source: Mage of air
ja: 風の魔術師
pl: Mag Powietrza

source: Mage of fire
ja: 火の魔術師
pl: Mag Ognia

source: Mage of water
ja: 水の魔術師
pl: Mag Wody

source: icecles
ja: 氷弾
pl: sople lodu

source: Subversive mage
ja: 破壊の魔術師
pl: Mag Dywersyjny

source: Special Notes:
ja: 特記事項:
pl: Młode kobiety wywodzące się ze wszystkich warstw społecznych Kharosan, które wstąpiły na służbę w świątyniach. Strzegą tam tajemnic wykorzystywania energii promienia - fragmentu tajemniczego artefaktu odkrytego niegdyś przez najdalszych przodków i założycieli państwa Kharosan. Moce te są najściślej strzeżonym sekretem kraju, ponieważ na nich opiera się cała magia kapłanek, strażników oraz mistrzów słońca. Zgłębienie tych tajemnic przez wroga miałoby katastrofalne konsekwencje. Dlatego służki świątyń widywane są przez lud rzadko, jedynie podczas ceremonii religijnych i świąt państwowych. Kapłanki przez częste obcowanie z mocą nabierają zdolności do władania magią światła, w miarę możności pogłębianych w nich i szlifowanych. Poznają także podstawowe umiejętności leczenia. Towarzyszą armii jako głównie jako uzdrowicielki, ale ich umiejętności władania magią często przydają się także w ofensywie.

source: This unit is less effective than white mage but it can perform more magical attacks. The Cleric heals and leads other units. Special Notes:
pl: Przełożone świątyń, kapłanki wysokiego stopnia. Aby dojść do godności kleryczki, adeptki światła służyć muszą słońcu przez wiele lat z niezachwianą lojalnością i poświęceniem, trudząc się nieustannie dla dobra ludu Kharos. Zasługi jednak takie nie pozostają bez nagrody. Wysoko postawione w hierarchii kapłanki prócz tego, że darzone są ogromnym poważaniem przez wszystkich Kharosan, zgłębiają także wiele sekretów mocy, której służą. Dzięki temu ich magia ulega znacznemu wzmocnieniu. Ich mocną stroną jest także lecznictwo, należą bowiem do najbieglejszych uzdrowicielek na planecie. Kleryczki opiekują się całą kulturą, oświatą, sztuką w Kharos. Prócz tego, pełnią ważną rolę polityczną, posiadając ogromne wpływy i znaczenie w całym państwie. Kleryczki nie są wojowniczkami w żadnym razie, ale są dla armii Kharos nieprzeciętną pomocą. --Poliuks Uwagi Specjalne:

source: Mistress of Light is an extremely powerful healer. All friendly units near her recive 12hp. She flies and illuminates. Special Notes: Ultracures: A unit cared for by this healer may heal up to 12 HP per turn.
pl: Kapłanki, których całe jestestwo zostało napełnione światłem, przenikającym je i objawiającym się w otaczającej je niezwykłej aurze. Tylko nieliczne dostępują tego zaszczytu; wybiera je promień. Corocznie kandydatki ze wszystkich świątyń udają się do wielkiej świątyni, gdzie przechowywany jest ten starożytny artefakt, i kładą na nim rękę; wybrane w tej samej chwili ogarnia oślepiający blask. Mistrzyni światła pojawia się jednak bardzo rzadko, przeciętnie raz na trzydzieści lat. Wybrane pędzą odludny żywot w wielkiej świątyni, jako kapłanki najbardziej związane z promieniem. Są najlepszymi uzdrowicielkami na świecie; mało jest schorzeń czy ran, których mocą światłą nie zdołałyby wyleczyć. Niewiele jest istot na świecie rozporządzających mocą zdolną całkowicie unicestwić mistrzynie światła; tylko władcy mroku mogą zniszczyć ich duszę i moc. Obecność ich w bitwie świadczy o najwyższej konieczności; lecz ich magia ma także aspekt niszczycielski. Mówiąc wprost, biada każdemu ich wrogom. --Poliuks Uwagi Specjalne: Ultrauzdrowienie: Jednostka leczona przez tego uzdrowiciela może odzyskać aż do 12 punktów życia na turę.

source: . Special Notes:
ja: . 特記事項:
pl: Najwyższa godność w hierarchii świątyń Kharos. Wieszczki należą do najbardziej zasłużonych kapłanek. Pełnią one służbę bądź w stolicy, bądź w największych miastach. Darzone są ogromnym szacunkiem przez wszystkie stany społeczne, wobec czego ich rola polityczna jest ogromna. Wieszczki mają prawo, pod warunkiem uzyskania jednomyślności, zrzucić władcę z tronu lub nie dopuścić do jego koronacji, mając przy tym poparcie całej straży świątynnej oraz ludu; do tej ostateczności doszło jednak w dziejach Kharos tylko cztery razy. W związku z tym przywilejem każdy król stara się żyć w nimi w zgodzie, a wieszczki uzyskały ogromne prawa dla siebie i świątyń. Choć we władaniu magią nie dorównują mistrzyniom światła, ich biegłość w tym kierunku jest wielka, a ich umiejętności dowódcze bardzo przydają się armii. --Poliuks Uwagi Specjalne:

source: The Sun Guardian is more powerful than Follower. Being so strong, he is chosen to protect the most important shrines in the Kharos country (50% reduction in spell damage).
pl: Stu osiemdziesięciu najwyższych rangą i najpotężniejszych z wyznawców słońca. Stu czterdziestu czterech rozmieszczonych jest w dwunastu głównych świątyniach Kharos; pozostali stanowią gwardię wielkiej świątyni w stolicy. Strażnicy słońca dysponują mocami nieznanymi większości istot na świecie. Prócz wielkiej siły fizycznej, dysponują olbrzymią energią magiczną, którą nauczyli się swobodnie rozporządzać. Wzmocnili swoją tarczę mentalną, w związku z czym trzeba czarodzieja o nie lada umiejętnościach, by zdołał stawić im czoła. Potrafią także koncentrować promienie słońca wokół wrogów, paląc ich żywcem. Strażnicy nie potrzebują naturalnego pokarmu; jedynym, czym się żywią, jest energia słoneczna. Strażnicy słońca wyruszają na wojnę jedynie w ostatecznej potrzebie, lecz połączenie ich zdolności walki magią i orężem sprawia, że często są siłą rozstrzygającą walkę. --Poliuks

source: Master of Sun attacks in a twinkle of an eye, so enemy can't succesfully defend himself. This amazing unit releases huge amounts of sun energy in one point. This ability allows him to focus the sun rays 6 times on a target.
pl: Mistrzowie słońca pod niemalże każdym względem są całkowicie wyjątkowi. Ciężko nawet dociekać ich związków z tajemniczym zakonem bo wszędzie gdzie uderzają, robią to sami. Mimo to, dla ułatwienia, ludzie uważają, iż wywodzą się oni ze złotych wojowników którzy osiągnęli całkowity szczyt swoich możliwości. Na polu bitwy rządzą oni niepomiernie, uderzając z taką szybkością oraz siłą, że przeciwnik nie ma żadnych szans nawet na spróbowanie wykonania uniku. Nie dość tego, to nikt się ich nie spodziewa. Niejednokrotnie siły Kharosu przegrywają kiedy nagle znikąd zwala się na szeregi wroga Mistrz Słońca czyniąc spustoszenie a zaraz potem znikając równie szybko jak się pojawił. Nikt nigdy nie prosi o ich pomoc, oni sami wiedzą najlepiej kiedy użyczyć swych talentów. Strzeżcie się, wrogowie Kharosu, blasku słońca, ponieważ to on właśnie niesie zgubę... --barowei

source: sword
ja: 剣
pl: miecz
