Repository: wescamp/Era_of_Magic-1.10
Catalog: po/*.po
Languages: de, hu, it, ja, pl

source: Cave Ambush: This unit can hide in forest, and remain undetected by its enemies. Enemy units cannot see this unit while it is in cave, except if they have units next to it. Any enemy unit that first discovers this unit immediately loses all its remaining movement.
it: Imboscata nelle caverne: L’unità è in grado di nascondersi nelle foreste, avendo la possibilità di non essere rilevata dai propri nemici. Le unità nemiche non possono vedere questa unità mentre è nelle caverne, a meno che non abbiano unità accanto. Qualsiasi nemico che scopre per primo l’unità perde immediatamente tutti i movimenti restanti.

source: regenerates +4
de: Schwächere Regeneration
hu: felfrissülés +4
it: rigenera +4
ja: 再生 +4
pl: regeneruje się +4

source: Regenerates +4: At the beginning of each turn this unit heals +4 hp. If it is poisoned, it will remove it instead of healing.
de: Schwächere Regeneration: Diese Einheit heilt jede Runde um vier Lebenspunkte oder erholt sich von einer Vergiftung.
hu: felfrissülés +4: Minden kör elején az egység 4 ép-t gyógyul. Ha mérgezett, akkor gyógyulás helyett kikúrálódik a mérgezésből.
it: Rigenera +4: All’inizio di ogni turno, questa unità riceve +4 pf. Se è avvelenata, guarirà dal veleno invece di ricevere i punti.

source: awaken
de: Erweckung
hu: visszahívás
it: risvegliato
pl: wskrzesza

source: Awaken: If a friendly adjacent unit with more than one hitpoint at the beginning of the battle dies, it is resurrected, gets +6 experience and remains in battle with one hitpoint. If it dies again (having one hitpoint), it will be killed for sure. Doesn't work on units attacked with a weapon which has the 'cleave' weapon special.
it: Risvegliato: Se un’unità amica vicina con più di un punto ferita muore all’inizio della battaglia verrà resuscitata, ricevendo +6 punti esperienza e rimanendo in battaglia con un solo punto ferita. Se muore di nuovo (avendo un punto ferita) non potrà più resuscitare. Non funziona con unità attaccate con un’arma che abbia l’abilità speciale “fendente”.

source: female^awoken
de: erweckt
hu: visszahívott
it: risvegliata
pl: wskrzesza

source: awoken
de: erweckt
hu: visszahívott
it: risvegliato
pl: wskrzeszony

source: heals +2
de: Heilung 2
hu: gyógyítás +2
it: guarisce +2
pl: leczy +2

source: Heals +2: Allows the unit to heal adjacent friendly units at the beginning of each turn. A unit cared for by this healer may heal up to 2 HP per turn.
de: Heilung +2: Diese Einheit kann jede Runde benachbarte verbündete Einheiten um 2 Lebenspunkte heilen.
hu: Gyógyítás +2: Minden kör elején gyógyít a szomszédos baráti egységen. A gyógyított egység legfeljebb 2 ÉP-t gyógyul körönként a beavatkozás hatására.
it: Guarisce +2: Attiva l’abilità di curare le unità amiche vicine all’inizio di ogni turno. Un’unità curata dal guaritore guadagna 2 pf ad ogni turno.
ja: 回復 +2: このユニットは隣接した友好的なユニットをターン開始時に回復させます。 このユニットに治療されるユニットは 1 ターンに最大でHPが 2 回復します。
pl: Leczy +2: Pozwala jednostce leczyć sąsiednie przyjazne jednostki na początku każdej tury. Jednostka leczona przez tego uzdrowiciela odzyskuje 2 punkty życia na turę.

source: inspire
de: Begeisterung
hu: ösztönzés
it: inspira
ja: 奮起
pl: inspiruje

source: Inspire: This unit can inspire friendly units that are next to it, making them fight better. Adjacent friendly level 0 units will do 25% more damage in battle. Adjacent friendly level 1 units will do 10% more damage in battle.
de: Begeisterung: Diese Einheit begeistert freundliche Einheiten neben ihr, sodass sie besser kämpfen. Einheiten der Stufe 0 richten 25% mehr Schaden an, Einheiten der Stufe 1 10%.
hu: Ösztönzés: Ez az egység jobb harcra képes motiválni a mellette álló baráti egységeket. A 0-s szintű baráti egységek 25%-kal nagyobbat sebeznek a harcban. Az 1-s szintű baráti egységek 10%-kal nagyobbat sebeznek a harcban.
it: Inspira: L’unità inspira le unità amiche vicine a combattere meglio. Le unità amiche vicine di livello 0 faranno in battaglia 25% di danni in più. Le unità amiche vicine di livello 1 faranno in battaglia 10% di danni in più.
ja: 奮起: このユニットは、隣接する友好的なユニットをより良く戦うように奮起させることができます。 隣接している友好的なレベル 0 のユニットは、戦闘で与えるダメージが 25% 上昇します。 隣接している友好的なレベル 1 のユニットは、戦闘で与えるダメージが 10% 上昇します。
pl: Inspiruje: Jednostka inspiruje pobliskie przyjazne oddziały przez co walczą one lepiej. Przyległe sojusznicze jednostki poziomu 0 zadają o 25% większe obrażenia. Przyległe sojusznicze jednostki poziomu 0 zadają o 10% większe obrażenia.

source: Inspire: This unit can inspire friendly units that are next to it, making them fight better. Adjacent friendly level 0 units will do 25% more damage in battle. Adjacent friendly level 1 units will do 25% more damage in battle. Adjacent friendly level 2 units will do 10% more damage in battle.
de: Begeisterung: Diese Einheit begeistert freundliche Einheiten neben ihr, sodass sie besser kämpfen. Einheiten der Stufen 0 und 1 richten 25% mehr Schaden an, Einheiten der Stufe 2 10%.
hu: Ösztönzés: Ez az egység jobb harcra képes motiválni a mellette álló baráti egységeket. A 0-s szintű baráti egységek 25%-kal nagyobbat sebeznek a harcban. Az 1-s szintű baráti egységek 25%-kal nagyobbat sebeznek a harcban. A 2-s szintű baráti egységek 10%-kal nagyobbat sebeznek a harcban.
it: Inspira: L’unità inspira le unità amiche vicine a combattere meglio. Le unità amiche vicine di livello 0 causeranno 25% di danni in più in battaglia . Le unità amiche vicine di livello 1 causeranno 25% di danni in più in battaglia. Le unità amiche vicine di livello 2 causeranno 10% di danni in più in battaglia.
pl: Inspiruje: Jednostka inspiruje pobliskie przyjazne oddziały przez co walczą one lepiej. Przyległe sojusznicze jednostki poziomu 0 zadają o 25% większe obrażenia. Przyległe sojusznicze jednostki poziomu 0 zadają o 25% większe obrażenia. Przyległe sojusznicze jednostki poziomu 0 zadają o 10% większe obrażenia.

source: awe
de: Scheu
hu: rémség
it: timore
ja: 畏怖
pl: straszy

source: Awe: This unit can frighten enemy units that are next to it, making them fight worse. Adjacent enemy units of lower level will do less damage in battle. When a unit adjacent to, of the same level, or a lower level than, and is an enemy of the unit with Awe engages in combat, its attacks do 15% less damage times the difference in their levels + 15%.
de: Scheu: Diese Einheit flösst feindlichen Einheiten in ihrer Nähe Scheu ein, sodass diese schlechter kämpfen. Verbündete Einheiten niedriger Stufe werden weniger Schaden anrichten, Kämpft eine Einheit, die sich neben der Einheit mit Einschüchterung befindet, ihr feindlich gesinnt ist und auf gleicher oder geringerer Stufe steht als diese, erreicht 15% weniger Schaden, und ebensoviel je Stufenunterschied.
hu: Rémség: Ez az egység megfélemlíti a szomszédos ellenséges egységet, s az gyengébben harcol. A szomszédos alacsonyabb szintű egységek kisebb sebzést okoznak csatában. Az ellenséges szomszédos egységek, beleértve az azonos szintűt és az alacsonyabb szintűt is, a szintjük különbsége szorozva 15% + 15%-kal kisebb sebzést okoznak, ha szembeszállnak ezzel az egységgel.
it: Timore: L’unità spaventa le unità nemiche, facendole combattere male. Le unità nemiche di livello inferiore faranno meno danni in battaglia. Se un’unità di inferiore o uguale livello è vicina a un nemico con l’abilità “timore”, i danni dei suoi attacchi saranno ridotti del 15% in meno rispetto la differenza dei loro livelli +15%.

source: Awe: This unit can frighten enemy units that are next to it, making them fight worse. Adjacent enemy units of lower level will do less damage in battle. When a unit adjacent to, of the same level, or a lower level than, and is an enemy of the unit with awe engages in combat, its attacks do 15% less damage times the difference in their levels + 15%.
de: Scheu: Diese Einheit flösst feindlichen Einheiten in ihrer Nähe Scheu ein, sodass diese schlechter kämpfen. Verbündete Einheiten niedriger Stufe werden weniger Schaden anrichten, Kämpft eine Einheit, die sich neben der Einheit mit Einschüchterung befindet, ihr feindlich gesinnt ist und auf gleicher oder geringerer Stufe steht als diese, erreicht 15% weniger Schaden, und ebensoviel je Stufenunterschied.
hu: Rémség: Ez az egység megfélemlíti a szomszédos ellenséges egységet, s az gyengébben harcol. A szomszédos alacsonyabb szintű egységek kisebb sebzést okoznak csatában. Az ellenséges szomszédos egységek, beleértve az azonos szintűt és az alacsonyabb szintűt is, a szintjük különbsége szorozva 15% + 15%-kal kisebb sebzést okoznak, ha szembeszállnak ezzel az egységgel.
it: Timore: L’unità spaventa le unità nemiche, facendole combattere male. Le unità nemiche di livello inferiore faranno meno danni in battaglia. Se un’unità di inferiore o uguale livello è vicina a un nemico con l’abilità “timore”, i danni dei suoi attacchi saranno ridotti del 15% in meno rispetto la differenza dei loro livelli +15%.

source: banish
de: Bannen
hu: irtás
it: esilio
ja: 追放
pl: wygnanie

source: Banish: If a Banisher hits an enemy magical unit, the enemy will turn into a DG ‘Dimensional Gate’, (this happens only if the target is exactly one level below the banisher). If the enemy is at least two levels below your banisher, it’ll get completely destroyed. Any other enemy won’t be affected.
de: Bannen; Trifft ein Banner ein feindliches Magiches Geschöpf, wird diese zu einem Dimensionstor, wenn sie genau eien Stufe under dem Banner steht. Steht sie mindestens zwei Stufen unter ihm, wird sie vollkommen zerstört. Andere Enheiten sind nicht hiervon betroffen.
hu: Irtás: Ha egy szellemirtó megüt egy mágikus lényt, az átalakul dk-vá ‘dimenziókapuvá’, (ez csak akkor történik meg, ha a célpont egy szinttel a támadó szintje alatt van). Ha a megtámadott egység legalább két szinttel a támadó alatt van, akkor teljesen megsemmisül. Más ellenséges egység esetén nem történik semmi.
it: Esilio: Se un esiliatore colpisce un’unità nemica magica, il nemico si trasformerà in un “portale dimensionale” (capita solo se il bersaglio è esattamente di un livello inferiore all’esiliatore). Se il nemico è di due livelli inferiori all’esiliatore, sarà completamente distrutto. Nessun altro nemico verrà contagiato.

source: circle of banishment
de: Bannkreis
hu: irtókör
it: cerchio dell’esilio
ja: 追放の魔法陣
pl: krąg wygnania

source: Circle of Banishment: This unit can affect enemy magical units that are next to it, making them fight worse. Adjacent enemy magical units of lower level will do less damage in battle. When a unit adjacent to, of the same level, or a lower level than, and is an enemy of the unit with Circle of Banishment engages in combat, its attacks do less damage (−40% lvl0, −30% lvl1, −15% lvl2, −10% lvl3).
it: Cerchio dell’esilio: L’unità contagia le unità nemiche magiche vicine ad essa, facendole combattere male. Le unità nemiche adiacenti di basso livello faranno meno danni in battaglia. Gli attacchi di un’unità nemica di basso o uguale livello provocano meno danni contro un’unità capace di usare il cerchio dell’esilio (−40% lvl0, −30% lvl1, −15% lvl2, −10% lvl3).

source: fear
it: paura

source: Fear: Fear makes all enemy units fight worse (-15% damage).
it: Paura: La paura fa combattere male tutte le unità nemiche (-15% di danno).

source: Fear: Fear makes all enemy units fight worse (-25% damage).
it: Paura: La paura fa combattere male tutte le unità nemiche (-25% di danno).

source: Fear: Fear makes all enemy units fight worse (-35% damage).
it: Paura: La paura fa combattere male tutte le unità nemiche (-35% di danno).

source: Area Attack: This attack can hit some of adjacent enemy units (or even all depending on your luck).
it: Zona di attacco: L’attacco colpisce più unità nemiche adiacenti (o perfino tutti a seconda della fortuna).

source: fungus lord
it: signore dei funghi

source: Fungus Lord: This unit regenerates 8 hp each turn it is on a mushroom grove.
it: Signore dei funghi: L’unità rigenera 8 pf ad ogni turno se si trova in un boschetto di funghi.

source: Regenerates +4: This unit regenerates 4 hp every turn.
it: Rigenera +4: L’unità si rigenera +4 pf ad ogni turno.

source: bloodlust
de: Blutrausch
hu: vérszomj
it: sete di sangue
pl: żądza krwi

source: Bloodlust: When this attack is used, this units gets an extra strike after each successful hit.
de: Blutrausch: Wird dieser Angriff benutzt, erhält diese Einheit für jeden Treffer einen weiteren Schlag.
hu: Vérszomj: Amikor ez a támadástípust használja az egység, minden találat után növekszik a csapásszáma.
it: Sete di sangue: quando si usa questo attacco, l’unità ottiene un colpo addizionale ad ogni colpo andato a segno.
pl: Żądza Krwi: Kiedy ten atak jest w użyciu, jednostka uzyskuje dodatkowy cios po każdym trafieniu.

source: Bloodlust: This unit gets one extra strike with each hit during attack. Does not work on defense.
de: Blutrausch: Diese Einheit erhält während des Angriffes einen weiteren Schlag für jeden Treffer. Funktioniert nur offensiv.
hu: Vérszomj: Az egység minden találat után újabb csapáshoz jut. Védekezés esetén nem történik semmi.
it: Sete di sangue: l’unità guadagna un colpo extra ad ogni colpo inferto in battaglia. Non funziona in difesa.
pl: Żądza Krwi: Kiedy ten atak jest w użyciu, jednostka uzyskuje dodatkowy cios po każdym trafieniu.

source: growing fury
de: Wachsender Zorn
hu: növekvő őrjöngés
it: furia crescente
pl: wzbierająca furia

source: Growing fury: When this attack is used, this units damage increases after each successful hit (+4).
de: Wachsender Zorn: Wird dieser Angriff eingesetzt, steigt der Schaden dieser Einheit mit jedem Treffer (+4)
hu: Növekvő őrjöngés: Ennél a támadástípusnál minden találat után nő az okozott sebzés nagysága (+4).
it: Furia crescente: quando questo attacco è attivo, il danno dell’unità aumenta dopo ogni colpo andato a segno (+4).
pl: Wzbierająca furia: Kiedy ten atak jest w użyciu, obrażenia jednostki rosną z każdym trafionym uderzeniem (+4 do obrażeń).

source: double attack
de: Doppelangriff
hu: kettős támadás
it: doppio attacco
ja: 2回攻撃
pl: podwójny atak

source: double attack: This unit can attack two enemies in one turn, but cannot move from a hex, where the first enemy was attacked.
de: Doppelangriff: Diese Einheit kann zwei Feinde in einer Runde angreifen, sich aber nicht aus dem Feld entfernen, in dem sie den ersten Gegner angriff.
hu: Kettős támadás: Ez az egység két ellenséges egységet támadhat, bár nem mozdulhat el a helyéről, ahonnan az első ellenséget megtámadta.
it: doppio attacco: L’unità attacca due nemici in un solo turno, ma non può muoversi nel posto dove è stato attaccato il primo nemico.

source: second target
de: Zweites Ziel!
hu: újabb célpont
it: secondo bersaglio

source: split fire
de: Getrenntes Feuer
hu: osztott tűz
it: fuoco divisorio

source: split fire: This unit can attack two enemies in one turn with this attack.
de: Getrenntes Feuer: Diese Einheit kann mot diesem Angriff zwei Feinde in einer Runde aangreifen.
hu: Osztott tűz: Ez az egység két ellenséges egységet támadhat egy kör során.
it: fuoco divisorio: L’unità può attaccare due nemici in un solo turno.

source: double attack: This unit can attack two enemies in one turn with this attack.
de: Getrenntes Feuer: Diese Einheit kann mot diesem Angriff zwei Feinde in einer Runde aangreifen.
hu: Kettős támadás: Ez az egység két ellenséges egységet támadhat egy körben.
it: doppio attacco: L’unità attacca due nemici in un solo turno.

source: energy draining
de: Energieentzug
hu: energiaelszívás
it: assorbimento di energia

source: This unit won’t advance by training his combat skills and magical influence. It’ll only get experience by draining the energy of a magical or living object. Therefore this unit won’t get experience in another way than killing.
de: Diese Einheit kann nicht durch Übung ihres Kampfgeschicks und Zauberkarft aufsteigen, nur, indem sie die Energie eines lebenden oder magischen Objekts absorbiert. Deshalb kann diese Einheit nur duch Töten aufsteigen.
hu: Ez az egység nem harci tapasztalatok által fejlődik. Tapasztalatpontjait az élő illetve mágikus lényektől elszívott energiából nyeri. Csak gyilkolás útján tesz szert tapasztalatokra.
it: L’unità non può avanzare di livello migliorando le proprie abilità e magie. Potrà ricevere l’esperienza solo assorbendo l’energia da soggetti viventi o magici, quindi non potrà mai ricevere esperienza in nessun modo se non uccidendo.

source: cleave
de: Rundumschlag
hu: osztott csapás
it: fendente
ja: 開裂
pl: cios obszarowy

source: Cleave: A unit with this ability can hurt units that are adjacent to the attacker and the defender at the same time.
de: Rundumschlag: Eine Einheit mit dieser Fähigkeit kann Einheiten verletzen, die sowohl neben dem Angreifer wie neben dem Verteidiger stehen.
it: Fendente: Un’unità con questa abilità colpisce allo stesso tempo le unità che sono adiacenti all’attaccante e al difensore.

source: hydra’s strike
de: Schlag der Hydra
hu: hidraütés
it: colpo dell’idra

source: Hydra’s Strike: This ability allows an owner to do damage to 2 hostile units standing near a target.
it: Colpo dell’idra: L’unità permette al proprietario di infliggere danni a 2 unità ostili vicine al bersaglio.

source: goblin leader
de: Koboldführer
hu: kobold vezér
it: capo dei goblin
pl: dowódca goblinów

source: Goblin leader: This unit can lead our own Goblins that are next to it, making them fight better. Adjacent own Goblins will do more damage in battle (20% more).
de: Koboldführer: Diese Einheit kann unsere Kobolde in ihrer Nähe führen und so ihre Kampfkraft erhöhen. Benachbarte eigene Kobolde werden mehr (20%) Schaden anrichten.
hu: Kobold vezér: Ez az egység vezeti a szomszédos baráti koboldokat, jobb harcosokká téve őket. A szomszédos baráti koboldok nagyobb sebzést okoznak a csatában (20%-kal).
it: Capo dei goblin: L’unità può comandare i goblin vicini ad essa, facendoli combattere meglio. I goblin adiacenti faranno più danni in battaglia (20% in più).
pl: Dowódca Goblinów: Jednostka potrafi wspierać w walce inne przyjazne Gobliny, dzięki czemu walczą one lepiej. Przyległe sojusznicze Gobliny zadają większe obrażenia w walce (+20%).

source: orcish leader
de: Orkführer
hu: ork vezér
it: capo degli orchi
pl: dowódca orków

source: Orcish leader: This unit can lead our own Orcs that are next to it, making them fight better. Adjacent own Orcs will do more damage in battle (20% more).
de: Orkführer: Diese Einheit kann unsere Orks in ihrer Nähe führen und so ihre Kampfkraft erhöhen. Benachbarte eigene Orks werden mehr (20%) Schaden anrichten.
hu: Ork vezér: Ez az egység a mellette álló saját oldali orkokat jobb támadásra sarkallja. A szomszédos mezőn álló saját oldali ork többet sebez csatában (20%-kal).
it: Capo degli orchi: L’unità può comandare gli orchi vicini ad essa, facendoli combattere meglio. Gli orchi adiacenti faranno più danni in battaglia (20% in più).
pl: Dowódca Orków: Jednostka potrafi wspierać w walce inne przyjazne Orki, dzięki czemu walczą one lepiej. Przyległe sojusznicze Orki zadają większe obrażenia w walce (+20%).

source: troll leader
de: Trollführer
hu: troll vezér
it: capo dei troll
pl: przywódca trolli

source: Troll leader: This unit can lead our own Trolls that are next to it, making them fight better (+20%).
de: Trollführer: Diese Einheit kann unsere Trolle in ihrer Nähe führen und so ihre Kampfkraft erhöhen. Benachbarte eigene Trolle werden mehr (20%) Schaden anrichten.
hu: Troll vezér: Ez az egység a mellette álló saját oldali trollokat jobb támadásra sarkallja (+20%).
it: Capo dei troll: L’unità può comandare i troll vicini ad essa, facendoli combattere meglio (+20%).

source: sculpts
de: Gorgonenfluch
it: scolpisce

source: Sculpt: This attack petrifies the target, turning it to stone for two turns. Units that have been petrified may not move or attack.
de: Gorgonenfluch: Dieser Angriff versteinert sein Opfer für zwei Runden. Versteinerte Einheiten können sich weder bewegen noch angreifen.
it: Scolpisce: L’attacco pietrifica il bersaglio, trasformandolo in pietra per due turni. Le unità pietrificate non possono muoversi o attaccare.

source: This unit returns to life if it is killed while it has more than one hit point.
de: Diese Einheit kehrt ins Leben zurück, wenn sie mit mehr als einem Lebenspunkt getötet wird.
hu: Ez az egység a halála után feltámad, habár csak egyetlen ÉP-vel.
it: L’unità ritorna in vita se è stata uccisa mentre aveva un punto ferita in più.

source: This unit can effecively fight with magical units by turning them into Dimensional Gates.
de: Diese Einheit kann magische Geschöpfe effektiv bekämpfen, indem sie sie In Dimensionstore verwandelt.
hu: Ez az egység hatékonyan képes fellépni a mágikus lények ellen, dimenziókapuvá alakítva őket.
it: L’unità combatte efficacemente se trasforma le unità magiche in portali dimensionali.

source: This unit regenerates in the presence of lava.
de: Diese Einheit regeneriert bei Lava,
hu: Az egység láva környezetben regenerálódik.
it: L’unità si rigenera in presenza di lava.

source: This unit is capable of minor healing.
de: Diese Einheit kann ein wenig heilen.
hu: Az egység kisebb gyógyításra képes.
it: L’unità è capace di curarsi in modo lieve.

source: The presence of this unit inspires own units next to it to deal more damage in combat, though this only applies to units of lower or equal level.
de: Die Präsenz dieser Einheit inspiriert eigen Einheiten, mehr Schaden anzurichten, was aber nur für Einheiten gleicher oder niedrigerer Stufe.
hu: Az egység jelenléte ösztönzőleg hat a szomszédos mezőkön harcoló azonos vagy alacsonyabb szintű saját egységekre, így azok többet sebeznek a harcban.
it: La presenza di questa unità inspira le vicine unità amiche di infliggere più danni in combattimento, e si applica alle sole unità di basso o uguale livello.

source: This unit increases the resistances of adjacent friendly units.
de: Diese Einheit erhöht die Resistenzen angrenzender Verbündeter.
hu: Ez az egység megnöveli a szomszédos baráti egységek ellenállását.
it: L’unità aumenta la resistenza di unità amiche vicine ad essa.

source: This unit invokes awe in adjacent enemy units of the same or lower level, causing them to have their damage reduced.
de: Diese Einheit ruft Scheu in nahen Feinden gleicher oder geringerer Stufe hervor, sodass diese weniger Schaden anrichten.
hu: Ez az egység a szomszédos ellenséges egységekben rettegést vált ki, így azok gyengébben harcolnak, kisebbet sebeznek.
it: L’unità invoca il timore nelle unità nemiche dello stesso o di un livello minore vicine ad essa, riducendo i danni ricevuti dai loro attacchi.

source: This unit can turn enemy units into stone for two turns.
de: Diese Einheit kann Feinde zwei Runden lang in Stein verwandeln.
it: L’unità pietrifica le unità nemiche per due turni.

source: This unit is capable of superior healing and also cures poison.
de: Diese Einheit ist zu überlegener Heilung im Stande und kuriert Gifte.
hu: Ez az egység különösen hatékony gyógyító, s mérgezésből kúráló képességekkel bír.
it: L’unità è capace di curare il veleno e le ferite più gravi.

source: This unit regenerates in the presence of water.
de: Diese Einheit regeneriert im Wasser.
hu: Az egység vízi környezetben regenerálódik.
it: L’unità si rigenera in presenza di acqua.

source: Error
de: Fehler
hu: Hiba
it: Errore
pl: Błąd

source: I have insufficient materials. I am unable to summon.
de: Unzureichende Indegrenzien
hu: Nincs elégséges forrásom. Nem tudok idézni.
it: Non ho risorse sufficienti per evocare.
pl: Nie mam wystarczającej ilości materiałów. Nie jestem w stanie dokonać przywołania.

source: Summon Help
de: Hilfe zur Beschwörung
hu: Megidézés súgója
it: Aiuto sulle evocazioni
ja: 召喚についてのヘルプ
pl: Przywołanie - Pomoc

source: Help
de: Hilfe
hu: Súgó
it: Aiuto
ja: ヘルプ
pl: Pomoc
