Repository: wescamp/Era_of_Magic-1.10
Catalog: po/*.po
Languages: de, hu, it, ja, pl

source: Some of the Dark Blood Shamans get corrupted. By who, or what, nobody knows, but it makes them exchange their Water Magic for that of its polar opposite - Fire. They lose their healing abilities, but they don’t seem to care, as they say that Fire is inherently superior to Water. Whatever corrupts them changes their personalities, too, making them selfish and cruel. As a result, they are shunned from their tribes, which exile them to the heart of the Great Bog. Forced to wander the Bog for years, they usually make their way out and hire themselves to some of the morally bankrupt Tribes.
de: Einige der Schamanen der Dunkelblüter werden verdorben. Wer oder was dafür verantwortlich ist, liegt im Dunkeln, jedenfalls lässt es sie ihre Wassermagie mit ihrem genauen Gegenteil tauschen- Feuer. Sie verlieren die Fähigkeit zu heilen, doch es scheinr sie nicht zu kämmern,da Feuer Wasser laut ihnen von Grund auf überlegen ist. Was immer die Verderbtheit bewirkt, verändert auch ihren Charakter, sie werden arrogant und grausam. Aus diesem Grund werden sie von ihren Stämmen verachtet und in den Kern des Großen Moores vertrieben. Nach Jahren der Wanderschaft erreichen sie meist das Ende des Moores und verdingen sich als Söldner für die skrupeloseren Stämme.
hu: Néhány sámán a sötétvérűek közül rontásnak esik áldozatul. Hogy ki vagy mi rontja meg őket, azt senki sem tudja, de a vízmágia helyett annak ellentétét használják - a tüzet. Elvesztik gyógyító képességüket, de ezzel nem sokat törődnek, mivel a tűz szerintük vitathatatlanul felülmúlja a vizet. Akármi rontja meg őket, az a személyiségüket is megváltoztatja, önzővé és kegyetlenné válnak. Emiatt fajtársaik is kerülik őket, s ki is közösítik, s a Nagy Láp szívébe száműzik őket. A Lápban vándorolva saját utakon járnak, s morálisan lesüllyedt törzsekhez csapódnak.
it: Alcuni degli sciamani sanguescuro si fanno corrompere. Da chi, o da che cosa, nessuno lo sa, ma questo cambiamento li porta a scambiare la loro magia dell’acqua con quella opposta: la magia del fuoco. Anche se perdono la loro abilità guaritiva, tutto ciò non sembra per niente scoraggiarli, ritenendo che la mgai del fuoco sia superiore con quella dell’acqua in modo inerente. Inoltre il comportamento e la personalità dei corrotti cambia drasticamente, diventando egoisti e crudeli. Come conseguenza vengono allontanati dalle loro tribù ed esiliati nel cuore della Grande Palude, dove sono costretti a girovagare per anni, finché non si congiungeranno con le tribù più immorali del luogo, offrendosi come guerrieri.

source: Crossbowman
de: Armbrustschütze
hu: Számszeríjász
it: Balestriere
ja: トカゲのクロスボウ兵
pl: Kusznik

source: Saurians are very small of frame, and though they are somewhat frail because of this, they are very, very agile. In combat, their size allows them to dart past defenses that would hold any grown man at bay, making them a tricky foe to deal with. Spears are their preferred weapon, as their powerful hind legs can drive a spear with enough force to do considerable damage, either in hand or thrown.
de: Saurianische Krieger sind gewöhnlich körperlich schwächer als ihre elfischen oder menschlichen Kontrahenten. Solche Vergleiche sind jedoch immer relativ, da sie, selbst in Rüstungen gekleidet, nichts von ihrer natürlichen Beweglichkeit einbüßen. Dies kann sich in der Schlacht als sehr gefährlich herausstellen, wenn man plötzliche feststellt, dass die eigenen Unterstützungs- und Versorgungstruppen umstellt sind.
hu: Habár kistermetűek a gyíkok, s emiatt törékenynek is tűnnek, nagyon fürgék. Csatában a méretük miatt gyorsan a védők háta mögé kerülhetnek, s ezzel sakkban tarthatják a nagytermetű embereket is; kellő tisztelettel kell kezelni ezeket a trükkös ellenségeket. A dárdák a kedvenc fegyvereik, amelyet izmos hátsó lábaikra támaszkodva kellő erővel tudnak harcba vetni, akár szúrnak vele, akár elhajítják.
it: I sauriani sono piccoli di statura e anche se ciò li rende deboli, sono molto, molto agili. In combattimento, la loro grandezza li aiuta molto a difendersi e possono dare filo da torcere all’uomo più forte sulla terra. La lancia è la loro arma preferita e possono maneggiarla così bene da fare molti danni sia nei combattimenti ravvicinati e sia in quelli a distanza.

source: Double Ranged Toad
de: Howdakröte
hu: Köpködő varangy
it: Rospo con doppio balestriere
ja: 強化投射型カエル
pl: Wielka Ropucha Strzelecka

source: aimed shot
de: Anvisieren
hu: célzott lövés
it: tiro di precisione
ja: 狙い撃ち
pl: celowany strzał

source: crossbow ×2
de: Beide Armbrüste
hu: számszeríj x2
it: balestra x2

source: concentrated fire
de: Sperrfeuer
hu: koncentrált tűz
it: fuoco di precisione
ja: 集中砲火
pl: skoncentrowany ostrzał

source: Dreadnaught
de: Behemoth
hu: Behemót
it: Corazziere veloce
ja: 恐れ知らず
pl: Pancernik

source: Great Pikeman
de: Pikenrecke
hu: Nagy pikás
it: Grande picchiere
ja: トカゲの熟練槍兵
pl: Wielki Pikinier

source: Great Wyvern
de: Großer Wyvern
hu: Nagy sárkánykígyó
it: Grande viverna
ja: グレートワイバーン
pl: Wielka Wiwerna

source: Green Salamander
de: Grüner Salamander
hu: Zöld szalamandra
it: Salamandra verde
ja: グリーンサラマンダー
pl: Zielona Salamandra

source: Mystic
de: Mystiker
hu: Misztikus
it: Mistico
ja: 神秘なる者
pl: Mistyk

source: Mystical Toad
de: Mystische Kröte
hu: Misztikus varangy
it: Rospo mistico
ja: 神秘的なカエル
pl: Mistyczna Ropucha

source: magic missile
de: Magisches Geschoss
hu: mágikus nyíl
it: proiettile magico
ja: マジカルミサイル
pl: magiczny pocisk

source: Saurian Pikeman
de: Saurianischer Pikenträger
hu: Gyík pikás
it: Sauriano picchiere
ja: トカゲの槍兵
pl: Sauriański Pikinier

source: The average Dark Blooded soldier is equipped with a long-bladed, ornate pike, used both for stabbing and slashing. Those otherwise normal Saurians are famous for the yellow war-paint they apply to themselves before battle, and for their knowledge of forest and swamp warfare.
de: Der gewöhnliche Dunkelblut-Soldat ist mit einer verzierten Pike mit langer Spitze ausgerüstet, die sowohl zum Stechen wie zum Schneiden eingesetzt wird. Diese ansonsten normalen Saurianer sind für berühmt für ihre gelbe Kriegsbemalung und ihre Kenntnisse im Kampf in Wald und Sumpf.
hu: Az átlagos sötétvérű harcos egy hosszúpengéjű, díszes pikával van felszerelve, amivel egyaránt tud nyársalni illetve kaszabolni. A máskülönben átlagos gyíkok arról ismerszenek meg, hogy csata előtt sárga harcijeleket pingálnak magukra, s különösen jól ismerik az erdei illetve a mocsári harc fortélyait.
it: La maggior parte dei soldati sanguescuro sono equipaggiati con una lunga e ornata picca, usata per rallentare e lacerare i nemici. Inoltre alcuni sauriani si distinguono per i loro segni di guerra di colore giallo dipinti sul loro corpo e per la loro conoscenza di foreste e paludi come campi da battaglia.

source: Ranged Toad
de: Schützenkröte
hu: Messzeköpő varangy
it: Rospo con balestriere
ja: 投射型カエル
pl: Ropucha Strzelecka

source: Salamander
hu: Szalamandra
it: Salamandra
ja: サラマンダー
pl: Salamandra

source: Shamanistic Adept
de: Schamane
hu: Gyakornok sámán
it: Adepto sciamanico
ja: 熟練呪術師
pl: Szaman Adept

source: If the Dark Blood Tribe is known for something, it’s their shamanistic magic. Those saurians who choose to learn it are usually frail of body and unfit to do battle physically. However, their control of water magicks is invaluable in battle, both to heal their allies, and to hurl balls of ice at their foes.
de: Beim Wort Dunkelblüter denken viele als erstes an ihren Schamanenzauber. Jene Saurianer, die ihn erlernen wollen, sind meist schwächlich und für direkten Kampf ungeeigner. Doch ihre Macht über Wasser ist von unschätzbaren Wert auf dem Schlachtfeld, sowohl um Verbündete zu heilen als auch um Gegner mit Eisbällen zu bewerfen.
hu: Ha a Sötétvérű törzs valamiről ismert, az a sámáni mágiájuk. Azok a gyíkok, akik ezt művelik, általában törékeny termetűek, s alkalmatlanok a fizikai harcra. Ezzel szemben a vízmágiájuk megfizethetetlen a csatában, akár a szövetségeseket gyógyítják, akár jéggolyókkal bombázzák az ellenséget.
it: Se la tribù sanguescuro è conosciuta per qualcosa, di certo è per la sua magia sciamanica. I sauriani che hanno scelto di imparare quest’arte sono deboli e incapaci di combattere fisicamente. Comunque, il controllo dell’acqua è inestimabile in battaglia, perché possono sia curare i loro alleati e sia colpire i loro nemici con sfere di ghiaccio.

source: Shamanistic Toad
de: Schamanenkröte
hu: Sámánvarangy
it: Rospo sciamanico
ja: 呪術的なカエル
pl: Szamanistyczna Ropucha

source: Shooter
de: Schütze
hu: Lövész
it: Bersagliere
ja: トカゲの射手
pl: Strzelec

source: Swamp Mage
de: Sumpfmagier
hu: Mocsári mágus
it: Mago delle paludi
ja: 沼地の魔術師
pl: Bagienny Mag

source: Some of the Corrupted Shamans do not come out of the Great Bog. Instead, they opt to remain and find their fate there. Some of those wander to a certain part of the Bog which is suffused with darkness. Most of them die; the few who survive, probably through some sort of deal with that place’s dark rulers, come back... wrong. Their personalities are wiped blank, and they serve as the darkness’s vehicles. They gain great power in its service, and their ability to use the fires of the darkness itself and regenerate almost any wound is infamous in some parts of the Bog.
de: Manche der verdorbenen Schamanen verlassen das Große Moor nicht. Stattdessen entscheiden sie sich, zu bleiben und dort uhr Schicksal zu tragen. Einige wandern in ein bestimmtes Gebiet des Moores, welches mit Finsternis getränkt ist. Die meisten sterben; die wenigen Überlebenden, wohl dank eines Handels mit den dunklen Herren dieses Ortes, sind...verkehrt. Ihr Charakter ist ausgelöscht, sie dienen als Wirte der Finsternis. In ihrem Auftrag verfügen sie über große Macht, und ihre Fähigkeit, die Flammen der Finsternis selbst zu nutzen, sowie sich von fast allen Verletzungen zu erholen, sind in einigen Gebieten des Großen Moores berüchtigt.
hu: Néhány megrontott sámán nem merészkedik elő a Nagy Lápból. Ők helyben maradva keresik a sorsukat. A Láp legsötétebb helyein barangolnak. Legtöbbjük oda is veszik; az a kevés túlélő, aki visszatér, valamilyen titkos egyezményt kötött a a sötétség uraival... s ebben nincs semmi jó. Személyiségük gyökeres változáson megy át, teljesen a sötétség uralma alatt állnak. Nagy erővel bírnak, a sötétség tüzét használják, s szinte minden sebük begyógyul, legalábbis ez a hír járja róluk.
it: Alcuni sciamani corrotti decidono di non lasciare la Grande Palude, e scelgono di rimanere lì per compiere il proprio destino. Qualcuno di loro girovaga in qualche strana parte della palude coperta dall’oscurità. Molti muoiono: i pochi che sopravvivono probabilmente stipulano un accordo con qualche oscuro dominatore di quel luogo, rimanendone...deviati. La loro personalità è vuota e vengono sfruttati come oggetti per l’oscurità stessa; ma in cambio del loro servizio ricevono un grande potere, tra cui l’abilita di usare le fiamme delle tenebre e quella di rigenerare quasi tutti i tipi di ferite, anche le più gravi.

source: damned flame
de: Flamme der Verderbnis
hu: átkozott láng
it: fiamma della dannazione
ja: 忌まわしい火炎
pl: przeklęty płomień

source: Toad
de: Kröte
hu: Varangy
it: Rospo
ja: カエル
pl: Ropucha

source: In the middle of the Jungle of Life lies the Great Bog, dark and marshy. It is said that many a creature make their homes there. The saurians of the Dark Blood tribe are known to capture and tame the Bog’s giant Toads, riding their backs and using them as war elephants of sorts; it is known that they use special lures to make the Toads strike enemies with their long, sticky tongues.
de: Mitten im Dschungel des Lebens liegt das Droße Moor, düster und marschig. Viele Legenden ranken sich über seine Bewohner. Die Dunkelblut-Saurianer sind dafür bekannt, die Riesenmoorkröten zu fangen und auf ihren Rücken in die Schlacht zu reiten, wie auf einem Kriegselefant; zudem benutzen sie spezielle Köder, um die Kröten dazu zu verlocken, Feinde mit der langen Zunge anzugreifen.
hu: Az Élet Dzsungelének közepén fekszik a sötét és mocsaras Nagy Láp. Azt mondják, hogy sok lénynek az otthona. A Sötétvérű törzs gyíkjai arról ismertek, hogy óriási varangyokat fognak el és szelidítenek meg, meglovagolják őket, és egyfajta harci elefántként használják őket; köztudottan speciális hipnózist alkalmaznak, hogy a varangyaik hosszú és ragadós nyelvükkel csépeljék az ellenséget.
it: Nel mezzo della Giungla della Vita giace la Grande Palude, luogo tetro e oscuro. Si dice che molte creature si rifugino in quel posto. I sauriani della tribù sanguescuro sono famosi per la caccia e per l’addomesticamento dei rospi giganti della palude, usati per essere cavalcati come se fossero una sorta di elefanti da guerra; inoltre i sauriani sono conosciuti per l’uso di strane sostanze applicate alla lingua lunga e appiccicosa dei loro rospi, usata per colpire i nemici.

source: dart
de: Wurfpfeil
hu: minidárda
it: freccia
ja: ダーツ
pl: rzutka

source: Wyvern
hu: Sárkánygyík
it: Viverna
ja: ワイバーン
pl: Wiwerna

source: From the marshy lands of the Great Bog hail the bloodthirsty Wyverns. These majestic beasts of prey, which are said to be the offspring of the great Dragons of old, are captured by the Dark Blood saurians, which use them as shock troopers of sorts. They are subjected to torture by fire, making them even more crazed and bloodthirsty than Nature intended, and released upon the Tribe’s multiple enemies.
de: In den Marschen des Großen Moores leben die blutrünstigen Wyvern. Diese majestätischen Raubtiere sollen Nachkommen der Drachen alter Tage sein und werden von den Dunkelblut-Saurianern gefangen, die sie als Sturmtruppen einsetzen. Sie werden miit Feuer gequält, bis sie noch tollkühner und blutrüntiger sind als von Natur aus, und auf die Feinde des Stammes losgelassen.
hu: A mocsaras területekről származnak a vérszomjas sárkánykígyók is. Ezeket a fenséges ragadozókat, amelyek állítólag a régi sárkányok leszármazottai, a sötétvérűek foglyul ejtik, s egyfajta rohamcsapatként alkalmazzák őket. Tűzzel kínozzák őket, hogy természetadta őrültségüket és vérszomjukat fokozzák, amelyet számos ellenség volt kénytelen megtapasztalni.
it: Nelle terre acquitrinose della Grande Palude si rifugiano le viverne. Queste bestie piene d’orgoglio, di cui si dice che siano le discendenti dei grandi draghi antichi, vengono catturate dai sauriani sanguescuro per essere usate come truppe d’assalto. Prima di una battaglia, vengono torturate con il fuoco per farle impazzire ancora di più, e vengono poi rilasciate per combattere i numerosi nemici della tribù.

source: Wyvern Rider
de: Wyvernreiter
hu: Sárkánykígyólovas
it: Cavalcatore di viverne
ja: ワイバーンの乗り手
pl: Jeździec Wiwern

source: Not all of the Wyverns captured by the Dark Blooded are tortured and sent to the frontier; some of them are tamed and used as mounts by some of the more dastardly Saurians. They usually charge into the fray with their Pikes, then goad their mounts to bite their foes; sometimes, the Wyverns swallow them whole.
de: Nicht alle von den Dunkelblütern gefangenen Wyvern werden gequält und an die Front geschickt; manche werden gebändigt und von den gerisseneneren Saurianern geritten. Diese stürmen meistens mit ihren Piken in die Schlacht und lassen dann ihre Reittiere ihre Gegner beißen; manchmal verschlingen die Wyvern sie mit Haut und Haaren.
hu: A sötétvérűek által elfogott sárkánykígyók legtöbbjét megkínozzák, s kihajtják őket a frontra; néhányukat azonban felnyergelik, s a legvérszomjasabb gyíkok hátasaiként szolgálnak. A lovasaik által pikával megsebzett ellenséget harapásaikkal gyengítik; olykor előfordul az is, hogy egészben nyelik le őket.
it: Non tutte le viverne catturate dai sanguescuro vengono torturate e mandate al fronte: alcune di loro vengono addomesticate e usate per essere cavalcate da alcuni dei sauriani più vili. Durante il combattimento, i sauriani attaccano per primi con la picca per poi lasciare che le viverne divorino le membra del nemico.

source: Wyvern Tamer
de: Wyvernbändiger
hu: Sárkánykígyó-szelidítő
it: Viverna addomesticata
ja: ワイバーンの調教師
pl: Poskramiacz Wiwern

source: stab
it: pugnalata

source: Atokpi General
it: Atokpi generale

source: Beast
it: Bestia

source: head
it: testata

source: tail
de: Schwanz
it: coda

source: Bone Golem
it: Golem d’ossa

source: Bone Giant
it: Gigante d’ossa

source: Cyclops Skeleton
it: Ciclope scheletrico

source: Legendary Cyclops
it: Ciclope leggendario

source: Extinct Cyclops Mage
it: Ciclope mago dell’estinzione

source: area attack
it: zona di attacco

source: Punisher
it: Punitore

source: Obliterator
it: Obliteratore

source: Pirafly
it: Piranha alato

source: female^Adept of Light
de: Geweihte des Lichts
hu: Fénytanítvány
it: Adepta della luce
pl: Adeptka Światła

source: Brown Warrior
de: Brauner Soldat
hu: Barna harcos
it: Guerriero di bronzo
ja: 茶の闘士
pl: Brązowy Wojownik

source: Brown warriors are equipped with a very sharp sword and a mace.
de: Braune Soldaten tragen scharfe Schwerter und Streitkolben.
hu: A barna harcosok nagyon éles karddal és buzogánnyal vannak felfegyverezve.
it: I guerrieri di bronzo sono equipaggiati con una mazza e con una spada molto tagliente.
pl: Żołnierze ci rekrutują się z białych wojowników, którzy zdobyli duże doświadczenie na polu walki. Teraz, oprócz mieczów, jako oręża używają także ciężkich buzdyganów, którymi nieprzyjaciołom sprawiają prawdziwą krwawą łaźnie. Brązowi wojownicy otrzymują lepsze niż przedtem pancerze, co sprawia, że mniej podatni są na ciosy. Często wykorzystywani są jako gwardziści dostojników i kapłanek. Obecność ich na polu bitwy nieraz przechyliła szalę zwycięstwa na stronę Kharos. --Poliuks

source: Cavalry Archer
de: Berittener Bogenschütze
hu: Lovas íjász
it: Cavaliere arciere
ja: 騎馬の弓兵
pl: Konny Łucznik

source: bow bash
de: Bogenschlag
hu: íjütés
it: mazzata
ja: 弓での打撃
pl: uderzenie łukiem

source: female^Child of Light
de: Tochter des Lichts
hu: Fénygyermek
it: Figlia della luce
pl: Córa Światła

source: light touch
de: Berührung des Lichtes
hu: könnyed érintés
it: tocco di luce
ja: 光の接触
pl: dotyk światła

source: ray of light
de: Lichtblitz
hu: fénysugár
it: raggio di luce
ja: 光線
pl: promień światła

source: female^Cleric
de: Geistliche
hu: Papnő
it: Chierichessa
pl: Kleryk

source: This unit is less effective than white mage but it can perform more magical attacks. The Cleric heals and leads other units.
de: Diese Einheit ist schwächer als der Weiße Magier, kann aber öfter angreifen. Die Geistliche heilt nicht nur, sondern führt auch andere Kharositen in den Kampf.
hu: Ez az egység kevésbé hatékony, mint a fehér mágus, de több mágikus támadással bír. A próféta gyógyít és vezeti a sereget.
it: L’unità è meno efficace rispetto al mago bianco ma può usare molti attacchi magici. Il chierico guarisce e comanda altre unità.

source: Elemental Archer
de: Zauberbogen
hu: Elemi íjász
it: Arciere elementale
ja: 精霊の弓兵
pl: Elementarny Łucznik

source: fire arrow
de: Feuerpfeil
hu: tüzes nyíl
it: freccia di fuoco
ja: 火の矢
pl: ognista strzała

source: ice arrow
de: Eispfeil
hu: jeges nyíl
it: freccia di ghiaccio
ja: 氷の矢
pl: lodowa strzała

source: arrow
de: Pfeil
hu: nyíl
it: freccia
ja: 矢
pl: strzała

source: Fanatic
de: Fanatiker
hu: Fanatikus
it: Fanatico
ja: 狂信者
pl: Fanatyk

source: You will die in a twinkling of an eye.
de: Du lebst nur noch einen Wimpernschlag.
hu: Meghalsz egy szempillantás alatt.
it: Morirai in un batter d’occhio.
pl: Adepci starożytnej sztuki walki, starej jak samo państwo Kharos. Wszyscy chłopcy w kraju w wieku siedmiu lat przechodzą test, sprawdzający ich ruchliwość, sprawność i szybkość. Ci, którzy wybiją się ponad resztę, są odbierani rodzicom i oddawani do specjalnych szkół, gdzie przechodzą rygorystyczny trening, kształcący w nich sprawność we władaniu bronią, ale też fanatyczną odwagę. Z akademii wychodzą jako wojownicy, wyposażeni w fosforyzujące, częściowo niematerialne ostrza. Na polu walki stosują taktykę wielce specyficzną. Kiedy zaatakują wroga, nie spoczną, póki nie zabiją go lub sami nie legną trupem. Od innych berserkerów wyróżnia ich jednak to, że dzięki swej nieprawdopodobnej, wrodzonej i wykształconej zwinności, dosięgnięcie ich graniczy z cudem. Oni sami zadają ciosy lekkie, odskakując po każdym uderzeniu, ale momentalnie dopadając wroga ponownie, zanim ten zdąży się zorientować. Wszystko to sprawia, że starcie z Siekaczem musi budzić strach w każdym żołnierzu.

source: Golden Warrior
de: Güldener Soldat
hu: Arany harcos
it: Guerriero dorato
ja: 金の闘士
pl: Złoty Wojownik

source: Extremely fast, dangerous and powerful. The Golden warrior can focus the sun rays, completely burning an enemy.
de: Extrem schnell, gefährlich und mächtig ist der Güldene Soldat. Er kann das Sonnenlicht bündeln, um seine Feinde zu verbrennen.
hu: Elképesztően gyors, veszélyes és hatalmas. Az aranyharcos képes a napsugarakat koncentrálni, s elégetni az ellenséget.
it: Estremamente veloce, pericoloso e potente. Il guerriero dorato può concentrare i raggi solari per bruciare completamente il nemico.
pl: Ci wojownicy chlubią się elitą pośród srebrnych wojowników. Niezależnie od prawdy wiadomym jest, że niewielu ma ochotę się im przeciwstawiać, przenikają oni z miejsca na miejsce karając tych, którzy ośmielają się im przeciwstawiać palącym światłem, które nie ma litości dla wrogów Kharosu. Takich jak oni z pewnością czeka wielka przyszłość, ale i tak każdy z nich ćwiczy mając nadzieję osiągnąć taki poziom, jak mistrz słońca... --barowei

source: white sword
de: Weißes Schwert
hu: fehér kard
it: spada bianca
pl: biały miecz

source: light focusing
de: Gebündeltes Licht
hu: lézerfény
it: luce concentrata
pl: skupienie światła

source: Heavy Cavalry Archer
de: Kavaleriebogeschütze
hu: Páncélos lovas íjász
it: Grande cavaliere arciere
ja: 騎馬の重弓兵
pl: Ciężki Łucznik Kawaleryjski

source: female^Inspired
de: Erwählte
hu: Ösztönzött
it: Inspiratrice
pl: Natchniona

source: Kharos War Banner
de: Banner
hu: Kharos zászlótartó
it: Kharos con stendardo di guerra
ja: Kharos の戦旗
pl: Szandar Wojenny Kharos

source: Kharosans use war banners to increase morale of all near troops. The War Banner shows gold sun — emblem of the Kharos nation. Two people protect the banner - one Cleric and soldier, who holds the banner. The Cleric creates a special aura, which decreases power of destructive spells casted on it.
de: Kharos setzt Standarten ein, um die Moral aller Truppen in der Nähe zu heben. Die Standarte zeigt die Güldene Sonne, das Emblem der Kharositen. Zwei verteidigen die Standarte- Eine Geistliche und ein Soldat, welcher die Standarte trägt. Die Geistliche erzeugt eine besondere Aura, die gegen die Standarte gewirkte Schadenszauber schwächt.
hu: A Kharosiak hadizászlói ösztönzőleg hatnak a körülöttük lévő egységekre. A zászlókon arany nap van - a kharos nép szimbóluma. Két ember szolgál a zászló védelmére - egy pap és egy harcos, aki tartja a zászlót. A pap speciális aurát kreál, amely legyengíti a pusztító mágikus támadások erejét.
it: I kharos usano stendardi di guerra per far crescere il morale delle truppe vicine. In esso è raffigurato il sole dorato, simbolo della nazione di Kharos e due persone proteggono lo stendardo: un soldato e un chierico. I chierici creano un’aura speciale in grado di far aumentare il potere distruttivo degli incantesimi.
