Repository: wescamp/Era_of_Magic-1.10
Catalog: po/*.po
Languages: de, hu, it, ja, pl

source: Protector holds a large towershield. He uses it to protect all adjacent units. Their resistance increases.
ja: 保護兵は大きなタワーシールドを持っています。彼はそれを使って全ての隣接ユニットを守ります。保護されたユニットは抵抗力が向上します。
pl: Tarczownicy, którzy wybrali tę taktykę walki, koncentrują się na ochronie reszty wojsk. Ich zbroje i tarcze są niezwykle kosztowne - wykuwane są z najtwardszych dostępnych materiałów. Ten wydatek opłaca się jednak, ponieważ nie ma na świecie żołnierzy tak doświadczonych czy silnych, by bezkarnie przełamali linie obrońców. Za ich tarczami kryją się często ranni żołnierze, którzy wiedzą, że tam uzdrowiciele mogą w spokoju uleczyć ich obrażenia. Do walki posługują się ogromnymi, ciężkimi włóczniami, które miotają w stronę wroga bądź uderzają, zasłonięci puklerzami. Obrońcy są żywym murem na polu bitwy czy w oblężonej twierdzy, wspomagani przez leczenie kapłanów potrafią zatrzymać najzacieklejszych wrogów. --Poliuks

source: The Revenger is a heavy tactical defense unit. His retalitation strikes are always successful.
ja: 復讐兵は、防御戦術に重要なユニットです。その反撃は常に成功します。
pl: Ciężka piechota Kharos, używana do rozbijania atakujących sił wroga. Mściciele polegają na skuteczności swego ataku; przeszli długi trening, aż dopracowali do perfekcji sztukę ataku kontrującego - nie ma takiego mistrza unikania ciosów, który uszedłby bezkarnie po ataku na niego. Aby w pełni wykorzystać swoje możliwości, zostali wyposażeni w znakomite uzbrojenie, niewiele ustępujące rynsztunkowi obrońców. Oręża używają nie tylko do obrony, lecz i do ofensywy, choć w ataku są diametralnie mniej skuteczni. Złamanie ich linii możliwe jest tylko przy użyciu wyborowych magów. Mściciele nigdy nie zawodzą - bez strachu staną naprzeciw każdych wojsk, gotowi stawić czoła choćby wojskom Tharis.

source: Kharosans use war banners to increase morale of all near troops. The War Banner shows gold sun - emblem of the Kharos nation. Two people protect the banner - one Cleric and soldier, who holds the banner. The Cleric creates a special aura, which decreases power of destructive spells casted on it.
pl: Sztandary Kharos, ozdobione godłem państwa - złotym słońcem, a także innymi dla każdej flagi runami. Dla wszystkich Kharosan są one relikwią - ich dzieje sięgają czasów założenia kraju i odnalezienia promienia. Stanowią także emblematy oddziałów armii, dzięki którym żołnierze w zgiełku bitwy mogą odnaleźć swych dowódców. Każdy sztandar chroniony jest przez żołnierza i kapłankę - pierwszy odpiera ciosy przeciwników, druga tworzy ochronną aurę magiczną - podobną do mistycznej tarczy strażników słońca - a także atakuje przeciwników magią. Sztandary stanowią dla Kharos olbrzymią pomoc; każdy żołnierz, widząc sztandar, czuje się pokrzepiony na duchu i walczy z ogromną zaciekłością i oddaniem. --Poliuks

source: exlosive ammo
ja: 火炎弾
pl: amunicja eksplodująca

source: Banish: this unit can effecively fight with magical units by turning them into Dimensional Gates.
pl: Wygnanie: ta jednostka potrafi efektywnie walczyć z magicznymi jednostkami zamieniając je we Wrota Wymiarów.

source: devine spear
ja: 神の槍
pl: boska włócznia

source: double devine spear
ja: 神の槍 x2
pl: podwójna boska włócznia

source: Summons master
ja: 召喚術を極めし者
pl: Mistrz Przywołania

source: hammer
ja: ハンマー
pl: młot

source: Dread Bat
ja: 恐怖コウモリ
pl: Przerażający Nietoperz

source: fangs
ja: 牙
pl: kły

source: . Special Notes:
ja: . 特記事項:
pl: . Uwagi Specjalne:

source: fireball
ja: 火の玉
pl: kula ognia

source: staff
ja: 杖
pl: laska

source: shadow wave
ja: 闇の波動
pl: fala cienia

source: net
ja: 網
pl: sieć

source: fist
ja: 拳
pl: pięść

source: curse
pl: klątwa

source: race^Human
pl: Człowiek

source: race+female^Human
pl: Człowiek

source: race^Humans
pl: Ludzie

source: Made of Fire: This unit is made of fire. If it stands in lava, it will recive 6 hp.
ja: 火より生まれしもの: このユニットは火から作られました。そのため、溶岩の中ではヒットポイントが 6 回復します。
pl: Zbudowany z ognia: Ta jednostka składa się całkowicie z ognia. Dlatego jeśli stoi w lawie oddzyskuje siły (6hp na turę)

source: lavahome: This unit is made of fire. If it stands in lava, it will recive 6 hp.
ja: 溶岩に住むもの: このユニットは火から作られました。そのため、溶岩の中ではヒットポイントが 6 回復します。
pl: Zbudowany z ognia: Ta jednostka składa się całkowicie z ognia. Dlatego jeśli stoi w lawie oddzyskuje siły (6hp na turę)

source: megacircle: This unit owns powerful magic circle which affects all units inside. All friendly units fight better (+125%, +100%, +75%, +50%, +25% - lvl 0, 1, 2, 3, 4) and regenerate themselves.
ja: 大魔法陣: このユニットは、中にいる全てのユニットに影響を与える強力な魔法陣を持っています。全ての友好的なユニットは効果的に戦う (+125%, +100%, +75%, +50%, +25% - lvl 0, 1, 2, 3, 4) ことができるようになり、抵抗力も向上します。
pl: megakrąg: Ta jednostka dysponuje potężnym magicznym kręgiem, który wpływa na wszystkie jednostki na nim stojące. Przyjazne jednostki walczą lepiej (+125%, +100%, +75%, +50%, +25% - poziomy 0, 1, 2, 3, 4) i regenerują się.

source: Dark aura makes all enemy units fight worse (-25% for attack).
ja: 闇のオーラは全ての敵ユニットを弱体化（攻撃が -25%）させます。
pl: Maroczna aura sprawia, że wszystkie jednostki przeciwnika w jej zasięgu walczą gorzej (-25% do obrażeń).

source: Circle of Resistance: This unit and all adjacent friendly units receive a +20% bonus to fire, cold and arcane resistance.
ja: 抵抗の魔法陣: このユニットと全ての友好的なユニットは、火炎と冷気、秘術に対して +20% の抵抗力を獲得します。
pl: Krąg Odporności: Jednostki stojące w pobliżu otrzymują 20% premię do odporności na ogień, chłód i tajemny typ obrażeń.

source: Deadzone: Adjacent friendly units receive a 99% bonus to fire,cold and arcane resistance
ja: 死角: 隣接した友好軍のユニットは、火炎と冷気、秘術に対して 99% の抵抗力を得ます。
pl: Martwa Strefa: Pobliskie przyjazne jednostki stają się niewrażliwe na obrażenia magiczne (ogień, chłód, tajemny) (99% bonus)

source: Cold Aura: Adjacent units receive a 50% bonus to fire resistance and a -25% bonus to cold resistance. All cold spells are very powerful here.
ja: 冷気のオーラ: 隣接したユニットは +50% の火炎への耐性と冷気への -25% の耐性を受けます。全ての冷気魔法はこの空間では非常に強力となります。
pl: Mroźna Aura: Przyległe jednostki otrzymują 50% bonus do odporności na ogień i o 25% stają się podatniejsze na obrażenia od chłodu.

source: revenge: The unit has always a 100% chance to hit, during retalitation.
ja: 報復: このユニットの反撃は常に 100% の確率で命中します。
pl: Zemsta: Jednostka ta zawsze trafia jeśli zostanie zaatakowana.

source: Kamikaze: this unit always hits a target when attacking, but it dies instantly.
ja: カミカゼ: このユニットが攻撃するとき、必ず命中します。しかし、直ちに死んでしまいます。
pl: Kamikaze: ta jednostka zawsze trafia cel ale za to jednocześnie ginie.

source: Fury: This unit can attack another after killing an enemy.
ja: 激怒: このユニットは敵を殺した後、別の敵を攻撃することができます。
pl: Furia: Jeśli ta jednostka zabije inną, to może wykonać kolejny atak.

source: Furious Death: When this unit dies, it flies into a fury. The unit with this ability atacks all adjecent units and then it finally dies.
ja: 死に際の激怒: このユニットが死んだとき、怒りが蔓延します。このユニットに隣接する全てのユニットはその時死に至ります。（訳注: バージョン0.10.2をBfW 1.8.5で試したときは全ての隣接ユニットにダメージを与えるだけでした）
pl: Wściekła Śmierć: Kiedy ta jednostka otrzymuje śmiertelny cios, wpada w szał, atakuje wszystkie przyległe jednostki naraz i dopiero po tym ginie.

source: Battlefrenzy: When this attack is used, this units gets an extra strike and additional damage (+2) after each successful hit. Does not work on defence.
pl: Szał bojowy: Kiedy ten atak jest użyty, jednostka otrzymuje dodatkowy cios i dodatkowe obrażenia (+2) po każdym udanym trafieniu. Nie działa podczas obrony.

source: Battlefrenzy: This unit gets one extra strike and additional damage (+2) with each hit during attack. Does not work on defense.
pl: Szał bojowy: Kiedy ten atak jest użyty, jednostka otrzymuje dodatkowy cios i dodatkowe obrażenia (+2) po każdym udanym trafieniu. Nie działa podczas obrony.

source: Hard landing
ja: 墜落
pl: Twarde Lądowanie

source: Hard landing: When this large unit is destroyed, it falls on a ground dealing damage to all adjecent units.
ja: 墜落: この大きなユニットが破壊されてしまったとき、地面に墜落して全ての隣接ユニットに損傷を与えます。
pl: Twarde Lądowanie: Kiedy ta duża jednostka ulega zniszczeniu, jej wrak spada na ziemię wyrządzając obrażenia okolicznym jednostkom.

source: Parachute: The pilot of this machine is equipped with parachute and he can survive a destruction of his vehicle.
ja: 落下傘: この機械の操縦士は落下傘を備えています。そのため、乗り物が破壊されてしまったとしても脱出することが可能です。
pl: Spadochron: Pilot tej maszyny jest wyposażony w spadochron i jest w stanie przetrwać zniszczenie swojego pojazdu.

source: Grenade: When this attack is used, all units adjecent to a target get damage. Does not work on defense.
ja: グレネード: 攻撃時にこの攻撃が使われるとき、全ての隣接ユニットはダメージを受けます。防御時には発生しません。
pl: Granat: Kiedy ten atak jest użyty, wszystkie przyległe do celu jednostki również otrzymują obrażenia. Nie działa podczas obrony.

source: Rune Aura: When this ability is activated, all Rune Masters create special auras. Adjacent friendly units on hexes: s, ne, nw receive a 99% bonus to fire, cold and arcane resistance. Other units receive a -99% bonus to fire, cold and arcane resistance. The transformation lasts for one turn. Transformated unit cannot attack.
pl: Runiczna Aura: Kiedy ta zdolność jest aktywowana, wszyscy Mistrzowie Run (przeciwnika też) tworzą specjalne aury. Przyjazne sąsiadujące jednostki na heksach: południowym, północno-zachodnim i północno-wschodnim otrzymują wtedy prawie całkowitą odporność na obrażenia od ognia, chłodu i tajemnego, a jednostki na heksach: północnym, południowo-zachodnim i południowo-wschodnim otrzymują maksymalną podatność na obrażenia od ognia, chłodu i tajemnego. Transformacja trwa jedną turę. Transformowani Mistrzowie Run nie mogą atakować.

source: No
ja: いいえ
pl: Nie

source: Yes
ja: はい
pl: Tak

source: You don't have enough gold to activate the rune aura!
pl: Nie masz wystarczającej ilości złota, aby aktywować runiczną aurę!

source: Rune Aura: Adjacent friendly units on hexes: s, ne, nw receive a 99% bonus to fire, cold and arcane resistance. Other units receive a -99% bonus to fire, cold and arcane resistance.
pl: Aura Runiczna: Sąsiednie sojusznicze jednostki na heksach: południowym, pónocno-wschodnim i północno-zachodnim otrzymują 99% bonus do odporności na ogień, chłód i tajemny typ obrażeń. Inne sąsiednie jednostki stają się maksymalnie podatne na te same obrażenia.

source: Swallow +4
ja: 飲み込む +4
pl: Połknięcie +4

source: water Ambush: This unit can hide in water, and remain undetected by its enemies. Enemy units cannot see this unit while it is in water, except if they have units next to it. Any enemy unit that first discovers this unit immediately loses all its remaining movement.
ja: 伏兵（水）: このユニットは水に隠れることができます。そのため、水の中にいれば敵に見つかることはありません。 このユニットが水の中にいるときは、敵のユニットはこのユニットの隣にいる場合以外は、このユニットを見つけることはできません。このユニットを初めて見つけた敵ユニットは、それ以上移動することはできません。
pl: Wodna Zasadzka: Jednostka potrafi się chować pod wodą. Wrogie oddziały nie mogą dostrzeć tej jednostki, kiedy stoi ona w wodzie, ale tylko pod warunkiem, że obok tej jednostki nie stoją inne, również wrogie oddziały. Jeśli jakakolwiek jednostka przypadkiem natrafi na jednostkę ukrywającą się, traci wszystkie punkty ruchu.

source: Regenerates +4: At the begining of each turn this unit heals +4 hp. If it is poisoned, it will remove it instead of healing.
ja: 再生 +4: このユニットはターンのはじめにヒットポイントが 4 回復します。毒に冒されているときは回復の代わりに解毒されます。
pl: Regeneruje się +4: Na początku każdej tury jednostka odzyskuje 4 punkty życia. Jeśli jest zatruta to najpierw usunie truciznę, a dopiero w następnej turze odzyska punkty życia.

source: Awaken: if a friendly adjacent unit with more than one hitpoint at the beginning of the battle dies, it is resurrected, gets +6 experience and remains in battle with one hitpoint. If it dies again (having one hitpoint), it will be killed for sure.
pl: Wskrzesza: jeśli sąsiednia przyjazna jednostka z więcej niż 1 punktem życia zginie w walce, to zostanie przywrócona do życia, dostanie 6 punktów doświadczenia i pozostanie na polu bitwy z 1 puntem życia. Jeśli znowu zginie (mając 1 punkt życia) to nie zostanie wskrzeszona.

source: Awe: This unit can frighten enemy units that are next to it, making them fight worse. Adjacent enemy units of lower level will do less damage in battle. When a unit adjacent to, of the same level, or a lower level than, and is an enemy of the unit with Terror engages in combat, its attacks do 15% less damage times the difference in their levels + 15%.
pl: Straszy: Jednostka wzbudza strach wśród okolicznych wrogich jednostek, sprawiając, że walczą gorzej. Pobliskie wrogie jednostki niższych poziomów walczą gorzej (-15% do obrażeń na każdą różnicę poziomu).

source: banish: If a Banisher hits an enemy magical unit, the enemy will turn into a DG 'Dimensional Gate', (this happens only if the target is exactly one level below the banisher). If the enemy is at least two levels below your banisher, it'll get completly destroyed. Any other enemy won't be affected.
ja: 追放: 追放が魔法生物に命中すれば、敵は DG（次元の扉）に戻ってしまいます（これは、対象のレベルが追放を使うユニットのレベルよりも 1つだけ低いときにのみ起こります）。もし、敵のレベルが 2レベル以上低いときには、完全に破壊することができるでしょう。他の敵にはいかなる効果も与えません。
pl: wygnanie: Jeśli Wyganiacz trafi wrogą magiczną jednostkę, zamieni się ona we Wrota Wymiarów (to dzieje się tylko wtedy, kiedy cel jest o jeden poziom niższy od Wyganiacza). Jeśli przeciwnik jest conajmniej o 2 poziomy niższy od wyganiacza, zostaje kompletnie unicestwiony. W pozostałych przypadkach zdolność nie działa.

source: circle of banishment: This unit can affect enemy magical units that are next to it, making them fight worse. Adjacent enemy magical units of lower level will do less damage in battle. When a unit adjacent to, of the same level, or a lower level than, and is an enemy of the unit with Circle of Banishment engages in combat, its attacks do less damage (-40% lvl0, -30% lvl1, -15% lvl2, -10% lvl3).
ja: 追放の魔法陣: このユニットは、隣接する魔法生物ユニットを弱体化させることができます。 レベルが低い隣接する敵の魔法生物ユニットは、戦闘で与えるダメージが低下します。このユニットと同じレベルかより低いレベルのとき、追放の魔法陣の影響範囲にいる敵の魔法生物ユニットは戦闘で与えるダメージが低下 (-40% lvl0, -30% lvl1, -15% lvl2, -10% lvl3) してしまいます。
pl: krąg wygnania: Ta jednostka potrafi wpływać na okoliczne wrogie jednostki magiczne, sprawiając, że walczą one gorzej. Przyległe wrogie jednostki magiczne niższych poziomów będą zadawać mniejsze obrażenia w walce ( (-40% poziom 0, -30% poziom 1, -15% poziom 2, -10% poziom 3).

source: Double attack: This unit can attack 2 enemies in one turn, but cannot move from a hex, where first enemy was attacked.
ja: 2回攻撃: このユニットは1ターンに2対の敵を攻撃することができます。ただし、そのときに移動することはできません。最初に攻撃した敵を更に攻撃することもできます。
pl: Podwójny atak: Jednostka potrafi w jednej turze zaatakować 2 cele z tego samego miejsca.

source: Cleave: A unit with this ability can hurt units that are adjacent to the attacker and the defender at the same time.
ja: 開裂: この攻撃は、攻撃側ユニットと防御側ユニットに隣接しているユニットにもダメージを与えます。
pl: Cios obszarowy: Jednostka z tą zdolnością potrafi razić jednostki stojące obok swojego głównego celu.

source: hydra's strike
pl: atak hydry

source: Hydra's strike: This ability allows an owner to do damage to 2 hostile units standing near a target.
pl: Atak hydry: Ta zdolność pozwala jednostce zaatakować dodatkowo wrogie jednostki stojące obok swojego głównego celu.

source: Troll leader: This unit can lead our own Trolls that are next to it, making them fight better. Also ALL adjacent friendly units receive a +30% bonus to fire, cold and arcane resistance. Adjacent own Trolls will do more damage in battle (20% more) and all adjecent friendly units gain better magical resistance (30% more applied to fire, cold and arcane resistance).
pl: Dowódca Trollów: Jednostka potrafi wspierać w walce inne przyjazne Trolle, dzięki czemu walczą one lepiej. Poza tym WSZYSTKIE inne jednostki w pobliżu otrzymują 30% bonus do odporności na ogień, chłód i tajemny typ obrażeń. Przyległe sojusznicze Trolle zadają większe obrażenia w walce (+20%). Poza tym WSZYSTKIE inne jednostki w pobliżu otrzymują 30% bonus do odporności na ogień, chłód i tajemny typ obrażeń.

source: Summon
pl: Przywołaj

source: To summon a unit right-click on adjacent hexes near a selected summoner. You need all movement points (and remaining attacks) to summon one creature. You are unable to summon from castles or keeps. A new unit can't be summoned on water. Every summoning adds +4 to current experience. If there are 2 or more summoners, a new unit will be summoned by the last selected unit able to summon.
pl: Aby przywołać jednostkę magiczną kliknij prawym przyciskiem myszy na wolny heks obok przywoływacza. Potrzebujesz wszystkich punktów ruchu i ataków aby przyzwać jednostkę. Przywołanie nie działa w zamkach i twierdzach. Nowa jednostka nie może być przywołana na wodzie.

source: Some of the Dark Blood Shamans get corrupted. By who, or what, nobody knows, but it makes them exchange their Water Magic for that of its polar opposite - Fire. They lose their healing abilities, but they don't seem to care, as they say that Fire is inherently supirior to Water. Whatever corrupts them changes their personalities, too, making them selfish and cruel. As a result, they are shunned from their tribes, which exile them to the heart of the Great Bog. Forced to wander the Bog for years, they usually make their way out and hire themselves to some of the morally bankrupt Tribes.
ja: どす黒い血の一族の呪術師の中には、堕落する者もいます。誰によって、あるいは何によってなのかは全く知られていませんが、水の魔力と対極にある力、すなわち火の魔力を手に入れます。彼らは治癒の力は失ってしまいますが、火は本質的に水に優っていると主張して気に留めているようすもありません。そして、利己的で残酷な人格に豹変してしまいます。その結果、彼らは一族から敬遠され、Great Bogの中心部に追放されます。何年も湿原を彷徨うことを強要された彼らは、大抵は解決策を見つけ出し、道徳観の崩壊した部族に雇用される者もいます。

source: If the Dark Blood Tribe is known for something, it's their shamanistic magic. Those saurians who choose to learn it are usually frail of body and unfit to do battle physically. However, their control of water magicks is invaluable in battle, both to heal their allies, and to hurl balls of ice at their foes.
ja: どす黒い血の一族が何で知られているのかといえば、それは呪術師の魔法です。これを学ぼうと考えたトカゲは、大抵の場合、その体は貧弱で肉体的な戦闘には不向きです。しかしながら、水の魔法を操る彼らは戦闘では大変有益です。同胞の傷を癒したり、敵対する者に氷の球を投げつけたりします。

source: Mu
ja: ム

source: mu
ja: 厶

source: Um
ja: ウム

source: um
ja: ウム

source: Promoted to the Second Degree, summoners are proficient enough to perform minor summonings, using their own bodies as the medium. With a magical circle traced in their hands, they can let loose magical arrows that strike foes with surefire aim. Summoners, armed with hammers and scimitars, are trained in slaying enemies in both close quarters and afar. Special Notes: Precison: Ranged attack of this unit always has a 80% chance to hit.
ja: 第2段階に進んだ召喚士は、媒体として自らの体を用いて僅かな召喚術を行えるようになります。その手に魔法の円盤を携えた彼らは、目標とした敵を確実に打ち抜く魔法の矢を放つことができます。また、ハンマーとシミターで武装した召喚士は、近くの敵でも遠くにいる敵でも殺せるような訓練を受けています。 特記事項: 精度: このユニットの投射攻撃は常に 80% の確率で命中します。

source: kamikaze
ja: カミカゼ
