Repository: wescamp/Era_of_Magic-1.10
Catalog: po/*.po
Languages: de, hu, it, ja, pl

source: Camels and riders that survive their first battles together and become versed in their skill are promoted to the next and highest rank, the heavy camel rider. With their new status, heavy camel riders distinguish themselves from the rest of their comrades by adorning their mount and themselves with colorful clothes, amulets, and beads. In times of peace, they train small groups of less experienced riders, while in war they perform the role of vanguard, riding ahead of summoners and their elementals.
de: Kamele und Reiter, die ihre ersten gemeinsamen Schlachten überleben und sehr großes Geschick erlangen, werden in den nächsten Rang erhoben, den des Kamelritters. Mit ihrer neuen Position setzen sich Kamelritter von den übrigen Kamelreitern ab, indem sie ihr Kamel und sich mit farbigen Stoffen, Amuletten und Perlen schmücken. Im Frieden bilden sie kleine Gruppen weniger erfahrener Reiter aus, während sie im Krieg als Vorhut dienen und den Beschwörern und ihren Geistern vorausreiten.
hu: A tevegelők és tevéik, akik együtt élték túl az első csatáikat, jól összeszoknak, s egy fejlettebb egységé lépnek elő, nehéz tevegelővé. Új helyzetükben a nehéz tevegelők elkülönítik magukat a többiektől, felcicomázzák hátasukat, s maguk is kiöltöznek színes ruhákba, amuletteket és gyöngyöket tesznek a nyakukba. Békeidőben a kevésbé gyakorlott tevegelők csoportját képezik ki, míg háborúban az előörs szerepét játsszák, a varázslók és elemi lényteik előtt járnak.
it: I cammelli e i cavalcatori esperti che sopravvivono le loro prime battaglie insieme, vengono promossi al prossimo e più alto rango: il grande cavalcatore di cammelli. Con questo nuovo status, il grande cavalcatore di cammelli si distingue dal resto dei camerati adornando il proprio cammello e sé stesso con amuleti, perle e abiti colorati. In tempo di pace, allenano piccoli gruppi di cavalcatori poco esperti, mentre in guerra eseguono il ruolo di avanguardia, cavalcando davanti gli evocatori e i propri elementali.

source: Heavy Summoner
de: Schwerer Beschwörer
hu: Tudós varázsló
it: Evocatore possente
ja: 肉体派召喚士
pl: Ciężki Przywoływacz

source: A summoner trained in the ‘heavy arts’ holds a unique advantage over other summoners of the Third Degree: the knowledge of summoning a support-based circle around themselves and their allies. Circles of resistance will ward off incoming magical attacks, lessening their impact and protecting the heavy summoner’s comrades. Heavy summoners are disciplined to fight in direct face-to-face brawls, boasting physiques built for resilience and strength. Rather than focusing their training on the summoning arts, they cultivate their brawn through their years to dominate fights in close-range. Heavy summoners still know their Second Degree’s ability of summoning magical arrows, though it is an ability that has been forsaken for the sake of their muscles. Like their fellow neutral summoners, heavy summoners can call forth Rhamis from the Abyss through their summoning circles.
de: Ein Beschwörer, der die »Schweren Künste« erlernt, verfügt über einen einzigartigen Vorteil gegenüber anderen Beschwörern des Dritten Ranges: das Wissen, wie man einen Hilfskreis beschwören kann, den Schutzkreis, der ihn und seine Verbündeten gegen magische Angriffe abschirmt, sodass diese weniger Schaden anrichten und die Kameraden des Schweren Beschwörers stets geschützt sind. Schwere Beschwörer sind sehr gut im Handgemenge und haben mächtige Staturen, die auf Stärke und Zähigkeit ausgelegt sind. Statt sich auf die Verbesserung ihrer Beschwörungsfähigkeit zu konzentrieren, trainieren sie ihre Muskeln im Laufe der Jahre, um den Nahkampf zu beherrschen. Schwere Beschwörer benutzen weiterhin ihre Fähigkeit des Zweiten Ranges, magische Pfeile zu verschießen, doch diese Fähigkeit ist in den Hintergrund getreten vor ihre Körperkraft. Wie die Neutralen Beschwörer können Schwere Beschwörer durch ihre Portale Rhami' aus dem Abgrund rufen.
hu: A hadviselés tudományában képzett varázsló fontos előnnyel rendelkezik a többi hármas szintű varázslóhoz képest: hozzájuk hasonlóan a megidézést a köré vont körben is képes művelni, de az ellenállási köre gyengíti a mágikus támadások erejét, csökkenti az ütés okozta sebzést is, s védelmet ad a hozzá közel állóknak is. A tudós varázslókat szemtől-szembeni harcra nevelik, az erő és a rugalmasság a fő fegyverük. Ahelyett, hogy a megidézésre koncentrálnának, a testi erejüket fejlesztik éveken át, s a közelharci képességükkel tűnnek ki. A tudós mágusok képesek a kettes szintű varázsló korukban megismert mágikus nyilak megidézésére, habár ez a képességük az izmaik fejlesztése közben háttérbe szorult. Ahogy kollégáik, a semleges varázslók, úgy a tudós varázslók is képesek rhamikat megidézni a Mélységből a megidéző körükben.
it: Un evocatore addestrato nelle “arti possenti” entra in possesso di un vantaggio unico rispetto agli altri evocatori di terzo rango: la conoscenza di un cerchio d’evocazione aggiuntivo attorno a loro e ai loro alleati. Il cerchio della resistenza difende contro gli attacchi magici, riducendo il loro impatto e proteggendo i compagni dei potenti evocatori. Gli evocatori possenti, piuttosto di concentrarsi sull’allenamento delle arti evocative, preferiscono coltivare la loro forza in anni di combattimenti e sono disciplinati nei combattimenti corpo a corpo, vantandosi di un fisico forte e resistente. Ciò nonostante conoscono ancora l’invocazione di frecce magiche acquisite nel secondo rango, anche se questa è un’abilità dimenticata per l’amore dei propri muscoli. Assieme ai loro compagni evocatori neutrali, gli evocatori possenti possono richiamare le rhami dall’Abisso attraverso i cerchi di evocazione.

source: magic arrow II
de: Magischer Pfeil
hu: mágikus nyíl II
it: freccia magica II
ja: 魔法の矢 II
pl: magiczna strzała II

source: scroll
de: Zauberspruch
hu: tekercs
it: pergamena
ja: 巻物
pl: zwój

source: Ho’rhamis are the generals of the summoners’ armies, looking down upon the battlefield with an impartial eye. Though still avengers at heart, Ho’rhamis, as leaders, have grasped how to balance the importance of the lives of their companions. When leading in the front lines, Ho’rhamis strike with ferocity, their twin spears piercing and vivisecting live men. Even their inner magic has emerged to form the shape of a spear, attacking opponents from afar with precise deadliness.
de: Ho'rhami' sind die Feldherren der Armeen al-Kamijas. Sie sehen mit einem unvoreingenommenen Blick auf das Schlachtfeld hinab. Auch wenn sie immernoch iim Herzen Rächer sind, haben Ho'rhami' als Anführer begriffen, wie man die Leben einiger Genossen mit denen anderer abwiegen muss. Wenn Ho'rhami' an vorderster Front führen, schlagen sie rücksichtslos zu, wobei ihre beiden Speere durchbohren und lebendig zerfetzen. Selbst ihre innere Magie tritt als Speer auf, um Gegner aus der Ferne mit tödlicher Genauigkeit zu treffen.
hu: A Ho'rhamik a varázslók seregének tábornokai, akik közönyösen szemlélik a csatatereket. Habár szívükben a bosszú érzete lobog, a Ho'rhamik megtanulták értékelni a társaságukban lévők életének fontosságát másokéhoz viszonyítva. A támadósorok élén vadul küzdenek, ikerdárdáikkal cafatokra szaggatják az ellenséget, mintegy élve boncolják fel őket. Még mágikus erejüket is dárdává formálják, hogy távoli, halálos pontosságú csapást mérjenek ellenségeikre.
it: Le ho’rhamis sono i generali delle armate degli evocatori e hanno l’abitudine di osservare la battaglia con occhio imparziale. Sebbene siano molto vendicative, come leader hanno colto l’importanza delle vite dei propri compagni. Quando comandano il fronte, le ho’rhamis combattono con due lance create dalla loro magia interiore con le quali colpiscono i nemici da distante con una precisione micidiale e con con una ferocia inaudita.

source: double divine spear
de: Doppelt Göttlicher Speer
hu: isteni dupladárda
it: doppia lancia divina
ja: 神の槍 x2
pl: podwójna boska włócznia

source: Jinn
de: Djinn
hu: Dzsinn
it: Genio
ja: ジン
pl: Dżin

source: Jinns are special by even summoners’ standards due to their cognitive process to think, comprehend, learn, and even talk: an affinity that no other elemental from the Abyss can ever acquire. Made entirely of magic, jinns are vulnerable to the arcane magicks though more resilient against tangible weapons. These entities, while able to err like humans, are valued allies of the summoners, with their curious thoughts always wandering about.
de: Djinn sind sogar in Bezug auf die Beschwörer eine Besonderheit, wegen ihrer geistigen Fähigkeiten zu sprechen, zu denken, zu lernen, zu verstehen; ein Hang, den kein anderer Bewohner des Abgrundes je erreichen kann. Da sie vollständig aus Magie bestehen, sind sie zwar verwundbar durch arkane Zauber, nicht so sehr jedoch durch physische Waffen. Auch wenn diese Wesen wie Menschen fehlbar sind, sind sie kostbare Verbündete Al-Kamijas. Ihre neugierigen Gedanken sind immer auf der Suche.
hu: A dzsinnek még a varázslók számára is különleges lények, lévén sajátos gondolkodásmódjuk van, vágynak a megismerésre, a tudásra, a beszélgetésekre: olyan tulajdonság ez, amely a többi elemi lény számára teljesen elérhetetlen. Mivel maguk is mágikus lények, a dzsinnek könnyen sebezhetők földöntúli mágiával, bár a fegyverekkel nehéz őket megsebezni. Ezek a lények, ugyanúgy képesek hibázni, mint az emberek, mégis értékes szövetségesei a varázslóknak, szüntelenül csapongó gondolataikkal egyetemben is.
it: I geni sono speciali per molti evocatori grazie alla loro capacità di pensare, comprendere, imparare, e persino parlare: un’affinità che nessun altro elementale dell’Abisso può acquisire. Fatti interamente di magia, i geni sono molto resistenti contro le armi tangibili anche se molto vulnerabili agli attacchi esoterici. Queste entità sono gli alleati più valorosi degli evocatori e per la capacità di pensare possono commettere errori come gli umani.

source: magical dagger
de: Magischer Dolch
hu: mágikus tőr
it: pugnale magico
ja: マジカルダガー
pl: magiczny sztylet

source: Wonderful Jinn
de: Erhabener Djinn
hu: Csodás dzsinn
it: Genio magnifico
ja: ワンダフルジン
pl: Wspaniały Dżin

source: Wonderful jinns are sages in the summoners’ society, spreading their wisdom to any ear willing to listen. Their unequaled imagination and intellect of the world is evident through their vast multitude of elemental and arcane spells. Jinns of such high caliber have taught themselves how to perform offensive summonings, an attainment that earns them prominent respect among their human peers. Wonderful jinns have long since been independent, servants to their masters no longer. It is a mystery as to whether or not they have sated their immeasurable thirst, for they still follow the orders of their superiors and have not yet retired into the shadows of the world.
de: Erhabene Djinn sind Mentoren der Gesellschaft al-Kamijas, bereit ihre Weisheit an jeden weiterzugeben, der sie zu vernehmen bereit ist. Ihre konkurrenzlose Vorstellungskraft und Intelligenz zeigt sich in ihrem gewaltigen Arsenal an Angriffszaubern. Djinn von hohem Kaliber, die sich selbst offensive Beschwörungen erarbeitet haben, verlangen ihren menschlichen Kollegen gewaltigen Respekt ab. Erhabene Djinn sind schon seit langen unabhängig, nicht länger Diener ihrer Herren. Es ist ein Rätsel, ob sie ihren unermesslichen Hunger gestillt haben, da sie noch immer die Befehle ihrer Vorgesetzten befolgen und sich noch nicht in die Schatten der Welt zurückgezogen haben.
hu: A csodálatos dzsinnek a varázslók társadalmának bölcsei, akiknek bölcsességét minden értő fül hallani akarja. Felülmúlhatatlan tudásuk és intellektusuk világossá válik sokféle elemi és földöntúli varázslataik okán is. E csúcsképességű dzsinnek megtanulták azt is, hogy idézzenek meg támadó lényeket, amivel kivívták emberi gazdáik tiszteletét is. A csodálatos dzsinnek sokáig szolgálták az embereket, de ennek az időnek vége szakadt. Rejtély, hogy kielégítették-e vagy sem tudásszomjukat, mindenesetre még mindig követik feljebbvalóik utasításait, s nem húzódnak vissza a világ árnyékos oldalára.
it: I geni magnifici sono i saggi della società degli evocatori e diffondono la loro saggezza a chiunque si metta ad ascoltarli. La loro ineguale immaginazione e intelletto del mondo sono evidenti attraverso la loro vasta affluenza di evocazioni e incantesimi esoterici. I geni di tale alto livello hanno imparato da soli l’utilizzo delle evocazioni offensive, una conquista che fa guadagnare il rispetto tra i loro coetanei umani. Questi geni sono indipendenti da molto tempo, e non sono più servi dei loro vecchi padroni. È un mistero sul come essi abbiano saziato la loro sete incommensurabile, e sul perché continuino ad eseguire gli ordini dei loro superiori invece di ritirarsi nell’oscurità del loro mondo.

source: ultra circle
de: Kreis der Vollkommenheit
hu: ultrakör
it: super-cerchio
ja: ウルトラサークル
pl: ultra krąg

source: Mystical Jinn
de: Mystischer Djinn
hu: Misztikus dzsinn
it: Genio mistico
ja: ミスティカルジン
pl: Mistyczny Dżin

source: “What is enlightenment? Is it the curtain of darkness that falls upon a man’s eyelids when death creep-crawls upon him? Is it the bright red of splattered blood that has been gurgled from a choked throat? The ripping of the world’s fabrics as they are torn apart? Or the death-sounds that soldiers finally utter before my magic enters their hearts? I do not know. Yet there comes a certain satisfaction that can only be acquired through what I have toiled, what I have carried out in the ages of man. It is a pleasure so oil-smooth that my existence cannot help but cry out in happiness. But there is more out there...other worlds that I have only begun to explore. As deep as my power may run, it is insubstantial in the face of greater things. I need to ascertain all the worlds there are, no matter how many they are in number, or how wide and how far they span across the universes. Beyond imagination, I shall reach out and grasp whatever lies in the shadows for me. Even if I must create millions of voids across millions of dimensions, I shall persist in my pursuit of knowledge. I will learn more. I will discover more.” ― Mystic Jinn
de: »Was ist Erleuchtung? Ist es der Vorhang der Dunkelheit, der vor dem Auge fällt. wenn der Tod sich anschleicht? Ist es das leuchtende Rot vergossenen Bluts, das aus durchschnittener Gurgel strömt? Das Reißen der Welt, wenn Dimensionen sich verformen? Oder die letzte Schrei, wenn mein Zauber des Kämpen Herz erreicht? Ich weiß es nicht. Und doch gibt es eine gewisse Satisfikation, die nur durch meine Taten und Werke über die Zeitalter der Menschen zu erreichen sind. Es ist eine Freude so glatt, dass meine Existenz nichts anders kann als zu frohlocken. Doch da ist noch mehr...Welten, deren Erforschung ich erst begonnen habe. So groß meine Macht auch sein mag, ist sie nichtig verglichen mit Größerem. Ich muss alle Welten erkunden, ungeachtet ihrer Zahl und Größe im Multiversum. Jenseits des Vorstellbaren werde ich greifen und erreichen, was immer in den Schatten liegt. Auch wenn ich Millionen von Leeren schaffen muss in Millionen von Dimensionen, ich muss die Suche nach Wissen verfolgen. Ich werde weiter lernen. Ich werde mehr entdecken.« -Mystischer Djinn
hu: “Mi a megvilágosodás? A sötétség függönye tán, amely akkor ereszkedik az ember szemeire, mikor a halál ólálkodik körülötte? Vagy az elvágott torokból előspriccelő vöröslő vér? Vagy a föld anyagának meghasadása? Vagy talán a halál szele, ami meglegyinti a harcosokat, mielőtt a mágiám a szívüket átjárja? Nem tudom. És mégis, nagyszerű érzés az, amikor sokéves vesződség után valamit sikerül kihozni egy emberből. Olyasvalami ez, mint amikor hájjal kenegetnek valakit, s kiáltani szeretnék a gyönyörűségtől. De van itt még más is... más világok, amiket csak most kezdtem felfedezni. Olyan mélyre hatoltam, amilyenre csak tudtam, s csak értetlenséget találtam a legnagyobb lények arcán is. Muszáj megismernem minden világot, nem számít, mennyi létezik, mekkorák, s mennyit kell utaznom hozzájuk az univerzumon keresztül. Túl minden határon. Elérek bárhová, s meg akarok érteni mindent, ami még homályos előttem. Mégha milliónyi űrt is kell csinálnom milliónyi dimenzióban. Semmi sem állíthat meg a tudás utáni vágyakozásomban. Többet akarok tudni. Többet akarok felfedezni.” -Misztikus Dzsinn
it: “Che cos’è l’illuminazione? È la cortina di tenebra che discende nelle palpebre dell’uomo quando la morte lenta striscia accanto di lui? È il rosso vivo del sangue che gorgoglia in una gola strozzata? Lo squarcio del mondo, già a pezzi? O i suoni di morte che i soldati pronunciano prima che la mia magia entri nei loro cuori? Io non lo so. Eppure c’è una soddisfazione che può ancora essere acquisita attraverso ciò che ho faticato e svolto nelle ere dell’uomo. È un piacere così dolce e calmo avere un’esistenza che non può fare a meno di gridare dalla felicità. Ma c’è di più fuori da qui...altri mondi che ho appena iniziato di esplorare. Per quanto profondo sia il mio potere, rimane sempre debole di fronte alle cose più grandi. Ho bisogno di conoscere tutti i mondi presenti, non importa il loro numero, la loro grandezza o fino a che punto si estendono nell’universo. Al di là dell’immaginazione, raggiungo e afferro qualsiasi cosa si nasconda nelle ombre. Anche se devo creare milioni di vuoti in milioni di dimensioni, persisto nella mia ricerca della conoscenza. Imparerò molto. Scoprirò di più.” ― Genio mistico

source: dimensional vortex
de: Strudel der Dimensionen
hu: dimenziós örvény
it: vortice dimensionale
ja: 次元の渦
pl: wir wymiarów

source: Neutral Summoner
de: Neutraler Beschwörer
hu: Semleges varázsló
it: Evocatore neutrale
ja: 中立召喚士
pl: Neutralny Przywoływacz

source: Neutral summoners are the most enigmatic of the Summoners of the Third Degree. These summoners specialize in strange enfeebling magic that robs the life of foes with every strike. A covert group among summoners, neutral summoners infuse their scimitars with their ‘draining’ magic and also have learned to create their own unique circles of the same magic. Neutral summoners are able to summon the fas Jinns through complex circles that connect their world with the Abyss.
de: Die Neutralen Beschwörer sind die rätselhaftesten Träger des Dritten Grades. Sie spezialisieren sich auf eine eigenartige Magie, die ihren Gegnern mit jedem Hieb Leben raubt. Diese verschwiegene Gruppe unter den Beschwörern verzaubert ihre Säbel mit ihrer »Entzugsmagie« und haben zudem magische Kreise erfunden gleicher Natur. Neutrale Beschwörer können zudem die flinken Rhami' durch komplexe Portale zum Abgrund beschwören.
hu: Hármas szintű varázslóként a semleges varázslók a legrejtélyesebb eltévelygők. Ezek a varázslók egy különleges gyengítő mágiát alkalmaznak, amelynek segítségével életerőt vonnak el az ellenségeiktől. A varázslók között e rejtett csoport, a semleges varázslók felruházzák handzsárjukat a 'megcsapoló' mágiájukkal, s megtanulták ugyanezzel a mágiával felruházni egyedi mágikus körüket is. A semleges varázslók energikus rhamikat képesek megidézni bonyolult körükben, amely összeköti világukat a Mélységgel.
it: Misteriosi e aderenti a un’organizzazione segreto, gli evocatori neutrali sono specializzati nel sfruttare una strana magia di assorbimento infusa nelle loro stesse scimitarre che indebolisce i nemici, rubandone l’energia ad ogni colpo. Inoltre riescono ad evocare i geni attraverso cerchi complessi che collegano il loro mondo con quello dell’Abisso.

source: circle of balance
de: Ausgleichskreis
hu: egyensúlyi kör
it: cerchio dell’equilibrio
ja: 調和の魔法陣
pl: krąg równowagi

source: Novice Summoner
de: Jungbeschwörer
hu: Varázslótanonc
it: Novizio evocatore
ja: 召喚士見習い
pl: Przywoływacz Nowicjusz

source: Pupils of the summoning world are first taught the inscriptions and symbols fundamental to their craft. Lacking the experience that comes with age and combat, novices are unable to apply these arts without the aid of mediums, such as scrolls of parchment for fiery evocations. Summoning is an exact art, however, and even the most elementary spells will hit with certainty. Unlike the magi of other societies, novice summoners are by no means frail, and are proficient with both scimitars and their bare hands in combat. Special Notes: Precision: The ranged attack of this unit always has an 80% chance to hit.
de: Die Schüler der Beschwörung erlernen zuerst die grundlegenden Sigillen und Symbole ihres Handwerks. Da es ihnen an Erfahrung durch Alter und Schlacht fehlt, können Anfänger ihre Künste nicht ohne die Hilfe von Medien wie Schriftrollen für feurige Flüche einsetzen, Da die Beschwörung allerdings eine exakte Angelegenheit ist, treffen auch die meisten Grundzauber sicher. Anders als die Zauberer anderer Gesellschaften sind Jungbeschwörer ganz und gar nicht fragil und können mit Säbeln und bloßen Händen kämpfen.
hu: A mágikus világgal ismerkedők először e világ szimbolikus alapjait és jelenségeit tanulják meg. A küzdelem és a sokéves tapasztalatok hiánya miatt a tanítványoknak kezdetben szükségük van némi segítségre a mágia gyakorlásához, mint például pergamentekercsekre a tűz megidézéséhez. A varázslás egy precíz tudomány, még a legegyszerűbb bűvölés is nagy valószínűséggel sikerrel jár. Más társadalmak mágusaihoz képest a varázslók tanítványai nem hitvány eszközökkel vannak felszerelve, hanem handzsárral, amelyet kiválóan forgatnak, de puszta kézzel is jól harcolnak. Megjegyzés: Precizitás: Az egység távolsági támadása 80% eséllyel talál.
it: Agli studenti evocatori di tutto il mondo vengono prima insegnati le trascrizioni e i simboli fondamentali per il loro mestiere, Anche se manca l’esperienza che verrà con l’età e in guerra, i novizi non sono in grado di applicare questa arte senza l’ausilio di mezzi, come i rotoli di pergamena per le evocazioni di fuoco. L’evocazione è un’arte molto precisa, quindi gli incantesimi più elementari andranno a segno. A differenza dei maghi di altre società, gli evocatori novizi non sono gracili e sono molto abili nell’uso della scimitarra e nei combattimenti a pugni. Note speciali: L’attacco a distanza di questa unità ha sempre una possibilità pari all’80% di colpire.
