Repository: wescamp/Era_of_Magic-1.10
Catalog: po/*.po
Languages: de, hu, it, ja, pl

source: Air avatars have distinguished themselves from mere elementals, developing into stormy vortexes, wind and dark clouds circulating inside and outside itself. Avatars have transformed into breathing tempests. Gaining a more substantial body, avatars are less susceptible the common weaponry of swords and arrows. Air avatars guide themselves with the currents they have created, drifting from place to place, crackling with lightning from within their ethereal innards.
de: Luftmanifestionen unterscheiden sich von bloßen Luftgeistern: Sie entwickeln sich zu tosenden Windhosen, von Gewitterwolken umtost. Manifestationen haben sich in lebende Stürme verwandelt. Durch ihren festeren Körper sind sie weniger anfällig gegen gemeine Schwerter und Pfeile. Luftmanifestationen bewegen sich in den von ihnen erschaffenen Winden, während Blitze aus ihrem ätherischen Inneren zucken.
hu: A szélvészek megkülönböztetik magukat az egyszerű elemi lényektől, viharos örvényeket kavarnak, szél és sötét felhők kavarognak a besejükben és körülöttük. A szélvészek viharos förgetegként zúdulnak előre. Légies testüknek köszönhetően a szélvészeket nem fogják a hagyományos szúró- és vágófegyverek. A szélvészek az általuk keltett áramlatokon haladnak pontról-pontra, s sistergő villámokat szórnak útközben.
it: Gli avatar d’aria si distinguono dai loro semplici elementali per la loro forma a vortice. Venti e nuvole oscure compongono il loro corpo, tanto che vengono considerati come “tempeste viventi”. Rafforzati con un corpo solido, gli avatar sono meno sensibili alle armi comuni come spade e frecce e riescono a muoversi da soli seguendo le correnti che creano da soli, girovagando in molti posti e tuonando dalle viscere più profonde.

source: hurricane
de: Wirbelsturm
hu: hurrikán
it: uragano
ja: ハリケーン
pl: huragan

source: Air Elemental
de: Luftgeist
hu: Szellőlény
it: Elementale dell’aria
pl: Żywiołak Powietrza

source: Air elementals are magical entities built entirely out of the Abyssal atmosphere. Summoned elementals, introduced in a world where air is omnipresent, regenerate their bodies continually with time’s passage. Given their anatomies, elementals of this variety are quick and evasive, albeit having a delicate frame that could be destroyed instantly by a well-placed attack. However, a ‘well-placed attack’ would be difficult to place on these elementals, given their highly resistant bodies of air. Still, summoners who stir such beings into their world know that an air elemental could vanish just as quickly as it was summoned forth.
de: Luftgeister sind magische Geschöpfe, die ausschließlich aus der Atmosphäre des Abgrundes bestehen. Werden diese Geister in eine Welt befördert, in der Luft allgegenwärtig ist, erneuert sich ihr Körper fortwährend. Aufgrund ihrer Anatomie ist diese Form von Elementargeist schnell und schlecht zu fassen, obschon ein gut platzierter Angriff sie sofort zerstören könnte. Allerdings ist ein »gut platzierter Angriff« recht schwer bei diesen Geistern zu platzieren, wenn man bedenkt, dass sie aus Luft bestehen, Nichtsdestotrotz wissen Beschwörer, die diese Wesen in ihre Welt rufen, dass ein Luftgeist ebenso schnell vergehen kann, wie er herbeibeschworen wurde.
hu: A szellőlények mágikus lények, teljes egészében mélységi atmoszférából állnak. A megidézett lények világunkba lépve a mindenütt jelenlévő levegőt kihasználva folyamatosan építik testüket. Felépítésükből adódóan ezek a lények nagyon gyorsak és könnyedén elkerülik a csapásokat, de a megfelelő eszközt választva könnyen megsemmisíthetőek. Persze egy jól elhelyezett támadást nehéz kivitelezni egy rendkívül ellenálló levegővel szemben. Mindazonáltal azok a varázslók, akik megidézik őket a világunkba, nagyon is tisztában vannak vele, hogy éppoly könnyen eliillanhatnak a szellőlények, amilyen könnyen megidézhetők.
it: Gli elementali dell’aria sono entità magiche costruite interamente fuori dall’atmosfera dell’Abisso. I loro corpi si rigenerano di continuo col passare del tempo e la loro anatomia gli permette di essere molto veloci ed evasivi, ma basterebbe un singolo attacco ben riuscito a distruggere il loro corpo delicato. Tuttavia, a causa del loro corpo altamente resistente, un “attacco ben riuscito” sarebbe molto difficile da realizzare su questi elementali. Gli evocatori che invocano queste creature nel loro mondo sanno che un elementale potrebbe svanire molto velocemente.

source: small thunder
de: Kleiner Donner
hu: kis zivatar
it: piccolo tuono
ja: 小さな稲妻
pl: mały piorun

source: Air God
de: Luftgott
hu: Viharisten
it: Dio dell’aria
ja: 風の神
pl: Bóstwo Powietrza

source: Men fear the wind — what can be a gentle zephyr in the afternoon can turn into a twister in the evening. Wind and storm can turn the staunchest man into a rag doll dancing in the sky; lightning will then shoot him down back to earth. Yet air gods have much more to be feared, for they ride upon their own wind and bring about disasters at a mere order. Gods of the air are nigh immune to physical assault with bodies that appear almost identical to an actual storm. Summoners believe that even the heavens quake upon the sight of this great nimbus of raging thunder and rain living in the skies, extending calamity to wherever the eye of its storm gazes.
de: Die Menschen fürchten den Wind — was am Nachmittag eine sanfte Brise war, kann am Abend eine Windhose geworden sein. Wind und Sturm können den Stärksten in eine am Himmel tanzende Puppe verwandeln; Blitze werden ihn dann zurück auf den Boden bringen. Doch Luftgötter sind aus noch mehr Gründen zu fürchten, wie sie auf ihren eigenen Winden reiten, um jederzeit ihre eigenen Katastrophen zu entfesseln, sobald es ihnen befohlen wird. Die Götter der Lüfte sind nahezu immun gegen nahezu jeden körperlichen Angriff, und ihre Körper sind so gut wie nicht von einem echten Sturm zu unterscheiden. Die Beschwörer al-Kamijas glauben, selbst der Himmel erzittere im Angesicht diesem riesigen Gewitters rasender Blitze, das allem, was das Auge des Sturmes erblickt, das verderben bringt.
hu: Az emberek félnek a széltől-egy lenge délutáni szellőből estére hatalmas vihar kerekedhet. A szél és a vihar a legrendíthetetlenebb embert is rongybabaként táncoltatja az égben; aztán egy villámcsapás újra a földre teríti. A viharistenek még ennél is félelmetesebbek, saját szélparipán nyargalnak, s katasztrófa, pusztulás jár a nyomukban minden pillanatban. A viharistenekre gyakorlatilag nem hatnak a fizikai támadások, mivel testük gyakorlatilag maga a vihar. A varázslók hite szerint a mennyország is beleremeg, amikor ezek a dühöngő zivataros, égi lények feltűnnek az égben, s szerencsétlenséget terjesztenek mindenütt, ahol viharos szemeikkel csak megfordulnak.
it: Gli uomini hanno paura del vento...ma cosa accadrebbe se un dolce zeffiro pomeridiano si trasformasse all’improvviso in un uragano notturno? Vento e tempesta possono trasformare l’uomo più forte in una bambola che danza nel cielo, e il fulmine scagliato sulla propria testa in cenere. In più devono essere temuti ancor di più perché possono creare catastrofi con un semplice gesto. Gli dei dell’aria sono fisicamente immuni agli assalti fisici grazie ai loro corpi che sono quasi simili ad una vera tempesta. Gli evocatori credono che persino il paradiso tremi alla sola vista di queste grandi nuvole di tuoni e pioggia, le quali possono distruggere tutto con lo solo sguardo del proprio occhio.

source: Banisher
de: Bannmeister
hu: Szellemirtó
it: Esiliatore
ja: 魔力追放使い
pl: Wyganiacz

source: (no description available)
de: (keine Beschreibung verfügbar)
hu: (nincs leírás)
it: (nessuna descrizione disponibile)
pl: (brak opisu)

source: banishment
de: Bannen
hu: likvidálás
it: esilio
ja: 追放
pl: wygnanie

source: frozen gate
de: Schließen des Tors
hu: fagykapu
it: portale congelato
ja: 氷結の扉
pl: zamrożone wrota

source: Camel Rider
de: Kamelreiter
hu: Tevegelő
it: Cavalcatore di cammelli
ja: ラクダの乗り手
pl: Wielbłądzi Jeździec

source: For the fledgling soldier, camels are a rare spectacle to be seen on the fronts. Unlike their traditional brothers and sisters used as beasts of burden for traveling traders, the camels seen in battle are specially bred for speed and power rather than endurance. Riders carry a scimitar for melee skirmishes as well as dozens of smaller scimitars to hurl at faraway targets, a skill for which the camel rider is acclaimed for. Trained in scouting and hit-and-run warfare, camel riders are the forerunners of the Summoners’ brunt strength, moving at galloping speed into the fray.
de: Für Rekruten sind Kamele ein seltener Anblick an der Front. Anders als ihre traditionellen Geschwister, die Fernhändlern als Lasttiere dienen, sind die Schlachtkamele speziell auf Schnelligkeit und Stärke gezüchtet, nicht auf Ausdauer. Ihre Reiter tragen einen Säbel in der Hand für den Nahkampf sowie dutzende kleinere, die auf entfernte Gegner geworfen werden; auf diese Fertigkeit sind die Kamelreiter besonders stolz. Als Experten der Erkundung und für Überfälle dienen Kamelsreiter als die Vorhut der Truppen der Beschwörer, die zur Flanke galoppiert.
hu: A tapasztalatlan harcosok számára a teve ritka látvány a fronton. Velük ellentétben a hagyományokat folytató testvéreik, nővéreik számára a kereskedők teherhordói gyors és erős harci hátast képeznek, ha nem is túl kitartóak e szerepükben. A tevegelők handzsárral a kézben harcolnak, míg távolra kisebb handzsárokat hajítanak, amely képességükért igen nagyra értékelik őket. Gyakorlott felderítők, s mesterien alkalmazzák az üsd-és-fuss taktikát, ezért a tevegelők a Varázslók seregében oroszlánrészt vállalnak a csatákból.
it: Per i soldati alle prima armi, i cammelli sono un raro spettacolo da vedere sui fronti. A differenza dei loro simili usati come bestie da viaggio da tradizione, i cammelli visti in battaglia vengono appositamente allevati in velocità e resistenza. I cavalcatori sono acclamati per la loro abilità di usare una scimitarra per gli attacchi ravvicinati e altre dozzine di queste ma più piccole per scagliarle contro i bersagli lontani. Allenati nelle esplorazioni e nelle guerre “lampo”, i cavalcatori di cammelli sono considerati gli araldi della forza degli evocatori.

source: scimitar
de: Säbel
hu: handzsár
it: scimitarra
ja: シミター
pl: sejmitar

source: scimitar throw
de: Säbelwurf
hu: hajítóhandzsár
it: lancio di scimitarra
ja: シミター投げ
pl: rzut sejmitarem

source: Carpet Master
de: Legendärer Teppich
hu: Szőnyegmester
it: Maestro dei tappeti
ja: カーペットの主人
pl: Mistrz Dywanów

source: Captains of the winds, any carpet master can attest to having ridden the skies more times than he can count. A carpet master’s worth is still his ability to scout over long distances, though his ranged attacks have become something to be feared. Through battle, his accuracy with the powder bombs has improved considerably, allowing him to strike even the most elusive or well-protected of targets. Prized with a more regal carpet, the carpet master soars through the air as effortlessly as any bird.
de: Als Meister der Winde kann jeder Pilot eines Legendären Teppichs bezeugen, öfter den Himmel geritten zu sein, als er zählen kann, Sein Wert besteht immer noch darin, weite Entfernungen zurückzulegen, auch wenn seine Fernkampffähigkeiten formidabel sind. Durch die Schlachten ist sein Zielvermögen mit den Pulverbomben merklich gestiegen, weshalb er auch die wendigsten oder bestgeschützten Ziele treffen kann. Durch den Legendären Teppich kann er so mühelos fliegen wie ein Vogel.
hu: A szelek uraiként a szőnyegmesterek többször jártak a fellegekben, hogysem számolni lenne érdemes. A szőnyegmesterek könnyen felderíthetik a távoli vidékeket is, bár távolsági támadásuk miatt félik őket leginkább. Csatában a félelmetes pontossággal alkalmazott porbombáikkal megtörik a legravaszabb, kitűnően védett célpontot is. A legjobb anyagból készült szőnyegeikkel a szőnyegmesterek olyan könnyedén szelik a levegőt, mint a madarak.
it: Capitani dei venti, ogni maestro dei tappeti affermerebbe di aver cavalcato il cielo più volte che possa essere contato. Oltre ad esplorare e a coprire lunghe distanze, possiede un’ottima precisione nel lancio di polveri esplosive in grado di colpire i bersagli più elusivi e ben protetti. Premiato con un tappeto più regale sotto i piedi, il maestro dei tappeti vola con la stessa facilità di un uccello.

source: magical powder
de: Zauberpulver
hu: mágikus por
it: polvere magica
ja: 魔法の粉
pl: magiczny proszek

source: Carpet Rider
de: Fliegender Teppich
hu: Repülőszőnyeges
it: Cavalcatore di tappeti
ja: カーペット乗り
pl: Jeździec Dywanów

source: According to legend, the magic carpet originated from the desires of of a wealthy princess. She wished for a new mode of traveling that would be convenient and relaxing, yet ostentatious enough for her tastes. Carriages and camels were too common and bland in her eyes, so she sought something that would revolutionize transportation in the Summoners’ society. Eventually, one of her expert sorcerers wove enchanted pieces of fabric together to form what he called a ‘flying carpet’. Soon after, all affluent men and women began riding these magic carpets for their personal endeavors. Inevitably, magic carpets became of great importance in times of war, ridden only by the most hotshot and fearless young men. Atop their strange mounts, these aces of the sky perform impressive feats of reconnaissance and speed. A magical carpet cannot hold much weight, so their riders are armed with explosive powder bombs which they use to attack and disorient their targets.
de: Der Legende zufolge ist der Fliegende Teppich folge der Wünsche einer reichen Prinzessin. Sie wünschte eine neue Form der Reise, die bequem und entspannend sei, aber ostentativ genug für ihren Geschmack. Kutschen und Kamele waren ihr zu gewöhnlich und schlicht, denn sie wollte eine Neuheit für die Reisen al-Kamijas. Schließlich verwob einer ihrer erfahrenen Zauberer verzauberten Stoff und nannte das Ergebnis »Fliegender Teppich«. Bald danach begann die ganze Oberschicht, diese magischen Teppiche zu benutzen. Selbstverständlich erlangten die Fliegenden Teppiche große militärische Bedeutung, wobei sie nur von den verwegensten und furchtlosesten jungen Männern geflogen werden. Auf ihren seltsamen Gefährten vollbringen diese Fliegerasse respekteinflößende Taten bei Aufklärung und schneller Kriegsführung. Ein Fliegender Teppich kann nicht viel Gewicht aushalten, sodass seine Reiter mit Pulverbommben bewaffnet sind, um ihre Gegner anzugreifen und zu verwirren.
hu: A legendák szerint az első varázsszőnyeget egy gazdag hercegnő kívánságára készítették. Az utazásnak egy kényelmes és pihentető formájára vágyott, amely egyúttal elég feltűnő is. A szekerek és a tevék túl közönségesnek látszottak a szemében, tehát valami forradalmian új közlekedési eszközt szeretett volna meghonosítani a varázslók között. Végül az egyik tehetséges mágusa bemutatott egy különleges ruhaanyagot, amiből megformált valamit, amit úgy hívott, hogy 'repülő szőnyeg'. Nem sokkal később az előkelő hölgyek és urak ezeket a varázsszőnyegeket kezdték el használni közlekedési eszközként. A varázsszőnyegek vitathatatlanul fontossá váltak a háborús időkben, s csak a leggyorsabb és legbátrabb ifjak repülhettek rajtuk. Furcsa 'hátasaik' tetejéről ezek a légi hősök figyelemreméltó eredményességgel és gyorsasággal végezték a felderítést. A varázsszőnyeg teherbírása véges, így utasaik csak robbanó port visznek magukkal, amit támadásra, s az ellenség megzavarására használnak.
it: Secondo la leggenda, il tappeto magico è stato creato dai desideri di una principessa, la quale, per soddisfare i propri vizi, desiderò un modo nuovo di viaggiare che rivoluzionasse i trasporti nella società degli evocatori, ritenendo che ormai i cammelli e le carrozze fossero un mezzo sorpassato. Alla fine, uno dei suoi incantatori esperti riuscì a intrecciare alcuni pezzi di oggetti magici tra loro e a creare quello che noi chiamiamo oggi “tappeto volante”. Subito dopo aver creato questa invenzione, tutti gli uomini ricchi del paese cominciarono a cavalcare questi tappeti per i loro motivi personali. Inevitabilmente, i tappeti magici divennero importanti in tempi di guerra, cavalcati solo da giovani uomini audaci e senza paura. Sopra a questi strani mezzi leggeri, gli assi del cielo eseguono impressionanti voli e giri di ricognizione, attaccando i loro bersagli con polveri esplosive.

source: Dharma’rhamis are inflamed with blood-red skin, ornamented in trinkets and carrying a spear with their other two blades. Their appearances grant them the assumption of being hot-tempered in combat, but outwards they are calm and judicious, fighting with no lust for bloodshed. Still, they are driven with a mysterious intent for vengeance in the summoners’ ranks. Just as keen with their weaponry as their lesser beings, opposition will crushed by a Dharma’rhami with brutal force and tactics.
de: Dharma'rhami' sind mit blutroter Haut gezeichtet, durch Ringe verziert und neben ihren beiden anderen Klingen mit einem Speer bewaffnet. Ihr Aussehen lässt einen leidenschaftlichen Kämpfer erwarten, doch sind sie nach außen hin ruhig und abwiegend und kämpfen ohne Verlangen nach Blutvergießen. Trotzdem werden sie immer noch von einem gehiemnisvollen Rachegedanken in den Reihen der Beschwörer getrieben, Ebenso geschickt mit ihren Waffen wie niedere Rhami', wird eine Dharma'rhami Widerstand durch brutale Gewalt und Taktik niederschlagen.
hu: A Dharma'rhamik bőre piros-kék színű, s mindenféle csecsebecsékkel díszített, két kardjuk mellett dárdát is hordanak magukkal. Megjelenésükből ítélve ádáz dühvel vetik magukat a csatába, de egyébként hűvös és tárgyilagos lények, s nem a vérszomj vezérli őket. Mégis valami megfoghatatlan cél vezérli őket, hogy bosszút álljanak. Éppoly kiválóan forgatják fegyvereiket, mint a gyengébb fajtársaik, de a Dharma'rhami áldozata a roppant erőnek és a ravasz taktikának esik áldozatul.
it: Le dharma-rhami sono di colore rosso-sangue, ornate di ciondoli ed armate di lancia e doppia lama. Assumono un aspetto “bollente” in combattimento, ma in fondo sono prudenti e calme e non combattono mai per sete di sangue. Taglienti come le loro spade, i nemici verranno schiacciati dalla forza brutale e dalle tattiche delle dharma’rhami.

source: divine spear
de: Göttlicher Speer
hu: csodás dárda
it: lancia divina

source: cup of fire
de: Feuerschale
hu: tűzcsésze
it: coppa di fuoco
ja: 炎の杯
pl: kielich ognia

source: Dimensional Gate
de: Weltentor
hu: Dimenziókapu
it: Portale dimensionale
pl: Wrota Wymiarów

source: The most inexperienced of summoners are capable of summoning only dimensional gates: unstable bridges of arcane energy between this world and the Abyss. Dimensional gates, though primitive, are capable of surging forth with accurate pinpoint attacks of arcane matter. Although weak and fragile, a single fallen life is all that the gate requires in order to solidify itself into a true door for a being from the Abyss to emerge out of.
de: Die unerfahrensten Beschwörer können nur Weltentore beschwören: instabile Brücken mystischer Energien zwischen dieser Welt und dem Abgrund. Weltentore sind ihrer primitiver Natur zu Trotz mit genauen Nadelstichen angreifen. Sind sie auch schwach und leicht zu zerstören, reicht ein einziges ausgehauchtes Leben aus, dass sich das Tor zu einem wahren Portal verfestigt, durch die ein Wesen aus dem Abgrund austreten kann
hu: A leggyengébb varázslók csupán dimenziókaput képesek megidézni: ezek bizonytalan hidat képeznek a Mélység és a világunk között a földöntúli energia számára. A dimenziókapuk, habár nagyon egyszerűek, nagy pontossággal irányíthatják a földöntúli energiát támadás közben. Habár gyengék és törékenyek, egyetlen ellenség megölése is elég számukra, hogy a Mélységből áradó energia elemi lénnyé testesüljön.
it: La maggior parte degli evocatori inesperti sono capaci di evocare solamente portali dimensionali: ponti instabili di energia esoterica tra il nostro mondo e l’Abisso, in grado di colpire con ottima precisione. Sebbene deboli e fragili, una singola vita basterebbe per solidificarsi in una vera porta capace di far emergere fuori una creatura dall’Abisso.

source: blue flame
de: Blaue Flamme
hu: kékláng
it: fiamma blu
pl: błękitny płomień

source: Dimensional Gate 2
de: Weltentor 2
hu: Dimenziókapu 2
it: Portale dimensionale 2
ja: 次元の扉 2
pl: Wrota Wymiarów 2

source: yellow flame
de: Gelbe Flamme
hu: sárga láng
it: fiamma gialla
pl: żółty płomień

source: Dispeller
de: Banner
hu: Démonűző
it: Esiliatore
ja: 解呪使い
pl: Odczyniacz

source: Some Summoners choose opposite path of the summoning arts, which is known as the art of banishment. Instead of bringing magical beings to this world, they specialize in sending them back to Abyss. Having this useful knowledge, dispellers are often called by summoners when something goes wrong, for example when an Efreeti rebels.
de: Einige Beschwörer wählen den der Beschwörung entgegengesetzten Pfad, bekannt als die Kunst des Bannens. Statt magische Kreaturen in diese Welt zu bringen, spezialisieren sie sich darauf, sie in den Abgrund zurückzuschicken. Wegen dieses nützlichen Wissens werden Austreiber oft von den anderen Beschwörern zu Hilfe gerufen, wenn etwas schief geht, etwa, wenn ein Afrit sich auflehnt.
hu: Néhány varázsló a megidézéssel ellentétes útját választja a mágiának, amit a likvidálás művészetének neveznek. Ahelyett, hogy mágikus lényeket idéznének meg világunkba, ők inkább arra koncentrálnak, hogy visszaküldjék őket a Mélységbe. Ennek a tudásnak a birtokában a démonűzőket rendszerint akkor hívják a varázslók, ha valami baj történik, például, ha egy ifrit fellázad.
it: Alcuni evocatori scelgono la strada opposta delle arti evocatrici, conosciuta come l’arte dell’esilio. Invece di portare alla luce nuove creature, essi le spediscono dentro all’Abisso. Avendo questa utile conoscenza, gli esiliatori sono spesso chiamati dagli evocatori quando si sta mettendo davvero male: per esempio, quando un efreeti si ribella al proprio padrone.

source: Earth Avatar
de: Erdmanifestation
hu: Földgólem
it: Avatar di terra
ja: 土の化身
pl: Awatar Ziemi
